#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PterodactylusSwarm_Flap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ABP_PterodactylusSwarm_Flap_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PterodactylusSwarm_Flap.ABP_PterodactylusSwarm_Flap_C
// 0x0120 (0x0490 - 0x0370)
class UABP_PterodactylusSwarm_Flap_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;  // 0x0378(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_37A[0x6];                                      // 0x037A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0380(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0388(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0390(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x03B0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x03F8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0440(0x0048)()
	bool                                          RandomBool;                                        // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void Attack();
	void BlueprintBeginPlay();
	void ExecuteUbergraph_ABP_PterodactylusSwarm_Flap(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_PterodactylusSwarm_Flap_C">();
	}
	static class UABP_PterodactylusSwarm_Flap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PterodactylusSwarm_Flap_C>();
	}
};
static_assert(alignof(UABP_PterodactylusSwarm_Flap_C) == 0x000010, "Wrong alignment on UABP_PterodactylusSwarm_Flap_C");
static_assert(sizeof(UABP_PterodactylusSwarm_Flap_C) == 0x000490, "Wrong size on UABP_PterodactylusSwarm_Flap_C");
static_assert(offsetof(UABP_PterodactylusSwarm_Flap_C, UberGraphFrame) == 0x000370, "Member 'UABP_PterodactylusSwarm_Flap_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_PterodactylusSwarm_Flap_C, __AnimBlueprintMutables) == 0x000378, "Member 'UABP_PterodactylusSwarm_Flap_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_PterodactylusSwarm_Flap_C, AnimBlueprintExtension_PropertyAccess) == 0x000380, "Member 'UABP_PterodactylusSwarm_Flap_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_PterodactylusSwarm_Flap_C, AnimBlueprintExtension_Base) == 0x000388, "Member 'UABP_PterodactylusSwarm_Flap_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_PterodactylusSwarm_Flap_C, AnimGraphNode_Root) == 0x000390, "Member 'UABP_PterodactylusSwarm_Flap_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_PterodactylusSwarm_Flap_C, AnimGraphNode_SequencePlayer_1) == 0x0003B0, "Member 'UABP_PterodactylusSwarm_Flap_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_PterodactylusSwarm_Flap_C, AnimGraphNode_BlendListByBool) == 0x0003F8, "Member 'UABP_PterodactylusSwarm_Flap_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_PterodactylusSwarm_Flap_C, AnimGraphNode_SequencePlayer) == 0x000440, "Member 'UABP_PterodactylusSwarm_Flap_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_PterodactylusSwarm_Flap_C, RandomBool) == 0x000488, "Member 'UABP_PterodactylusSwarm_Flap_C::RandomBool' has a wrong offset!");

}

