#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_GoreChunck

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_GoreChunck.ABP_GoreChunck_C.AnimBlueprintGeneratedConstantData
// 0x01FF (0x0200 - 0x0001)
struct ABP_GoreChunck::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_20;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_21;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_22;                                 // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_23;                                 // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_24;                                  // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_25;                               // 0x0028(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0048(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00C8(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x00E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                    // 0x0110(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                   // 0x0140(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;          // 0x0170(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;          // 0x01A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ModifyBone;                     // 0x01D0(0x0030)()
};
static_assert(alignof(ABP_GoreChunck::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_GoreChunck::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_GoreChunck::FAnimBlueprintGeneratedConstantData) == 0x000200, "Wrong size on ABP_GoreChunck::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_GoreChunck::FAnimBlueprintGeneratedConstantData, __NameProperty_20) == 0x000004, "Member 'ABP_GoreChunck::FAnimBlueprintGeneratedConstantData::__NameProperty_20' has a wrong offset!");
static_assert(offsetof(ABP_GoreChunck::FAnimBlueprintGeneratedConstantData, __NameProperty_21) == 0x00000C, "Member 'ABP_GoreChunck::FAnimBlueprintGeneratedConstantData::__NameProperty_21' has a wrong offset!");
static_assert(offsetof(ABP_GoreChunck::FAnimBlueprintGeneratedConstantData, __NameProperty_22) == 0x000014, "Member 'ABP_GoreChunck::FAnimBlueprintGeneratedConstantData::__NameProperty_22' has a wrong offset!");
static_assert(offsetof(ABP_GoreChunck::FAnimBlueprintGeneratedConstantData, __NameProperty_23) == 0x00001C, "Member 'ABP_GoreChunck::FAnimBlueprintGeneratedConstantData::__NameProperty_23' has a wrong offset!");
static_assert(offsetof(ABP_GoreChunck::FAnimBlueprintGeneratedConstantData, __IntProperty_24) == 0x000024, "Member 'ABP_GoreChunck::FAnimBlueprintGeneratedConstantData::__IntProperty_24' has a wrong offset!");
static_assert(offsetof(ABP_GoreChunck::FAnimBlueprintGeneratedConstantData, __StructProperty_25) == 0x000028, "Member 'ABP_GoreChunck::FAnimBlueprintGeneratedConstantData::__StructProperty_25' has a wrong offset!");
static_assert(offsetof(ABP_GoreChunck::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000048, "Member 'ABP_GoreChunck::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_GoreChunck::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000C8, "Member 'ABP_GoreChunck::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_GoreChunck::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x0000E0, "Member 'ABP_GoreChunck::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_GoreChunck::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000110, "Member 'ABP_GoreChunck::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_GoreChunck::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000140, "Member 'ABP_GoreChunck::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(ABP_GoreChunck::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalToComponentSpace) == 0x000170, "Member 'ABP_GoreChunck::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(ABP_GoreChunck::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ComponentToLocalSpace) == 0x0001A0, "Member 'ABP_GoreChunck::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(ABP_GoreChunck::FAnimBlueprintGeneratedConstantData, AnimGraphNode_ModifyBone) == 0x0001D0, "Member 'ABP_GoreChunck::FAnimBlueprintGeneratedConstantData::AnimGraphNode_ModifyBone' has a wrong offset!");

// ScriptStruct ABP_GoreChunck.ABP_GoreChunck_C.AnimBlueprintGeneratedMutableData
// 0x0000 (0x0001 - 0x0001)
struct ABP_GoreChunck::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
};
static_assert(alignof(ABP_GoreChunck::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on ABP_GoreChunck::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_GoreChunck::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong size on ABP_GoreChunck::FAnimBlueprintGeneratedMutableData");

}

