#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Pterodactylus

#include "Basic.hpp"


namespace SDK::Params
{

// Function ABP_Pterodactylus.ABP_Pterodactylus_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Pterodactylus_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Pterodactylus_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_Pterodactylus_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_Pterodactylus_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_Pterodactylus_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_Pterodactylus_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_Pterodactylus_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_Pterodactylus.ABP_Pterodactylus_C.CanHeadtrack
// 0x0004 (0x0004 - 0x0000)
struct ABP_Pterodactylus_C_CanHeadtrack final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanHeadtrack_ReturnValue;                 // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Pterodactylus_C_CanHeadtrack) == 0x000001, "Wrong alignment on ABP_Pterodactylus_C_CanHeadtrack");
static_assert(sizeof(ABP_Pterodactylus_C_CanHeadtrack) == 0x000004, "Wrong size on ABP_Pterodactylus_C_CanHeadtrack");
static_assert(offsetof(ABP_Pterodactylus_C_CanHeadtrack, ReturnValue) == 0x000000, "Member 'ABP_Pterodactylus_C_CanHeadtrack::ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Pterodactylus_C_CanHeadtrack, CallFunc_CanHeadtrack_ReturnValue) == 0x000001, "Member 'ABP_Pterodactylus_C_CanHeadtrack::CallFunc_CanHeadtrack_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Pterodactylus_C_CanHeadtrack, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'ABP_Pterodactylus_C_CanHeadtrack::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Pterodactylus_C_CanHeadtrack, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'ABP_Pterodactylus_C_CanHeadtrack::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function ABP_Pterodactylus.ABP_Pterodactylus_C.ExecuteUbergraph_ABP_Pterodactylus
// 0x0058 (0x0058 - 0x0000)
struct ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_2;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_1;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_ReturnValue;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_DeltaTime_ImplicitCast;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus) == 0x000008, "Wrong alignment on ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus");
static_assert(sizeof(ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus) == 0x000058, "Wrong size on ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus");
static_assert(offsetof(ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus, EntryPoint) == 0x000000, "Member 'ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus, Temp_real_Variable) == 0x000008, "Member 'ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus, Temp_real_Variable_1) == 0x000010, "Member 'ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus, Temp_bool_Variable) == 0x000018, "Member 'ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus, Temp_real_Variable_2) == 0x000020, "Member 'ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus, Temp_real_Variable_3) == 0x000028, "Member 'ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus, K2Node_Event_DeltaTimeX) == 0x000030, "Member 'ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000034, "Member 'ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus, Temp_bool_Variable_1) == 0x000035, "Member 'ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus, CallFunc_BooleanAND_ReturnValue) == 0x000036, "Member 'ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus, K2Node_Select_Default) == 0x000038, "Member 'ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus, K2Node_Select_Default_1) == 0x000040, "Member 'ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus, CallFunc_FInterpTo_ReturnValue) == 0x000048, "Member 'ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus, CallFunc_FInterpTo_DeltaTime_ImplicitCast) == 0x000050, "Member 'ABP_Pterodactylus_C_ExecuteUbergraph_ABP_Pterodactylus::CallFunc_FInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");

}

