#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_HallucinationChar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_HallucinationChar.ABP_HallucinationChar_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_HallucinationChar_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_HallucinationChar_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_HallucinationChar_C_AnimGraph");
static_assert(sizeof(ABP_HallucinationChar_C_AnimGraph) == 0x000010, "Wrong size on ABP_HallucinationChar_C_AnimGraph");
static_assert(offsetof(ABP_HallucinationChar_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_HallucinationChar_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_HallucinationChar.ABP_HallucinationChar_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_HallucinationChar_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_HallucinationChar_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_HallucinationChar_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_HallucinationChar_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_HallucinationChar_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_HallucinationChar_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_HallucinationChar_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_HallucinationChar.ABP_HallucinationChar_C.ExecuteUbergraph_ABP_HallucinationChar
// 0x0108 (0x0108 - 0x0000)
struct ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_HallucinationChar_C*                K2Node_DynamicCast_AsBP_Hallucination_Char;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class ATICharacterBase*                 CallFunc_GetHallucinationOwner_ReturnValue;        // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Multiply_RotatorFloat_ReturnValue;        // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_A_ImplicitCast;                       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_LookYaw_ImplicitCast;           // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar) == 0x000008, "Wrong alignment on ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar");
static_assert(sizeof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar) == 0x000108, "Wrong size on ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar");
static_assert(offsetof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar, EntryPoint) == 0x000000, "Member 'ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000004, "Member 'ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar, CallFunc_Abs_ReturnValue) == 0x000008, "Member 'ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000010, "Member 'ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar, K2Node_Event_DeltaTimeX) == 0x000014, "Member 'ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000018, "Member 'ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar, K2Node_DynamicCast_AsBP_Hallucination_Char) == 0x000020, "Member 'ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar::K2Node_DynamicCast_AsBP_Hallucination_Char' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar, CallFunc_GetHallucinationOwner_ReturnValue) == 0x000030, "Member 'ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar::CallFunc_GetHallucinationOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar, CallFunc_HasAuthority_ReturnValue) == 0x000058, "Member 'ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000060, "Member 'ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000078, "Member 'ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar, CallFunc_FindLookAtRotation_ReturnValue) == 0x000090, "Member 'ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar, CallFunc_NormalizedDeltaRotator_ReturnValue) == 0x0000A8, "Member 'ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar::CallFunc_NormalizedDeltaRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar, CallFunc_Multiply_RotatorFloat_ReturnValue) == 0x0000C0, "Member 'ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar::CallFunc_Multiply_RotatorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar, CallFunc_BreakRotator_Roll) == 0x0000D8, "Member 'ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar, CallFunc_BreakRotator_Pitch) == 0x0000DC, "Member 'ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar, CallFunc_BreakRotator_Yaw) == 0x0000E0, "Member 'ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar, CallFunc_FClamp_ReturnValue) == 0x0000E8, "Member 'ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar, CallFunc_Abs_A_ImplicitCast) == 0x0000F0, "Member 'ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar::CallFunc_Abs_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar, CallFunc_FClamp_Value_ImplicitCast) == 0x0000F8, "Member 'ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar::CallFunc_FClamp_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar, K2Node_VariableSet_LookYaw_ImplicitCast) == 0x000100, "Member 'ABP_HallucinationChar_C_ExecuteUbergraph_ABP_HallucinationChar::K2Node_VariableSet_LookYaw_ImplicitCast' has a wrong offset!");

}

