#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PterodactylusSwarm_Flap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_PterodactylusSwarm_Flap.ABP_PterodactylusSwarm_Flap_C.AnimBlueprintGeneratedConstantData
// 0x01FF (0x0200 - 0x0001)
struct ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_23;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_24;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_25;                                 // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_26;                                   // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_27;                                 // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_28;                                 // 0x0029(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_29;                                // 0x0030(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_30;                               // 0x0040(0x0020)(BlueprintVisible, NoDestructor)
	bool                                          __BoolProperty_31;                                 // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_32;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_33;                               // 0x0068(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_34;                                // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_35;                                 // 0x0098(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_36;                                 // 0x0099(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_37;                                 // 0x009A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_38;                                 // 0x009C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00A8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0128(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0140(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x0170(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                // 0x01A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x01D0(0x0030)()
};
static_assert(alignof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData) == 0x000200, "Wrong size on ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData, __NameProperty_23) == 0x000004, "Member 'ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData::__NameProperty_23' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData, __NameProperty_24) == 0x00000C, "Member 'ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData::__NameProperty_24' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData, __BlendProfile_25) == 0x000018, "Member 'ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData::__BlendProfile_25' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData, __CurveFloat_26) == 0x000020, "Member 'ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData::__CurveFloat_26' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData, __EnumProperty_27) == 0x000028, "Member 'ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData::__EnumProperty_27' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData, __EnumProperty_28) == 0x000029, "Member 'ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData::__EnumProperty_28' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData, __ArrayProperty_29) == 0x000030, "Member 'ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData::__ArrayProperty_29' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData, __StructProperty_30) == 0x000040, "Member 'ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData::__StructProperty_30' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData, __BoolProperty_31) == 0x000060, "Member 'ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData::__BoolProperty_31' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData, __FloatProperty_32) == 0x000064, "Member 'ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData::__FloatProperty_32' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData, __StructProperty_33) == 0x000068, "Member 'ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData::__StructProperty_33' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData, __FloatProperty_34) == 0x000094, "Member 'ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData::__FloatProperty_34' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData, __BoolProperty_35) == 0x000098, "Member 'ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData::__BoolProperty_35' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData, __EnumProperty_36) == 0x000099, "Member 'ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData::__EnumProperty_36' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData, __ByteProperty_37) == 0x00009A, "Member 'ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData::__ByteProperty_37' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData, __NameProperty_38) == 0x00009C, "Member 'ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData::__NameProperty_38' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000A8, "Member 'ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000128, "Member 'ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000140, "Member 'ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000170, "Member 'ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x0001A0, "Member 'ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x0001D0, "Member 'ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");

// ScriptStruct ABP_PterodactylusSwarm_Flap.ABP_PterodactylusSwarm_Flap_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_PterodactylusSwarm_Flap::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

}

