#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CatFish

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ABP_CatFish_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_CatFish.ABP_CatFish_C
// 0x0470 (0x07E0 - 0x0370)
class UABP_CatFish_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_CatFish::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                  // 0x0378(0x000C)(HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0388(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0390(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0398(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x03B8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0400(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0448(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0490(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x04D8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x04F8(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x05C0(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x06B0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x06F8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0778(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x07A0(0x0028)()
	bool                                          bIsMoving;                                         // 0x07C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDead;                                           // 0x07C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7CA[0x6];                                      // 0x07CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MoveSpeed;                                         // 0x07D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATIFishBase*                            FishBaseRef;                                       // 0x07D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_CatFish(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_CatFish_C">();
	}
	static class UABP_CatFish_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_CatFish_C>();
	}
};
static_assert(alignof(UABP_CatFish_C) == 0x000010, "Wrong alignment on UABP_CatFish_C");
static_assert(sizeof(UABP_CatFish_C) == 0x0007E0, "Wrong size on UABP_CatFish_C");
static_assert(offsetof(UABP_CatFish_C, UberGraphFrame) == 0x000370, "Member 'UABP_CatFish_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_CatFish_C, __AnimBlueprintMutables) == 0x000378, "Member 'UABP_CatFish_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_CatFish_C, AnimBlueprintExtension_PropertyAccess) == 0x000388, "Member 'UABP_CatFish_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_CatFish_C, AnimBlueprintExtension_Base) == 0x000390, "Member 'UABP_CatFish_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_CatFish_C, AnimGraphNode_Root) == 0x000398, "Member 'UABP_CatFish_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_CatFish_C, AnimGraphNode_SequencePlayer_1) == 0x0003B8, "Member 'UABP_CatFish_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_CatFish_C, AnimGraphNode_BlendListByBool_1) == 0x000400, "Member 'UABP_CatFish_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_CatFish_C, AnimGraphNode_SequencePlayer) == 0x000448, "Member 'UABP_CatFish_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_CatFish_C, AnimGraphNode_BlendListByBool) == 0x000490, "Member 'UABP_CatFish_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_CatFish_C, AnimGraphNode_StateResult) == 0x0004D8, "Member 'UABP_CatFish_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_CatFish_C, AnimGraphNode_StateMachine) == 0x0004F8, "Member 'UABP_CatFish_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_CatFish_C, AnimGraphNode_LayeredBoneBlend) == 0x0005C0, "Member 'UABP_CatFish_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_CatFish_C, AnimGraphNode_Slot) == 0x0006B0, "Member 'UABP_CatFish_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_CatFish_C, AnimGraphNode_SaveCachedPose) == 0x0006F8, "Member 'UABP_CatFish_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_CatFish_C, AnimGraphNode_UseCachedPose_1) == 0x000778, "Member 'UABP_CatFish_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_CatFish_C, AnimGraphNode_UseCachedPose) == 0x0007A0, "Member 'UABP_CatFish_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_CatFish_C, bIsMoving) == 0x0007C8, "Member 'UABP_CatFish_C::bIsMoving' has a wrong offset!");
static_assert(offsetof(UABP_CatFish_C, bIsDead) == 0x0007C9, "Member 'UABP_CatFish_C::bIsDead' has a wrong offset!");
static_assert(offsetof(UABP_CatFish_C, MoveSpeed) == 0x0007D0, "Member 'UABP_CatFish_C::MoveSpeed' has a wrong offset!");
static_assert(offsetof(UABP_CatFish_C, FishBaseRef) == 0x0007D8, "Member 'UABP_CatFish_C::FishBaseRef' has a wrong offset!");

}

