#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_HallucinationChar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ABP_HallucinationChar_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_HallucinationChar.ABP_HallucinationChar_C
// 0x0630 (0x09A0 - 0x0370)
class UABP_HallucinationChar_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_HallucinationChar::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;        // 0x0378(0x0014)(HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0390(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0398(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03A0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x03C0(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x03E8(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0458(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0478(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x04C0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x04E0(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x05A8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x05F0(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x0638(0x0118)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0750(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0798(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0818(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0840(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0868(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x08E8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0910(0x0048)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x0958(0x0010)()
	class ABP_HallucinationChar_C*                As_BP_Hallucination_Char;                          // 0x0968(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Speed;                                             // 0x0970(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            Look_Poses;                                        // 0x0978(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        YawThreshold;                                      // 0x0980(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LookYaw;                                           // 0x0988(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LookPitch;                                         // 0x098C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HeadtrackingAlpha;                                 // 0x0990(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasAuthority;                                     // 0x0994(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HallucinationChar_AnimGraphNode_BlendListByBool_0089283A4C4BB7D46EE006B28E186BF8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HallucinationChar_AnimGraphNode_TransitionResult_D205117F4F20C7A5B0626F9CD767581C();
	void ExecuteUbergraph_ABP_HallucinationChar(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_HallucinationChar_C">();
	}
	static class UABP_HallucinationChar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_HallucinationChar_C>();
	}
};
static_assert(alignof(UABP_HallucinationChar_C) == 0x000010, "Wrong alignment on UABP_HallucinationChar_C");
static_assert(sizeof(UABP_HallucinationChar_C) == 0x0009A0, "Wrong size on UABP_HallucinationChar_C");
static_assert(offsetof(UABP_HallucinationChar_C, UberGraphFrame) == 0x000370, "Member 'UABP_HallucinationChar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, __AnimBlueprintMutables) == 0x000378, "Member 'UABP_HallucinationChar_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, AnimBlueprintExtension_PropertyAccess) == 0x000390, "Member 'UABP_HallucinationChar_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, AnimBlueprintExtension_Base) == 0x000398, "Member 'UABP_HallucinationChar_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, AnimGraphNode_Root) == 0x0003A0, "Member 'UABP_HallucinationChar_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, AnimGraphNode_TransitionResult) == 0x0003C0, "Member 'UABP_HallucinationChar_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, AnimGraphNode_BlendSpacePlayer) == 0x0003E8, "Member 'UABP_HallucinationChar_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, AnimGraphNode_StateResult_1) == 0x000458, "Member 'UABP_HallucinationChar_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, AnimGraphNode_SequencePlayer) == 0x000478, "Member 'UABP_HallucinationChar_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, AnimGraphNode_StateResult) == 0x0004C0, "Member 'UABP_HallucinationChar_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, AnimGraphNode_StateMachine) == 0x0004E0, "Member 'UABP_HallucinationChar_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, AnimGraphNode_Slot_1) == 0x0005A8, "Member 'UABP_HallucinationChar_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, AnimGraphNode_Slot) == 0x0005F0, "Member 'UABP_HallucinationChar_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x000638, "Member 'UABP_HallucinationChar_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, AnimGraphNode_BlendListByBool_1) == 0x000750, "Member 'UABP_HallucinationChar_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, AnimGraphNode_SaveCachedPose_1) == 0x000798, "Member 'UABP_HallucinationChar_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, AnimGraphNode_UseCachedPose_2) == 0x000818, "Member 'UABP_HallucinationChar_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, AnimGraphNode_UseCachedPose_1) == 0x000840, "Member 'UABP_HallucinationChar_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, AnimGraphNode_SaveCachedPose) == 0x000868, "Member 'UABP_HallucinationChar_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, AnimGraphNode_UseCachedPose) == 0x0008E8, "Member 'UABP_HallucinationChar_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, AnimGraphNode_BlendListByBool) == 0x000910, "Member 'UABP_HallucinationChar_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, AnimGraphNode_LocalRefPose) == 0x000958, "Member 'UABP_HallucinationChar_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, As_BP_Hallucination_Char) == 0x000968, "Member 'UABP_HallucinationChar_C::As_BP_Hallucination_Char' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, Speed) == 0x000970, "Member 'UABP_HallucinationChar_C::Speed' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, Look_Poses) == 0x000978, "Member 'UABP_HallucinationChar_C::Look_Poses' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, YawThreshold) == 0x000980, "Member 'UABP_HallucinationChar_C::YawThreshold' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, LookYaw) == 0x000988, "Member 'UABP_HallucinationChar_C::LookYaw' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, LookPitch) == 0x00098C, "Member 'UABP_HallucinationChar_C::LookPitch' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, HeadtrackingAlpha) == 0x000990, "Member 'UABP_HallucinationChar_C::HeadtrackingAlpha' has a wrong offset!");
static_assert(offsetof(UABP_HallucinationChar_C, bHasAuthority) == 0x000994, "Member 'UABP_HallucinationChar_C::bHasAuthority' has a wrong offset!");

}

