#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CatFish

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_CatFish.ABP_CatFish_C.AnimBlueprintGeneratedConstantData
// 0x0387 (0x0388 - 0x0001)
struct ABP_CatFish::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_57;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_58;                                 // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_59;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_60;                               // 0x0014(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_61;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_62;                                 // 0x0044(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_63;                                 // 0x0045(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_64;                                 // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_65;                                 // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_66;                                   // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_67;                                 // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_68;                                 // 0x0061(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_69;                                 // 0x0062(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_70;                                // 0x0068(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_71;                                 // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_72;                                 // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_73;                                  // 0x0088(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_74;                               // 0x0090(0x0020)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00B0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0130(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0148(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer_1;               // 0x0178(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;              // 0x01A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x01D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                // 0x0208(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                    // 0x0238(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                   // 0x0268(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LayeredBoneBlend;               // 0x0298(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x02C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                 // 0x02F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;                // 0x0328(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                  // 0x0358(0x0030)()
};
static_assert(alignof(ABP_CatFish::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_CatFish::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_CatFish::FAnimBlueprintGeneratedConstantData) == 0x000388, "Wrong size on ABP_CatFish::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, __NameProperty_57) == 0x000004, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::__NameProperty_57' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, __BoolProperty_58) == 0x00000C, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::__BoolProperty_58' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, __FloatProperty_59) == 0x000010, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::__FloatProperty_59' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, __StructProperty_60) == 0x000014, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::__StructProperty_60' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, __FloatProperty_61) == 0x000040, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::__FloatProperty_61' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, __EnumProperty_62) == 0x000044, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::__EnumProperty_62' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, __ByteProperty_63) == 0x000045, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::__ByteProperty_63' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, __NameProperty_64) == 0x000048, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::__NameProperty_64' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, __BlendProfile_65) == 0x000050, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::__BlendProfile_65' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, __CurveFloat_66) == 0x000058, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::__CurveFloat_66' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, __BoolProperty_67) == 0x000060, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::__BoolProperty_67' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, __EnumProperty_68) == 0x000061, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::__EnumProperty_68' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, __EnumProperty_69) == 0x000062, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::__EnumProperty_69' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, __ArrayProperty_70) == 0x000068, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::__ArrayProperty_70' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, __NameProperty_71) == 0x000078, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::__NameProperty_71' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, __NameProperty_72) == 0x000080, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::__NameProperty_72' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, __IntProperty_73) == 0x000088, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::__IntProperty_73' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, __StructProperty_74) == 0x000090, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::__StructProperty_74' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000B0, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000130, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000148, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer_1) == 0x000178, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_1) == 0x0001A8, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x0001D8, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x000208, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000238, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000268, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LayeredBoneBlend) == 0x000298, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x0002C8, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose) == 0x0002F8, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_1) == 0x000328, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose) == 0x000358, "Member 'ABP_CatFish::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose' has a wrong offset!");

// ScriptStruct ABP_CatFish.ABP_CatFish_C.AnimBlueprintGeneratedMutableData
// 0x000B (0x000C - 0x0001)
struct ABP_CatFish::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_0;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_CatFish::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_CatFish::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_CatFish::FAnimBlueprintGeneratedMutableData) == 0x00000C, "Wrong size on ABP_CatFish::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'ABP_CatFish::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000004, "Member 'ABP_CatFish::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(ABP_CatFish::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x000008, "Member 'ABP_CatFish::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");

}

