#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_HallucinationChar

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABP_HallucinationChar.ABP_HallucinationChar_C.AnimBlueprintGeneratedConstantData
// 0x04D7 (0x04D8 - 0x0001)
struct ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_86;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_87;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_88;                                  // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_89;                               // 0x0018(0x002C)(BlueprintVisible, NoDestructor)
	EAnimSyncMethod                               __EnumProperty_90;                                 // 0x0044(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_91;                                 // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_92;                                 // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_93;                                 // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_94;                                  // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_95;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_96;                                 // 0x0068(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_97;                                // 0x006C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_98;                                 // 0x0070(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_99;                                 // 0x0074(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_100;                               // 0x0080(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_101;                                // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_102;                                  // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_103;                                // 0x00A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_104;                                // 0x00A1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_105;                                // 0x00A2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_106;                               // 0x00A8(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_107;                              // 0x00B8(0x0020)(BlueprintVisible, NoDestructor)
	ERefPoseType                                  __ByteProperty_108;                                // 0x00D8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00E0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0160(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0178(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_TransitionResult;               // 0x01A8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendSpacePlayer;               // 0x01D8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult_1;                  // 0x0208(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SequencePlayer;                 // 0x0238(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateResult;                    // 0x0268(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_StateMachine;                   // 0x0298(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot_1;                         // 0x02C8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Slot;                           // 0x02F8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_RotationOffsetBlendSpace;       // 0x0328(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool_1;              // 0x0358(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;               // 0x0388(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_2;                // 0x03B8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose_1;                // 0x03E8(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                 // 0x0418(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                  // 0x0448(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_BlendListByBool;                // 0x0478(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalRefPose;                   // 0x04A8(0x0030)()
};
static_assert(alignof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData) == 0x0004D8, "Wrong size on ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, __NameProperty_86) == 0x000004, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::__NameProperty_86' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, __NameProperty_87) == 0x00000C, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::__NameProperty_87' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, __IntProperty_88) == 0x000014, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::__IntProperty_88' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, __StructProperty_89) == 0x000018, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::__StructProperty_89' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, __EnumProperty_90) == 0x000044, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::__EnumProperty_90' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, __NameProperty_91) == 0x000048, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::__NameProperty_91' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, __NameProperty_92) == 0x000050, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::__NameProperty_92' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, __NameProperty_93) == 0x000058, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::__NameProperty_93' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, __IntProperty_94) == 0x000060, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::__IntProperty_94' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, __FloatProperty_95) == 0x000064, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::__FloatProperty_95' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, __BoolProperty_96) == 0x000068, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::__BoolProperty_96' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, __FloatProperty_97) == 0x00006C, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::__FloatProperty_97' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, __EnumProperty_98) == 0x000070, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::__EnumProperty_98' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, __NameProperty_99) == 0x000074, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::__NameProperty_99' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, __ArrayProperty_100) == 0x000080, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::__ArrayProperty_100' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, __BlendProfile_101) == 0x000090, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::__BlendProfile_101' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, __CurveFloat_102) == 0x000098, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::__CurveFloat_102' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, __BoolProperty_103) == 0x0000A0, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::__BoolProperty_103' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, __EnumProperty_104) == 0x0000A1, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::__EnumProperty_104' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, __EnumProperty_105) == 0x0000A2, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::__EnumProperty_105' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, __ArrayProperty_106) == 0x0000A8, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::__ArrayProperty_106' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, __StructProperty_107) == 0x0000B8, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::__StructProperty_107' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, __ByteProperty_108) == 0x0000D8, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::__ByteProperty_108' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000E0, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000160, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Root) == 0x000178, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, AnimGraphNode_TransitionResult) == 0x0001A8, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendSpacePlayer) == 0x0001D8, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult_1) == 0x000208, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SequencePlayer) == 0x000238, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateResult) == 0x000268, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, AnimGraphNode_StateMachine) == 0x000298, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot_1) == 0x0002C8, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, AnimGraphNode_Slot) == 0x0002F8, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, AnimGraphNode_RotationOffsetBlendSpace) == 0x000328, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool_1) == 0x000358, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose_1) == 0x000388, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_2) == 0x0003B8, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose_1) == 0x0003E8, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, AnimGraphNode_SaveCachedPose) == 0x000418, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, AnimGraphNode_UseCachedPose) == 0x000448, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, AnimGraphNode_BlendListByBool) == 0x000478, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData, AnimGraphNode_LocalRefPose) == 0x0004A8, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedConstantData::AnimGraphNode_LocalRefPose' has a wrong offset!");

// ScriptStruct ABP_HallucinationChar.ABP_HallucinationChar_C.AnimBlueprintGeneratedMutableData
// 0x0013 (0x0014 - 0x0001)
struct ABP_HallucinationChar::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_1;                                 // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_3;                                  // 0x0011(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_HallucinationChar::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on ABP_HallucinationChar::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ABP_HallucinationChar::FAnimBlueprintGeneratedMutableData) == 0x000014, "Wrong size on ABP_HallucinationChar::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedMutableData, __FloatProperty_1) == 0x00000C, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedMutableData::__FloatProperty_1' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x000010, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar::FAnimBlueprintGeneratedMutableData, __BoolProperty_3) == 0x000011, "Member 'ABP_HallucinationChar::FAnimBlueprintGeneratedMutableData::__BoolProperty_3' has a wrong offset!");

}

