#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PterodactylusSwarm_Flap

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_PterodactylusSwarm_Flap.ABP_PterodactylusSwarm_Flap_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_PterodactylusSwarm_Flap_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_PterodactylusSwarm_Flap_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_PterodactylusSwarm_Flap_C_AnimGraph");
static_assert(sizeof(ABP_PterodactylusSwarm_Flap_C_AnimGraph) == 0x000010, "Wrong size on ABP_PterodactylusSwarm_Flap_C_AnimGraph");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_PterodactylusSwarm_Flap_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_PterodactylusSwarm_Flap.ABP_PterodactylusSwarm_Flap_C.ExecuteUbergraph_ABP_PterodactylusSwarm_Flap
// 0x0038 (0x0038 - 0x0000)
struct ABP_PterodactylusSwarm_Flap_C_ExecuteUbergraph_ABP_PterodactylusSwarm_Flap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBoolWithWeight_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_PterodactylusSwarm_Flap_C_ExecuteUbergraph_ABP_PterodactylusSwarm_Flap) == 0x000008, "Wrong alignment on ABP_PterodactylusSwarm_Flap_C_ExecuteUbergraph_ABP_PterodactylusSwarm_Flap");
static_assert(sizeof(ABP_PterodactylusSwarm_Flap_C_ExecuteUbergraph_ABP_PterodactylusSwarm_Flap) == 0x000038, "Wrong size on ABP_PterodactylusSwarm_Flap_C_ExecuteUbergraph_ABP_PterodactylusSwarm_Flap");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap_C_ExecuteUbergraph_ABP_PterodactylusSwarm_Flap, EntryPoint) == 0x000000, "Member 'ABP_PterodactylusSwarm_Flap_C_ExecuteUbergraph_ABP_PterodactylusSwarm_Flap::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap_C_ExecuteUbergraph_ABP_PterodactylusSwarm_Flap, CallFunc_RandomBoolWithWeight_ReturnValue) == 0x000004, "Member 'ABP_PterodactylusSwarm_Flap_C_ExecuteUbergraph_ABP_PterodactylusSwarm_Flap::CallFunc_RandomBoolWithWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap_C_ExecuteUbergraph_ABP_PterodactylusSwarm_Flap, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'ABP_PterodactylusSwarm_Flap_C_ExecuteUbergraph_ABP_PterodactylusSwarm_Flap::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap_C_ExecuteUbergraph_ABP_PterodactylusSwarm_Flap, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000010, "Member 'ABP_PterodactylusSwarm_Flap_C_ExecuteUbergraph_ABP_PterodactylusSwarm_Flap::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap_C_ExecuteUbergraph_ABP_PterodactylusSwarm_Flap, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'ABP_PterodactylusSwarm_Flap_C_ExecuteUbergraph_ABP_PterodactylusSwarm_Flap::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap_C_ExecuteUbergraph_ABP_PterodactylusSwarm_Flap, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'ABP_PterodactylusSwarm_Flap_C_ExecuteUbergraph_ABP_PterodactylusSwarm_Flap::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap_C_ExecuteUbergraph_ABP_PterodactylusSwarm_Flap, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000030, "Member 'ABP_PterodactylusSwarm_Flap_C_ExecuteUbergraph_ABP_PterodactylusSwarm_Flap::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(ABP_PterodactylusSwarm_Flap_C_ExecuteUbergraph_ABP_PterodactylusSwarm_Flap, CallFunc_Delay_Duration_ImplicitCast) == 0x000034, "Member 'ABP_PterodactylusSwarm_Flap_C_ExecuteUbergraph_ABP_PterodactylusSwarm_Flap::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

}

