#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_Bodycam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ST_WatermarkSetting_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass AC_Bodycam.AC_Bodycam_C
// 0x08C0 (0x0960 - 0x00A0)
class UAC_Bodycam_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          BodyCamComponentEnabled_;                          // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CustomizationWidgetEnabled_;                       // 0x00A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_VHS_Effect_;                                   // 0x00AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_VHS_overlay_;                                  // 0x00AB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Has_Bodycam_Frame_;                                // 0x00AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Has_Flashlight_;                                   // 0x00AD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FlashlightIntensity;                               // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightAffectDistance;                               // 0x00B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         New_Inner_Cone_Angle;                              // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         New_Outer_Cone_Angle;                              // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ScreenBlurEnabled_;                                // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_Zoom_;                                         // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Has_Lens_Dirt_;                                    // 0x00C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3[0x1];                                       // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CameraFieldOfView;                                 // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     PostProcessToAdd;                                  // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      ConstantBodycamPostProcessEffect;                  // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        WalkSpeed;                                         // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RunSpeed;                                          // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PawnVelocity;                                      // 0x00E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableLandingShake_;                               // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCameraShakeBase>           IdleShake;                                         // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCameraShakeBase>           WalkShake;                                         // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCameraShakeBase>           RunShake;                                          // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UCameraShakeBase>           LandShake;                                         // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BodycamPostProcessEffect;                          // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Vignette_Intensity;                                // 0x0130(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MotionBlurAmount;                                  // 0x0134(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Chromatic_Aberration;                              // 0x0138(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Film_Grain_Intensity;                              // 0x013C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BloomIntensity;                                    // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         LensFlares;                                        // 0x0144(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Customization_C*                   WBP_Customization;                                 // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       CameraComponent;                                   // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      ConstantVHSeffect;                                 // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               VHSeffectRef;                                      // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Falling_;                                          // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        AttachSpringArmTo;                                 // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   Run_Key;                                           // 0x0178(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	struct FKey                                   Flashlight_Key;                                    // 0x0190(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArmComponent;                                // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             FlashlightSound;                                   // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          FlashlightOpened;                                  // 0x01B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USpotLightComponent*                    SpotLightComponent;                                // 0x01C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Real_Time_;                                    // 0x01C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Has_Timer_;                                        // 0x01C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Afternoon___Custom_Time_;                          // 0x01CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_1CB[0x5];                                      // 0x01CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_VHSoverlay_C*                      VHS_Overlay_Widget;                                // 0x01D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Dirt_Mask_Texture;                                 // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         Dirt_Mask_Intensity;                               // 0x01E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Zoom_Key;                                          // 0x01E8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        ZoomControlFloat;                                  // 0x0200(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentFOV;                                        // 0x0208(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ZoomFOV;                                           // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         FlashlightRotationSpeed;                           // 0x0218(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   PreviousPostProcess;                               // 0x0220(0x06F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         PreviousFieldOfView;                               // 0x0910(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableCameraSway;                                 // 0x0914(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_915[0x3];                                      // 0x0915(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UChildActorComponent*                   NewCameraFrame;                                    // 0x0918(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FST_WatermarkSetting                   Corner_Watermark_Struct;                           // 0x0920(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_WatermarkSetting                   Fullscreen_Watermark_Struct;                       // 0x0938(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              DateTimeSet;                                       // 0x0950(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Two4Hr;                                            // 0x0958(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CloseCustomization();
	void CustomInitBodycam();
	void DeactivatePO();
	void Dlete();
	void Dlte2();
	void Dothing();
	void ExecuteUbergraph_AC_Bodycam(int32 EntryPoint);
	void InitializeBodycamComponent(class UCameraComponent* CameraComponent_0, class USceneComponent* AttachSpringArmTo_0);
	void InpActEvt_F1_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void OpenCustomization();
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void show();
	void UpdatePostProcessSettings(class UCameraComponent* Target, float Chromatic_Aberration_0, float Lens_Flares, float Vignette_Intensity_0, float Film_Grain_Intensity_0, float MotionBlur, float BloomIntensity_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AC_Bodycam_C">();
	}
	static class UAC_Bodycam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAC_Bodycam_C>();
	}
};
static_assert(alignof(UAC_Bodycam_C) == 0x000010, "Wrong alignment on UAC_Bodycam_C");
static_assert(sizeof(UAC_Bodycam_C) == 0x000960, "Wrong size on UAC_Bodycam_C");
static_assert(offsetof(UAC_Bodycam_C, UberGraphFrame) == 0x0000A0, "Member 'UAC_Bodycam_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, BodyCamComponentEnabled_) == 0x0000A8, "Member 'UAC_Bodycam_C::BodyCamComponentEnabled_' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, CustomizationWidgetEnabled_) == 0x0000A9, "Member 'UAC_Bodycam_C::CustomizationWidgetEnabled_' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, Has_VHS_Effect_) == 0x0000AA, "Member 'UAC_Bodycam_C::Has_VHS_Effect_' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, Has_VHS_overlay_) == 0x0000AB, "Member 'UAC_Bodycam_C::Has_VHS_overlay_' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, Has_Bodycam_Frame_) == 0x0000AC, "Member 'UAC_Bodycam_C::Has_Bodycam_Frame_' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, Has_Flashlight_) == 0x0000AD, "Member 'UAC_Bodycam_C::Has_Flashlight_' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, FlashlightIntensity) == 0x0000B0, "Member 'UAC_Bodycam_C::FlashlightIntensity' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, LightAffectDistance) == 0x0000B4, "Member 'UAC_Bodycam_C::LightAffectDistance' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, New_Inner_Cone_Angle) == 0x0000B8, "Member 'UAC_Bodycam_C::New_Inner_Cone_Angle' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, New_Outer_Cone_Angle) == 0x0000BC, "Member 'UAC_Bodycam_C::New_Outer_Cone_Angle' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, ScreenBlurEnabled_) == 0x0000C0, "Member 'UAC_Bodycam_C::ScreenBlurEnabled_' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, Has_Zoom_) == 0x0000C1, "Member 'UAC_Bodycam_C::Has_Zoom_' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, Has_Lens_Dirt_) == 0x0000C2, "Member 'UAC_Bodycam_C::Has_Lens_Dirt_' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, CameraFieldOfView) == 0x0000C4, "Member 'UAC_Bodycam_C::CameraFieldOfView' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, PostProcessToAdd) == 0x0000C8, "Member 'UAC_Bodycam_C::PostProcessToAdd' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, ConstantBodycamPostProcessEffect) == 0x0000D0, "Member 'UAC_Bodycam_C::ConstantBodycamPostProcessEffect' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, WalkSpeed) == 0x0000D8, "Member 'UAC_Bodycam_C::WalkSpeed' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, RunSpeed) == 0x0000E0, "Member 'UAC_Bodycam_C::RunSpeed' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, PawnVelocity) == 0x0000E8, "Member 'UAC_Bodycam_C::PawnVelocity' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, EnableLandingShake_) == 0x000100, "Member 'UAC_Bodycam_C::EnableLandingShake_' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, IdleShake) == 0x000108, "Member 'UAC_Bodycam_C::IdleShake' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, WalkShake) == 0x000110, "Member 'UAC_Bodycam_C::WalkShake' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, RunShake) == 0x000118, "Member 'UAC_Bodycam_C::RunShake' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, LandShake) == 0x000120, "Member 'UAC_Bodycam_C::LandShake' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, BodycamPostProcessEffect) == 0x000128, "Member 'UAC_Bodycam_C::BodycamPostProcessEffect' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, Vignette_Intensity) == 0x000130, "Member 'UAC_Bodycam_C::Vignette_Intensity' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, MotionBlurAmount) == 0x000134, "Member 'UAC_Bodycam_C::MotionBlurAmount' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, Chromatic_Aberration) == 0x000138, "Member 'UAC_Bodycam_C::Chromatic_Aberration' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, Film_Grain_Intensity) == 0x00013C, "Member 'UAC_Bodycam_C::Film_Grain_Intensity' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, BloomIntensity) == 0x000140, "Member 'UAC_Bodycam_C::BloomIntensity' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, LensFlares) == 0x000144, "Member 'UAC_Bodycam_C::LensFlares' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, WBP_Customization) == 0x000148, "Member 'UAC_Bodycam_C::WBP_Customization' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, CameraComponent) == 0x000150, "Member 'UAC_Bodycam_C::CameraComponent' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, ConstantVHSeffect) == 0x000158, "Member 'UAC_Bodycam_C::ConstantVHSeffect' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, VHSeffectRef) == 0x000160, "Member 'UAC_Bodycam_C::VHSeffectRef' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, Falling_) == 0x000168, "Member 'UAC_Bodycam_C::Falling_' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, AttachSpringArmTo) == 0x000170, "Member 'UAC_Bodycam_C::AttachSpringArmTo' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, Run_Key) == 0x000178, "Member 'UAC_Bodycam_C::Run_Key' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, Flashlight_Key) == 0x000190, "Member 'UAC_Bodycam_C::Flashlight_Key' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, SpringArmComponent) == 0x0001A8, "Member 'UAC_Bodycam_C::SpringArmComponent' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, FlashlightSound) == 0x0001B0, "Member 'UAC_Bodycam_C::FlashlightSound' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, FlashlightOpened) == 0x0001B8, "Member 'UAC_Bodycam_C::FlashlightOpened' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, SpotLightComponent) == 0x0001C0, "Member 'UAC_Bodycam_C::SpotLightComponent' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, Use_Real_Time_) == 0x0001C8, "Member 'UAC_Bodycam_C::Use_Real_Time_' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, Has_Timer_) == 0x0001C9, "Member 'UAC_Bodycam_C::Has_Timer_' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, Afternoon___Custom_Time_) == 0x0001CA, "Member 'UAC_Bodycam_C::Afternoon___Custom_Time_' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, VHS_Overlay_Widget) == 0x0001D0, "Member 'UAC_Bodycam_C::VHS_Overlay_Widget' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, Dirt_Mask_Texture) == 0x0001D8, "Member 'UAC_Bodycam_C::Dirt_Mask_Texture' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, Dirt_Mask_Intensity) == 0x0001E0, "Member 'UAC_Bodycam_C::Dirt_Mask_Intensity' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, Zoom_Key) == 0x0001E8, "Member 'UAC_Bodycam_C::Zoom_Key' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, ZoomControlFloat) == 0x000200, "Member 'UAC_Bodycam_C::ZoomControlFloat' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, CurrentFOV) == 0x000208, "Member 'UAC_Bodycam_C::CurrentFOV' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, ZoomFOV) == 0x000210, "Member 'UAC_Bodycam_C::ZoomFOV' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, FlashlightRotationSpeed) == 0x000218, "Member 'UAC_Bodycam_C::FlashlightRotationSpeed' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, PreviousPostProcess) == 0x000220, "Member 'UAC_Bodycam_C::PreviousPostProcess' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, PreviousFieldOfView) == 0x000910, "Member 'UAC_Bodycam_C::PreviousFieldOfView' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, bEnableCameraSway) == 0x000914, "Member 'UAC_Bodycam_C::bEnableCameraSway' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, NewCameraFrame) == 0x000918, "Member 'UAC_Bodycam_C::NewCameraFrame' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, Corner_Watermark_Struct) == 0x000920, "Member 'UAC_Bodycam_C::Corner_Watermark_Struct' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, Fullscreen_Watermark_Struct) == 0x000938, "Member 'UAC_Bodycam_C::Fullscreen_Watermark_Struct' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, DateTimeSet) == 0x000950, "Member 'UAC_Bodycam_C::DateTimeSet' has a wrong offset!");
static_assert(offsetof(UAC_Bodycam_C, Two4Hr) == 0x000958, "Member 'UAC_Bodycam_C::Two4Hr' has a wrong offset!");

}

