#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AquaticBuoyancy

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_AquaticBuoyancy.BP_AquaticBuoyancy_C.ExecuteUbergraph_BP_AquaticBuoyancy
// 0x0010 (0x0010 - 0x0000)
struct BP_AquaticBuoyancy_C_ExecuteUbergraph_BP_AquaticBuoyancy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateInFluid_DeltaTime_ImplicitCast;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticBuoyancy_C_ExecuteUbergraph_BP_AquaticBuoyancy) == 0x000008, "Wrong alignment on BP_AquaticBuoyancy_C_ExecuteUbergraph_BP_AquaticBuoyancy");
static_assert(sizeof(BP_AquaticBuoyancy_C_ExecuteUbergraph_BP_AquaticBuoyancy) == 0x000010, "Wrong size on BP_AquaticBuoyancy_C_ExecuteUbergraph_BP_AquaticBuoyancy");
static_assert(offsetof(BP_AquaticBuoyancy_C_ExecuteUbergraph_BP_AquaticBuoyancy, EntryPoint) == 0x000000, "Member 'BP_AquaticBuoyancy_C_ExecuteUbergraph_BP_AquaticBuoyancy::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_ExecuteUbergraph_BP_AquaticBuoyancy, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_AquaticBuoyancy_C_ExecuteUbergraph_BP_AquaticBuoyancy::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_ExecuteUbergraph_BP_AquaticBuoyancy, CallFunc_UpdateInFluid_DeltaTime_ImplicitCast) == 0x000008, "Member 'BP_AquaticBuoyancy_C_ExecuteUbergraph_BP_AquaticBuoyancy::CallFunc_UpdateInFluid_DeltaTime_ImplicitCast' has a wrong offset!");

// Function BP_AquaticBuoyancy.BP_AquaticBuoyancy_C.GetSurfceDistance
// 0x0080 (0x0080 - 0x0000)
struct BP_AquaticBuoyancy_C_GetSurfceDistance final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Distance;                                          // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_1;                          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticBuoyancy_C_GetSurfceDistance) == 0x000008, "Wrong alignment on BP_AquaticBuoyancy_C_GetSurfceDistance");
static_assert(sizeof(BP_AquaticBuoyancy_C_GetSurfceDistance) == 0x000080, "Wrong size on BP_AquaticBuoyancy_C_GetSurfceDistance");
static_assert(offsetof(BP_AquaticBuoyancy_C_GetSurfceDistance, Location) == 0x000000, "Member 'BP_AquaticBuoyancy_C_GetSurfceDistance::Location' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_GetSurfceDistance, Distance) == 0x000018, "Member 'BP_AquaticBuoyancy_C_GetSurfceDistance::Distance' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_GetSurfceDistance, CallFunc_BreakVector_X) == 0x000020, "Member 'BP_AquaticBuoyancy_C_GetSurfceDistance::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_GetSurfceDistance, CallFunc_BreakVector_Y) == 0x000028, "Member 'BP_AquaticBuoyancy_C_GetSurfceDistance::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_GetSurfceDistance, CallFunc_BreakVector_Z) == 0x000030, "Member 'BP_AquaticBuoyancy_C_GetSurfceDistance::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_GetSurfceDistance, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'BP_AquaticBuoyancy_C_GetSurfceDistance::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_GetSurfceDistance, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_AquaticBuoyancy_C_GetSurfceDistance::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_GetSurfceDistance, CallFunc_BreakVector_X_1) == 0x000058, "Member 'BP_AquaticBuoyancy_C_GetSurfceDistance::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_GetSurfceDistance, CallFunc_BreakVector_Y_1) == 0x000060, "Member 'BP_AquaticBuoyancy_C_GetSurfceDistance::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_GetSurfceDistance, CallFunc_BreakVector_Z_1) == 0x000068, "Member 'BP_AquaticBuoyancy_C_GetSurfceDistance::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_GetSurfceDistance, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000070, "Member 'BP_AquaticBuoyancy_C_GetSurfceDistance::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_GetSurfceDistance, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000078, "Member 'BP_AquaticBuoyancy_C_GetSurfceDistance::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BP_AquaticBuoyancy.BP_AquaticBuoyancy_C.IsEnabled
// 0x0003 (0x0003 - 0x0000)
struct BP_AquaticBuoyancy_C_IsEnabled final
{
public:
	bool                                          IsEnabled_0;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticBuoyancy_C_IsEnabled) == 0x000001, "Wrong alignment on BP_AquaticBuoyancy_C_IsEnabled");
static_assert(sizeof(BP_AquaticBuoyancy_C_IsEnabled) == 0x000003, "Wrong size on BP_AquaticBuoyancy_C_IsEnabled");
static_assert(offsetof(BP_AquaticBuoyancy_C_IsEnabled, IsEnabled_0) == 0x000000, "Member 'BP_AquaticBuoyancy_C_IsEnabled::IsEnabled_0' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_IsEnabled, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000001, "Member 'BP_AquaticBuoyancy_C_IsEnabled::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_IsEnabled, CallFunc_BooleanAND_ReturnValue) == 0x000002, "Member 'BP_AquaticBuoyancy_C_IsEnabled::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_AquaticBuoyancy.BP_AquaticBuoyancy_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AquaticBuoyancy_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticBuoyancy_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_AquaticBuoyancy_C_ReceiveTick");
static_assert(sizeof(BP_AquaticBuoyancy_C_ReceiveTick) == 0x000004, "Wrong size on BP_AquaticBuoyancy_C_ReceiveTick");
static_assert(offsetof(BP_AquaticBuoyancy_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_AquaticBuoyancy_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_AquaticBuoyancy.BP_AquaticBuoyancy_C.SetAquaticVolume
// 0x0028 (0x0028 - 0x0000)
struct BP_AquaticBuoyancy_C_SetAquaticVolume final
{
public:
	class ABP_AquaticSurface_C*                   AquaticSurface;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCharacterMovementComponent*            CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticBuoyancy_C_SetAquaticVolume) == 0x000008, "Wrong alignment on BP_AquaticBuoyancy_C_SetAquaticVolume");
static_assert(sizeof(BP_AquaticBuoyancy_C_SetAquaticVolume) == 0x000028, "Wrong size on BP_AquaticBuoyancy_C_SetAquaticVolume");
static_assert(offsetof(BP_AquaticBuoyancy_C_SetAquaticVolume, AquaticSurface) == 0x000000, "Member 'BP_AquaticBuoyancy_C_SetAquaticVolume::AquaticSurface' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_SetAquaticVolume, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_AquaticBuoyancy_C_SetAquaticVolume::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_SetAquaticVolume, CallFunc_IsValid_ReturnValue_1) == 0x000009, "Member 'BP_AquaticBuoyancy_C_SetAquaticVolume::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_SetAquaticVolume, CallFunc_GetOwner_ReturnValue) == 0x000010, "Member 'BP_AquaticBuoyancy_C_SetAquaticVolume::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_SetAquaticVolume, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'BP_AquaticBuoyancy_C_SetAquaticVolume::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_SetAquaticVolume, CallFunc_IsValid_ReturnValue_2) == 0x000020, "Member 'BP_AquaticBuoyancy_C_SetAquaticVolume::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function BP_AquaticBuoyancy.BP_AquaticBuoyancy_C.SetInHole
// 0x0018 (0x0018 - 0x0000)
struct BP_AquaticBuoyancy_C_SetInHole final
{
public:
	bool                                          Increase;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticBuoyancy_C_SetInHole) == 0x000004, "Wrong alignment on BP_AquaticBuoyancy_C_SetInHole");
static_assert(sizeof(BP_AquaticBuoyancy_C_SetInHole) == 0x000018, "Wrong size on BP_AquaticBuoyancy_C_SetInHole");
static_assert(offsetof(BP_AquaticBuoyancy_C_SetInHole, Increase) == 0x000000, "Member 'BP_AquaticBuoyancy_C_SetInHole::Increase' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_SetInHole, Temp_int_Variable) == 0x000004, "Member 'BP_AquaticBuoyancy_C_SetInHole::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_SetInHole, Temp_int_Variable_1) == 0x000008, "Member 'BP_AquaticBuoyancy_C_SetInHole::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_SetInHole, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'BP_AquaticBuoyancy_C_SetInHole::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_SetInHole, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'BP_AquaticBuoyancy_C_SetInHole::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_SetInHole, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_AquaticBuoyancy_C_SetInHole::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_AquaticBuoyancy.BP_AquaticBuoyancy_C.SetTickMode
// 0x0028 (0x0028 - 0x0000)
struct BP_AquaticBuoyancy_C_SetTickMode final
{
public:
	bool                                          InWater_0;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetLinearDamping_InDamping_ImplicitCast;  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetAngularDamping_InDamping_ImplicitCast; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetAngularDamping_InDamping_ImplicitCast_1; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetLinearDamping_InDamping_ImplicitCast_1; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticBuoyancy_C_SetTickMode) == 0x000008, "Wrong alignment on BP_AquaticBuoyancy_C_SetTickMode");
static_assert(sizeof(BP_AquaticBuoyancy_C_SetTickMode) == 0x000028, "Wrong size on BP_AquaticBuoyancy_C_SetTickMode");
static_assert(offsetof(BP_AquaticBuoyancy_C_SetTickMode, InWater_0) == 0x000000, "Member 'BP_AquaticBuoyancy_C_SetTickMode::InWater_0' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_SetTickMode, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_AquaticBuoyancy_C_SetTickMode::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_SetTickMode, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_AquaticBuoyancy_C_SetTickMode::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_SetTickMode, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000010, "Member 'BP_AquaticBuoyancy_C_SetTickMode::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_SetTickMode, CallFunc_SetLinearDamping_InDamping_ImplicitCast) == 0x000018, "Member 'BP_AquaticBuoyancy_C_SetTickMode::CallFunc_SetLinearDamping_InDamping_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_SetTickMode, CallFunc_SetAngularDamping_InDamping_ImplicitCast) == 0x00001C, "Member 'BP_AquaticBuoyancy_C_SetTickMode::CallFunc_SetAngularDamping_InDamping_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_SetTickMode, CallFunc_SetAngularDamping_InDamping_ImplicitCast_1) == 0x000020, "Member 'BP_AquaticBuoyancy_C_SetTickMode::CallFunc_SetAngularDamping_InDamping_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_SetTickMode, CallFunc_SetLinearDamping_InDamping_ImplicitCast_1) == 0x000024, "Member 'BP_AquaticBuoyancy_C_SetTickMode::CallFunc_SetLinearDamping_InDamping_ImplicitCast_1' has a wrong offset!");

// Function BP_AquaticBuoyancy.BP_AquaticBuoyancy_C.UpdateInFluid
// 0x0170 (0x0170 - 0x0000)
struct BP_AquaticBuoyancy_C_UpdateInFluid final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BuoyancyForce;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetPI_ReturnValue;                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             CallFunc_GetWorldOriginLocation_ReturnValue;       // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             CallFunc_GetWorldOriginLocation_ReturnValue_1;     // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0040(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetSurfceDistance_Distance;               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_1;                       // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_6;      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_7;      // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticBuoyancy_C_UpdateInFluid) == 0x000010, "Wrong alignment on BP_AquaticBuoyancy_C_UpdateInFluid");
static_assert(sizeof(BP_AquaticBuoyancy_C_UpdateInFluid) == 0x000170, "Wrong size on BP_AquaticBuoyancy_C_UpdateInFluid");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, DeltaTime) == 0x000000, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, BuoyancyForce) == 0x000008, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::BuoyancyForce' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_GetPI_ReturnValue) == 0x000010, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_GetPI_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_GetWorldOriginLocation_ReturnValue) == 0x000018, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_GetWorldOriginLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_GetWorldOriginLocation_ReturnValue_1) == 0x000024, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_GetWorldOriginLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000030, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000031, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x000032, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_BooleanAND_ReturnValue) == 0x000033, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_BooleanAND_ReturnValue_1) == 0x000035, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000040, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, K2Node_SwitchEnum_CmpSuccess) == 0x0000A0, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_Multiply_IntFloat_ReturnValue) == 0x0000A8, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000B0, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_TransformLocation_ReturnValue) == 0x0000B8, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_MakeVector_ReturnValue) == 0x0000D0, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000E8, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_GetSurfceDistance_Distance) == 0x000100, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_GetSurfceDistance_Distance' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000108, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_FMax_ReturnValue) == 0x000110, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000118, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_FMax_ReturnValue_1) == 0x000120, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000128, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_FClamp_ReturnValue) == 0x000130, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000138, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000140, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000148, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000150, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_Multiply_DoubleDouble_ReturnValue_6) == 0x000158, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_Multiply_DoubleDouble_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_Multiply_DoubleDouble_ReturnValue_7) == 0x000160, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_Multiply_DoubleDouble_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_UpdateInFluid, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000168, "Member 'BP_AquaticBuoyancy_C_UpdateInFluid::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");

// Function BP_AquaticBuoyancy.BP_AquaticBuoyancy_C.ValidateMesh
// 0x0060 (0x0060 - 0x0000)
struct BP_AquaticBuoyancy_C_ValidateMesh final
{
public:
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLinearDamping_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAngularDamping_ReturnValue;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSimulatingPhysics_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_LinearDampingCached_ImplicitCast; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_AngularDampingCached_ImplicitCast; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticBuoyancy_C_ValidateMesh) == 0x000008, "Wrong alignment on BP_AquaticBuoyancy_C_ValidateMesh");
static_assert(sizeof(BP_AquaticBuoyancy_C_ValidateMesh) == 0x000060, "Wrong size on BP_AquaticBuoyancy_C_ValidateMesh");
static_assert(offsetof(BP_AquaticBuoyancy_C_ValidateMesh, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000000, "Member 'BP_AquaticBuoyancy_C_ValidateMesh::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_ValidateMesh, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_AquaticBuoyancy_C_ValidateMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticBuoyancy_C_ValidateMesh, CallFunc_Dot_VectorVector_ReturnValue) == 0x000020, "Member 'BP_AquaticBuoyancy_C_ValidateMesh::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
