#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AdminPawn

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AdminPawn.BP_AdminPawn_C.ExecuteUbergraph_BP_AdminPawn
// 0x00A0 (0x00A0 - 0x0000)
struct BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Location;                       // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_Rotation;                       // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ATIPlayerController*                    K2Node_DynamicCast_AsThe_Isle_Player_Controller;   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_TeleportTo_ReturnValue;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn) == 0x000008, "Wrong alignment on BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn");
static_assert(sizeof(BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn) == 0x0000A0, "Wrong size on BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn");
static_assert(offsetof(BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn, EntryPoint) == 0x000000, "Member 'BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn, K2Node_CustomEvent_Location) == 0x000010, "Member 'BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn, K2Node_CustomEvent_Rotation) == 0x000028, "Member 'BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn::K2Node_CustomEvent_Rotation' has a wrong offset!");
static_assert(offsetof(BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn, K2Node_DynamicCast_AsThe_Isle_Player_Controller) == 0x000040, "Member 'BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn::K2Node_DynamicCast_AsThe_Isle_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn, CallFunc_BreakRotator_Roll) == 0x00004C, "Member 'BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn, CallFunc_BreakRotator_Pitch) == 0x000050, "Member 'BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn, CallFunc_BreakRotator_Yaw) == 0x000054, "Member 'BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000058, "Member 'BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn, CallFunc_MakeRotator_ReturnValue) == 0x000060, "Member 'BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn, CallFunc_K2_TeleportTo_ReturnValue) == 0x000078, "Member 'BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn::CallFunc_K2_TeleportTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn, CallFunc_GetController_ReturnValue) == 0x000080, "Member 'BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn, K2Node_Event_EndPlayReason) == 0x000088, "Member 'BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn, CallFunc_IsValid_ReturnValue_1) == 0x000089, "Member 'BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn, CallFunc_IsValid_ReturnValue_2) == 0x00008A, "Member 'BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000090, "Member 'BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x000098, "Member 'BP_AdminPawn_C_ExecuteUbergraph_BP_AdminPawn::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

// Function BP_AdminPawn.BP_AdminPawn_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_AdminPawn_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AdminPawn_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_AdminPawn_C_ReceiveEndPlay");
static_assert(sizeof(BP_AdminPawn_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_AdminPawn_C_ReceiveEndPlay");
static_assert(offsetof(BP_AdminPawn_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_AdminPawn_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_AdminPawn.BP_AdminPawn_C.TeleportAdminToTarget
// 0x0030 (0x0030 - 0x0000)
struct BP_AdminPawn_C_TeleportAdminToTarget final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AdminPawn_C_TeleportAdminToTarget) == 0x000008, "Wrong alignment on BP_AdminPawn_C_TeleportAdminToTarget");
static_assert(sizeof(BP_AdminPawn_C_TeleportAdminToTarget) == 0x000030, "Wrong size on BP_AdminPawn_C_TeleportAdminToTarget");
static_assert(offsetof(BP_AdminPawn_C_TeleportAdminToTarget, Location) == 0x000000, "Member 'BP_AdminPawn_C_TeleportAdminToTarget::Location' has a wrong offset!");
static_assert(offsetof(BP_AdminPawn_C_TeleportAdminToTarget, Rotation) == 0x000018, "Member 'BP_AdminPawn_C_TeleportAdminToTarget::Rotation' has a wrong offset!");

}

