#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AquaticHole

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AquaticHole.BP_AquaticHole_C
// 0x0058 (0x02E8 - 0x0290)
class ABP_AquaticHole_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_AquaticSurface_C*                   Surface;                                           // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                        TestCameraDelay;                                   // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCameraInide;                                     // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HoleIndex;                                         // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              HoleOffset;                                        // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              HoleSize;                                          // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PreviewThisHole;                                   // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCameraTest;                                     // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void CheckCamera();
	void ExecuteUbergraph_BP_AquaticHole(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SetCharacterHole(class AActor* Actor, bool ActivateHole);
	void UpdateCutHole();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AquaticHole_C">();
	}
	static class ABP_AquaticHole_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AquaticHole_C>();
	}
};
static_assert(alignof(ABP_AquaticHole_C) == 0x000008, "Wrong alignment on ABP_AquaticHole_C");
static_assert(sizeof(ABP_AquaticHole_C) == 0x0002E8, "Wrong size on ABP_AquaticHole_C");
static_assert(offsetof(ABP_AquaticHole_C, UberGraphFrame) == 0x000290, "Member 'ABP_AquaticHole_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AquaticHole_C, Box) == 0x000298, "Member 'ABP_AquaticHole_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_AquaticHole_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_AquaticHole_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_AquaticHole_C, Surface) == 0x0002A8, "Member 'ABP_AquaticHole_C::Surface' has a wrong offset!");
static_assert(offsetof(ABP_AquaticHole_C, TestCameraDelay) == 0x0002B0, "Member 'ABP_AquaticHole_C::TestCameraDelay' has a wrong offset!");
static_assert(offsetof(ABP_AquaticHole_C, IsCameraInide) == 0x0002B8, "Member 'ABP_AquaticHole_C::IsCameraInide' has a wrong offset!");
static_assert(offsetof(ABP_AquaticHole_C, HoleIndex) == 0x0002BC, "Member 'ABP_AquaticHole_C::HoleIndex' has a wrong offset!");
static_assert(offsetof(ABP_AquaticHole_C, HoleOffset) == 0x0002C0, "Member 'ABP_AquaticHole_C::HoleOffset' has a wrong offset!");
static_assert(offsetof(ABP_AquaticHole_C, HoleSize) == 0x0002D0, "Member 'ABP_AquaticHole_C::HoleSize' has a wrong offset!");
static_assert(offsetof(ABP_AquaticHole_C, PreviewThisHole) == 0x0002E0, "Member 'ABP_AquaticHole_C::PreviewThisHole' has a wrong offset!");
static_assert(offsetof(ABP_AquaticHole_C, UseCameraTest) == 0x0002E1, "Member 'ABP_AquaticHole_C::UseCameraTest' has a wrong offset!");

}

