#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AquaticInteraction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "BS_AquaticInteractionData_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AquaticInteraction.BP_AquaticInteraction_C
// 0x0060 (0x0290 - 0x0230)
class UBP_AquaticInteraction_C final : public USceneComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBS_AquaticInteractionData             Data;                                              // 0x0238(0x0028)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxSurfaceDistance;                                // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enabled;                                           // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InHole;                                            // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATIDinosaurBase*                        DinoOwner;                                         // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	double                                        BaseRadius;                                        // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BaseForce;                                         // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WaterUpOffset;                                     // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CustomEvent_0();
	void ExecuteUbergraph_BP_AquaticInteraction(int32 EntryPoint);
	void GetTransform(class ABP_AquaticSurface_C* Surface, struct FVector* Location, struct FRotator* Rotation, double* Fade, bool* splash);
	void ReceiveBeginPlay();
	void SetInHole(bool Increase);
	void UpdateFluidVariablesWithGrowth();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AquaticInteraction_C">();
	}
	static class UBP_AquaticInteraction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AquaticInteraction_C>();
	}
};
static_assert(alignof(UBP_AquaticInteraction_C) == 0x000010, "Wrong alignment on UBP_AquaticInteraction_C");
static_assert(sizeof(UBP_AquaticInteraction_C) == 0x000290, "Wrong size on UBP_AquaticInteraction_C");
static_assert(offsetof(UBP_AquaticInteraction_C, UberGraphFrame) == 0x000230, "Member 'UBP_AquaticInteraction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_AquaticInteraction_C, Data) == 0x000238, "Member 'UBP_AquaticInteraction_C::Data' has a wrong offset!");
static_assert(offsetof(UBP_AquaticInteraction_C, MaxSurfaceDistance) == 0x000260, "Member 'UBP_AquaticInteraction_C::MaxSurfaceDistance' has a wrong offset!");
static_assert(offsetof(UBP_AquaticInteraction_C, Enabled) == 0x000268, "Member 'UBP_AquaticInteraction_C::Enabled' has a wrong offset!");
static_assert(offsetof(UBP_AquaticInteraction_C, InHole) == 0x00026C, "Member 'UBP_AquaticInteraction_C::InHole' has a wrong offset!");
static_assert(offsetof(UBP_AquaticInteraction_C, DinoOwner) == 0x000270, "Member 'UBP_AquaticInteraction_C::DinoOwner' has a wrong offset!");
static_assert(offsetof(UBP_AquaticInteraction_C, BaseRadius) == 0x000278, "Member 'UBP_AquaticInteraction_C::BaseRadius' has a wrong offset!");
static_assert(offsetof(UBP_AquaticInteraction_C, BaseForce) == 0x000280, "Member 'UBP_AquaticInteraction_C::BaseForce' has a wrong offset!");
static_assert(offsetof(UBP_AquaticInteraction_C, WaterUpOffset) == 0x000288, "Member 'UBP_AquaticInteraction_C::WaterUpOffset' has a wrong offset!");

}

