#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AdminPawn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AdminPawn.BP_AdminPawn_C
// 0x0018 (0x03A8 - 0x0390)
class ABP_AdminPawn_C final : public ATIAdminPawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAC_Bodycam_C*                          AC_Bodycam;                                        // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BodyCamDisable();
	void BodyCamEnable();
	void ExecuteUbergraph_BP_AdminPawn(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void RequestedToTeleport();
	void TeleportAdminToTarget(const struct FVector& Location, const struct FRotator& Rotation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AdminPawn_C">();
	}
	static class ABP_AdminPawn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AdminPawn_C>();
	}
};
static_assert(alignof(ABP_AdminPawn_C) == 0x000008, "Wrong alignment on ABP_AdminPawn_C");
static_assert(sizeof(ABP_AdminPawn_C) == 0x0003A8, "Wrong size on ABP_AdminPawn_C");
static_assert(offsetof(ABP_AdminPawn_C, UberGraphFrame) == 0x000390, "Member 'ABP_AdminPawn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AdminPawn_C, AC_Bodycam) == 0x000398, "Member 'ABP_AdminPawn_C::AC_Bodycam' has a wrong offset!");
static_assert(offsetof(ABP_AdminPawn_C, Camera) == 0x0003A0, "Member 'ABP_AdminPawn_C::Camera' has a wrong offset!");

}

