#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AquaticSimulation

#include "Basic.hpp"

#include "BS_AquaticInteraction_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "BE_Resolution_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AquaticSimulation.BP_AquaticSimulation_C
// 0x01B8 (0x0448 - 0x0290)
class ABP_AquaticSimulation_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Plane;                                             // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Volume;                                            // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         FrameIndex;                                        // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TimeAccumulator;                                   // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AreaSize;                                          // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               SimulationInstance;                                // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               SplatInstance;                                     // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AquaticSurface_C*>           AquaticSurfaces;                                   // 0x02D8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class ABP_AquaticCaustic_C*>           AquaticCaustics;                                   // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         TextureResolution;                                 // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              TargetPoint;                                       // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBS_AquaticInteraction>         Interactions;                                      // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         RemoveInteraction;                                 // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TextureToWorld;                                    // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              HalfSize;                                          // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InterpStepSize;                                    // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AreaSizeInv;                                       // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LocationShift;                                     // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LocationShiftPrev;                                 // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TextureResolutionInv;                              // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WorldToTexture;                                    // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        UpdateRate;                                        // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AnimationRate;                                     // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxInterationsPerFrame;                            // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxTimeAccumulator;                                // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxCameraDistance;                                 // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        WaveTravelSpeed;                                   // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WaveDamping;                                       // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WaveNormalScale;                                   // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTextureRenderTarget2D*>         RenderTargets;                                     // 0x03C0(0x0010)(Edit, BlueprintVisible)
	struct FVector2D                              SimulationFocus;                                   // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SimulationCameraRadiusSq;                          // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SimulationCameraForward;                           // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SimulationCameraDistance;                          // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             PrevWorldOrigin;                                   // 0x03F8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DoInteractionUpdate;                               // 0x0404(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_405[0x3];                                      // 0x0405(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               PreviewTexture;                                    // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EBE_Resolution                                AreaResolution;                                    // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AreaScaleRatio;                                    // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CameraForwardRatio;                                // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CameraDistanceRatio;                               // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SimulationInterpSpeed;                             // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawDebug;                                         // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CineamaticRenderTarget;                            // 0x0439(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43A[0x6];                                      // 0x043A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AquaticInteraction_C*               NewVar_0;                                          // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void AddInteraction(const struct FBS_AquaticInteractionData& Interaction, const struct FVector& Location, double Duration, bool VisibilityTest);
	void AddInteractionActor(class ABP_AquaticSurface_C* InteractionSurface, class AActor* Target);
	void DebugDraw();
	void DoSimulationStep(double DeltaTime);
	void DrawSplat(const struct FVector2D& ScreenSize, class UCanvas* Canvas, double ForceSize, const struct FVector& Location, double Radius);
	void ExecuteUbergraph_BP_AquaticSimulation(int32 EntryPoint);
	void GetRenderTarget(int32 NumFramesOld, class UTextureRenderTarget2D** HeightRT);
	class UTextureRenderTarget2D* NewRenderTarget();
	void OnWorldOriginChanged(const struct FIntVector& OldLocation, const struct FIntVector& NewLocation, bool* Update);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void RemoveInteractionActor(class AActor* Target);
	void RemoveInteractionFinished();
	void SetTargetPoint(const struct FVector& TargetLocation, double InterpSpeed, double MaxDistance);
	void SpawnSplash(struct FBS_AquaticInteraction& Interaction, class ABP_AquaticSurface_C* Surface, const struct FVector& NewLocation);
	void UpdateInteraction(class UCanvas* Canvas, const struct FVector2D& ScreenSize, int32 Interaction, double DeltaTime);
	void UpdateInteractionTime(int32 Index_0, double DeltaTime, bool* Draw);
	void UpdateRenderPosition();
	void UpdateSimulation(double DeltaTime);
	void UpdateSimulationFocus();
	void UpdateTransform();
	void UserConstructionScript();

	bool IsLocal() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AquaticSimulation_C">();
	}
	static class ABP_AquaticSimulation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AquaticSimulation_C>();
	}
};
static_assert(alignof(ABP_AquaticSimulation_C) == 0x000008, "Wrong alignment on ABP_AquaticSimulation_C");
static_assert(sizeof(ABP_AquaticSimulation_C) == 0x000448, "Wrong size on ABP_AquaticSimulation_C");
static_assert(offsetof(ABP_AquaticSimulation_C, UberGraphFrame) == 0x000290, "Member 'ABP_AquaticSimulation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, Plane) == 0x000298, "Member 'ABP_AquaticSimulation_C::Plane' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, Volume) == 0x0002A0, "Member 'ABP_AquaticSimulation_C::Volume' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, DefaultSceneRoot) == 0x0002A8, "Member 'ABP_AquaticSimulation_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, FrameIndex) == 0x0002B0, "Member 'ABP_AquaticSimulation_C::FrameIndex' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, TimeAccumulator) == 0x0002B8, "Member 'ABP_AquaticSimulation_C::TimeAccumulator' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, AreaSize) == 0x0002C0, "Member 'ABP_AquaticSimulation_C::AreaSize' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, SimulationInstance) == 0x0002C8, "Member 'ABP_AquaticSimulation_C::SimulationInstance' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, SplatInstance) == 0x0002D0, "Member 'ABP_AquaticSimulation_C::SplatInstance' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, AquaticSurfaces) == 0x0002D8, "Member 'ABP_AquaticSimulation_C::AquaticSurfaces' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, AquaticCaustics) == 0x0002E8, "Member 'ABP_AquaticSimulation_C::AquaticCaustics' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, TextureResolution) == 0x0002F8, "Member 'ABP_AquaticSimulation_C::TextureResolution' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, TargetPoint) == 0x000300, "Member 'ABP_AquaticSimulation_C::TargetPoint' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, Interactions) == 0x000310, "Member 'ABP_AquaticSimulation_C::Interactions' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, RemoveInteraction) == 0x000320, "Member 'ABP_AquaticSimulation_C::RemoveInteraction' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, TextureToWorld) == 0x000328, "Member 'ABP_AquaticSimulation_C::TextureToWorld' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, HalfSize) == 0x000330, "Member 'ABP_AquaticSimulation_C::HalfSize' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, InterpStepSize) == 0x000340, "Member 'ABP_AquaticSimulation_C::InterpStepSize' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, AreaSizeInv) == 0x000348, "Member 'ABP_AquaticSimulation_C::AreaSizeInv' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, LocationShift) == 0x000350, "Member 'ABP_AquaticSimulation_C::LocationShift' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, LocationShiftPrev) == 0x000360, "Member 'ABP_AquaticSimulation_C::LocationShiftPrev' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, TextureResolutionInv) == 0x000370, "Member 'ABP_AquaticSimulation_C::TextureResolutionInv' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, WorldToTexture) == 0x000378, "Member 'ABP_AquaticSimulation_C::WorldToTexture' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, UpdateRate) == 0x000380, "Member 'ABP_AquaticSimulation_C::UpdateRate' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, AnimationRate) == 0x000388, "Member 'ABP_AquaticSimulation_C::AnimationRate' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, MaxInterationsPerFrame) == 0x000390, "Member 'ABP_AquaticSimulation_C::MaxInterationsPerFrame' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, MaxTimeAccumulator) == 0x000398, "Member 'ABP_AquaticSimulation_C::MaxTimeAccumulator' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, MaxCameraDistance) == 0x0003A0, "Member 'ABP_AquaticSimulation_C::MaxCameraDistance' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, WaveTravelSpeed) == 0x0003A8, "Member 'ABP_AquaticSimulation_C::WaveTravelSpeed' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, WaveDamping) == 0x0003B0, "Member 'ABP_AquaticSimulation_C::WaveDamping' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, WaveNormalScale) == 0x0003B8, "Member 'ABP_AquaticSimulation_C::WaveNormalScale' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, RenderTargets) == 0x0003C0, "Member 'ABP_AquaticSimulation_C::RenderTargets' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, SimulationFocus) == 0x0003D0, "Member 'ABP_AquaticSimulation_C::SimulationFocus' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, SimulationCameraRadiusSq) == 0x0003E0, "Member 'ABP_AquaticSimulation_C::SimulationCameraRadiusSq' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, SimulationCameraForward) == 0x0003E8, "Member 'ABP_AquaticSimulation_C::SimulationCameraForward' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, SimulationCameraDistance) == 0x0003F0, "Member 'ABP_AquaticSimulation_C::SimulationCameraDistance' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, PrevWorldOrigin) == 0x0003F8, "Member 'ABP_AquaticSimulation_C::PrevWorldOrigin' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, DoInteractionUpdate) == 0x000404, "Member 'ABP_AquaticSimulation_C::DoInteractionUpdate' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, PreviewTexture) == 0x000408, "Member 'ABP_AquaticSimulation_C::PreviewTexture' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, AreaResolution) == 0x000410, "Member 'ABP_AquaticSimulation_C::AreaResolution' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, AreaScaleRatio) == 0x000418, "Member 'ABP_AquaticSimulation_C::AreaScaleRatio' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, CameraForwardRatio) == 0x000420, "Member 'ABP_AquaticSimulation_C::CameraForwardRatio' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, CameraDistanceRatio) == 0x000428, "Member 'ABP_AquaticSimulation_C::CameraDistanceRatio' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, SimulationInterpSpeed) == 0x000430, "Member 'ABP_AquaticSimulation_C::SimulationInterpSpeed' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, DrawDebug) == 0x000438, "Member 'ABP_AquaticSimulation_C::DrawDebug' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, CineamaticRenderTarget) == 0x000439, "Member 'ABP_AquaticSimulation_C::CineamaticRenderTarget' has a wrong offset!");
static_assert(offsetof(ABP_AquaticSimulation_C, NewVar_0) == 0x000440, "Member 'ABP_AquaticSimulation_C::NewVar_0' has a wrong offset!");

}

