#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AquaticInteraction

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_AquaticInteraction.BP_AquaticInteraction_C.ExecuteUbergraph_BP_AquaticInteraction
// 0x0048 (0x0048 - 0x0000)
struct BP_AquaticInteraction_C_ExecuteUbergraph_BP_AquaticInteraction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATIDinosaurBase*                        K2Node_DynamicCast_AsThe_Isle_Dinosaur_Base;       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_BaseForce_ImplicitCast;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_BaseRadius_ImplicitCast;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticInteraction_C_ExecuteUbergraph_BP_AquaticInteraction) == 0x000008, "Wrong alignment on BP_AquaticInteraction_C_ExecuteUbergraph_BP_AquaticInteraction");
static_assert(sizeof(BP_AquaticInteraction_C_ExecuteUbergraph_BP_AquaticInteraction) == 0x000048, "Wrong size on BP_AquaticInteraction_C_ExecuteUbergraph_BP_AquaticInteraction");
static_assert(offsetof(BP_AquaticInteraction_C_ExecuteUbergraph_BP_AquaticInteraction, EntryPoint) == 0x000000, "Member 'BP_AquaticInteraction_C_ExecuteUbergraph_BP_AquaticInteraction::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_ExecuteUbergraph_BP_AquaticInteraction, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_AquaticInteraction_C_ExecuteUbergraph_BP_AquaticInteraction::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_ExecuteUbergraph_BP_AquaticInteraction, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'BP_AquaticInteraction_C_ExecuteUbergraph_BP_AquaticInteraction::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_ExecuteUbergraph_BP_AquaticInteraction, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BP_AquaticInteraction_C_ExecuteUbergraph_BP_AquaticInteraction::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_ExecuteUbergraph_BP_AquaticInteraction, K2Node_DynamicCast_AsThe_Isle_Dinosaur_Base) == 0x000028, "Member 'BP_AquaticInteraction_C_ExecuteUbergraph_BP_AquaticInteraction::K2Node_DynamicCast_AsThe_Isle_Dinosaur_Base' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_ExecuteUbergraph_BP_AquaticInteraction, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_AquaticInteraction_C_ExecuteUbergraph_BP_AquaticInteraction::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_ExecuteUbergraph_BP_AquaticInteraction, K2Node_VariableSet_BaseForce_ImplicitCast) == 0x000038, "Member 'BP_AquaticInteraction_C_ExecuteUbergraph_BP_AquaticInteraction::K2Node_VariableSet_BaseForce_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_ExecuteUbergraph_BP_AquaticInteraction, K2Node_VariableSet_BaseRadius_ImplicitCast) == 0x000040, "Member 'BP_AquaticInteraction_C_ExecuteUbergraph_BP_AquaticInteraction::K2Node_VariableSet_BaseRadius_ImplicitCast' has a wrong offset!");

// Function BP_AquaticInteraction.BP_AquaticInteraction_C.GetTransform
// 0x0160 (0x0160 - 0x0000)
struct BP_AquaticInteraction_C_GetTransform final
{
public:
	class ABP_AquaticSurface_C*                   Surface;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x0020(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        Fade;                                              // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          splash;                                            // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0080(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_1;                          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticInteraction_C_GetTransform) == 0x000010, "Wrong alignment on BP_AquaticInteraction_C_GetTransform");
static_assert(sizeof(BP_AquaticInteraction_C_GetTransform) == 0x000160, "Wrong size on BP_AquaticInteraction_C_GetTransform");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, Surface) == 0x000000, "Member 'BP_AquaticInteraction_C_GetTransform::Surface' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, Location) == 0x000008, "Member 'BP_AquaticInteraction_C_GetTransform::Location' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, Rotation) == 0x000020, "Member 'BP_AquaticInteraction_C_GetTransform::Rotation' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, Fade) == 0x000038, "Member 'BP_AquaticInteraction_C_GetTransform::Fade' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, splash) == 0x000040, "Member 'BP_AquaticInteraction_C_GetTransform::splash' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000041, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000048, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_BreakVector_X) == 0x000060, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_BreakVector_Y) == 0x000068, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_BreakVector_Z) == 0x000070, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000078, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000080, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_BreakTransform_Location) == 0x0000E0, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_BreakTransform_Rotation) == 0x0000F8, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_BreakTransform_Scale) == 0x000110, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_BooleanAND_ReturnValue) == 0x000128, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_BreakVector_X_1) == 0x000130, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_BreakVector_Y_1) == 0x000138, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_BreakVector_Z_1) == 0x000140, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000148, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_Abs_ReturnValue) == 0x000150, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_GetTransform, CallFunc_MapRangeClamped_ReturnValue) == 0x000158, "Member 'BP_AquaticInteraction_C_GetTransform::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");

// Function BP_AquaticInteraction.BP_AquaticInteraction_C.SetInHole
// 0x0014 (0x0014 - 0x0000)
struct BP_AquaticInteraction_C_SetInHole final
{
public:
	bool                                          Increase;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticInteraction_C_SetInHole) == 0x000004, "Wrong alignment on BP_AquaticInteraction_C_SetInHole");
static_assert(sizeof(BP_AquaticInteraction_C_SetInHole) == 0x000014, "Wrong size on BP_AquaticInteraction_C_SetInHole");
static_assert(offsetof(BP_AquaticInteraction_C_SetInHole, Increase) == 0x000000, "Member 'BP_AquaticInteraction_C_SetInHole::Increase' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_SetInHole, Temp_int_Variable) == 0x000004, "Member 'BP_AquaticInteraction_C_SetInHole::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_SetInHole, Temp_int_Variable_1) == 0x000008, "Member 'BP_AquaticInteraction_C_SetInHole::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_SetInHole, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_AquaticInteraction_C_SetInHole::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_SetInHole, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'BP_AquaticInteraction_C_SetInHole::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function BP_AquaticInteraction.BP_AquaticInteraction_C.UpdateFluidVariablesWithGrowth
// 0x0068 (0x0068 - 0x0000)
struct BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth final
{
public:
	double                                        FinalForce;                                        // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FinalRadius;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGrowth_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsAlive_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGrowth_ReturnValue_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_2;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_3;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_SetFieldsInStruct_Force_10_2F4FD72F49BCBB81FA9729A268993C4D_ImplicitCast; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_SetFieldsInStruct_Radius_12_E1550A634ADBB4EA56E2B1AE4AEDF60B_ImplicitCast; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast_1;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth) == 0x000008, "Wrong alignment on BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth");
static_assert(sizeof(BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth) == 0x000068, "Wrong size on BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth");
static_assert(offsetof(BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth, FinalForce) == 0x000000, "Member 'BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth::FinalForce' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth, FinalRadius) == 0x000008, "Member 'BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth::FinalRadius' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth, CallFunc_GetGrowth_ReturnValue) == 0x000014, "Member 'BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth::CallFunc_GetGrowth_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth, CallFunc_FClamp_ReturnValue) == 0x000018, "Member 'BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth, CallFunc_GetIsAlive_ReturnValue) == 0x000020, "Member 'BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth::CallFunc_GetIsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth, CallFunc_GetGrowth_ReturnValue_1) == 0x000024, "Member 'BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth::CallFunc_GetGrowth_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth, CallFunc_FClamp_ReturnValue_1) == 0x000028, "Member 'BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000038, "Member 'BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth, CallFunc_FClamp_ReturnValue_2) == 0x000040, "Member 'BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth, CallFunc_FClamp_ReturnValue_3) == 0x000048, "Member 'BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth::CallFunc_FClamp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth, K2Node_SetFieldsInStruct_Force_10_2F4FD72F49BCBB81FA9729A268993C4D_ImplicitCast) == 0x000050, "Member 'BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth::K2Node_SetFieldsInStruct_Force_10_2F4FD72F49BCBB81FA9729A268993C4D_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth, K2Node_SetFieldsInStruct_Radius_12_E1550A634ADBB4EA56E2B1AE4AEDF60B_ImplicitCast) == 0x000054, "Member 'BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth::K2Node_SetFieldsInStruct_Radius_12_E1550A634ADBB4EA56E2B1AE4AEDF60B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth, CallFunc_FClamp_Value_ImplicitCast) == 0x000058, "Member 'BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth::CallFunc_FClamp_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth, CallFunc_FClamp_Value_ImplicitCast_1) == 0x000060, "Member 'BP_AquaticInteraction_C_UpdateFluidVariablesWithGrowth::CallFunc_FClamp_Value_ImplicitCast_1' has a wrong offset!");

}

