#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIZoneManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_AIZoneManager.BP_AIZoneManager_C
// 0x0020 (0x03A8 - 0x0388)
class ABP_AIZoneManager_C final : public ATIAIZoneManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGuid                                  ZoneGUID;                                          // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SaveGameIndex;                                     // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AIZoneManager(int32 EntryPoint);
	void MultithreadedFunctionExecute();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_AIZoneManager_C">();
	}
	static class ABP_AIZoneManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AIZoneManager_C>();
	}
};
static_assert(alignof(ABP_AIZoneManager_C) == 0x000008, "Wrong alignment on ABP_AIZoneManager_C");
static_assert(sizeof(ABP_AIZoneManager_C) == 0x0003A8, "Wrong size on ABP_AIZoneManager_C");
static_assert(offsetof(ABP_AIZoneManager_C, UberGraphFrame) == 0x000388, "Member 'ABP_AIZoneManager_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_AIZoneManager_C, ZoneGUID) == 0x000390, "Member 'ABP_AIZoneManager_C::ZoneGUID' has a wrong offset!");
static_assert(offsetof(ABP_AIZoneManager_C, SaveGameIndex) == 0x0003A0, "Member 'ABP_AIZoneManager_C::SaveGameIndex' has a wrong offset!");

}

