#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BloodSplat

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BloodSplat.BP_BloodSplat_C.ExecuteUbergraph_BP_BloodSplat
// 0x01F0 (0x01F0 - 0x0000)
struct BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATIDinosaurBase*                        K2Node_Event_Scenter_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bScentStarted;                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIScentEffectManager*                  CallFunc_GetBloodEffectManager_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATIDinosaurBase*                        K2Node_Event_Scenter;                              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bScentFinished;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIScentEffectManager*                  CallFunc_GetBloodEffectManager_ReturnValue_1;      // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorFloat_ReturnValue;              // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIDinosaurBase*                        K2Node_DynamicCast_AsThe_Isle_Dinosaur_Base;       // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMoving_ReturnValue;                     // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGrowth_ReturnValue;                    // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleRadius_ReturnValue;       // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_ClampVectorSize_ReturnValue;              // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0178(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0188(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_B_ImplicitCast;     // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFadeScreenSize_NewFadeScreenSize_ImplicitCast; // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat) == 0x000008, "Wrong alignment on BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat");
static_assert(sizeof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat) == 0x0001F0, "Wrong size on BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, EntryPoint) == 0x000000, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, K2Node_Event_Scenter_1) == 0x000010, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::K2Node_Event_Scenter_1' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, K2Node_Event_bScentStarted) == 0x000018, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::K2Node_Event_bScentStarted' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_GetBloodEffectManager_ReturnValue) == 0x000020, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_GetBloodEffectManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, K2Node_Event_Scenter) == 0x000028, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::K2Node_Event_Scenter' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, K2Node_Event_bScentFinished) == 0x000030, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::K2Node_Event_bScentFinished' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_GetBloodEffectManager_ReturnValue_1) == 0x000038, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_GetBloodEffectManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000060, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_MakeVector_ReturnValue) == 0x000078, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000090, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_Not_PreBool_ReturnValue) == 0x000098, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_BooleanAND_ReturnValue) == 0x000099, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_GetActorScale3D_ReturnValue) == 0x0000A0, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_Add_VectorFloat_ReturnValue) == 0x0000B8, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_Add_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_IsValid_ReturnValue_2) == 0x0000D0, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_IsValid_ReturnValue_3) == 0x0000D1, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, K2Node_DynamicCast_AsThe_Isle_Dinosaur_Base) == 0x0000D8, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::K2Node_DynamicCast_AsThe_Isle_Dinosaur_Base' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_IsMoving_ReturnValue) == 0x0000E1, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_IsMoving_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_GetGrowth_ReturnValue) == 0x0000E4, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_GetGrowth_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000E8, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_MakeVector_ReturnValue_1) == 0x0000F0, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_GetScaledCapsuleRadius_ReturnValue) == 0x000108, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_GetScaledCapsuleRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000110, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000118, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_IsValid_ReturnValue_4) == 0x000120, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_ClampVectorSize_ReturnValue) == 0x000128, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_ClampVectorSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_BreakVector_X) == 0x000140, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_BreakVector_Y) == 0x000148, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_BreakVector_Z) == 0x000150, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000158, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000160, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, K2Node_CreateDelegate_OutputDelegate) == 0x000178, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000188, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000190, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_MakeVector_ReturnValue_2) == 0x000198, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_IsServer_ReturnValue) == 0x0001B0, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x0001B4, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x0001B8, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0001C0, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_Abs_ReturnValue) == 0x0001C8, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_Multiply_DoubleDouble_B_ImplicitCast) == 0x0001D0, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_Multiply_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0001D8, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x0001E0, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat, CallFunc_SetFadeScreenSize_NewFadeScreenSize_ImplicitCast) == 0x0001E8, "Member 'BP_BloodSplat_C_ExecuteUbergraph_BP_BloodSplat::CallFunc_SetFadeScreenSize_NewFadeScreenSize_ImplicitCast' has a wrong offset!");

// Function BP_BloodSplat.BP_BloodSplat_C.HideScentEffects
// 0x0010 (0x0010 - 0x0000)
struct BP_BloodSplat_C_HideScentEffects final
{
public:
	class ATIDinosaurBase*                        Scenter;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bScentFinished;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BloodSplat_C_HideScentEffects) == 0x000008, "Wrong alignment on BP_BloodSplat_C_HideScentEffects");
static_assert(sizeof(BP_BloodSplat_C_HideScentEffects) == 0x000010, "Wrong size on BP_BloodSplat_C_HideScentEffects");
static_assert(offsetof(BP_BloodSplat_C_HideScentEffects, Scenter) == 0x000000, "Member 'BP_BloodSplat_C_HideScentEffects::Scenter' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_HideScentEffects, bScentFinished) == 0x000008, "Member 'BP_BloodSplat_C_HideScentEffects::bScentFinished' has a wrong offset!");

// Function BP_BloodSplat.BP_BloodSplat_C.ShowScentEffects
// 0x0010 (0x0010 - 0x0000)
struct BP_BloodSplat_C_ShowScentEffects final
{
public:
	class ATIDinosaurBase*                        Scenter;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bScentStarted;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BloodSplat_C_ShowScentEffects) == 0x000008, "Wrong alignment on BP_BloodSplat_C_ShowScentEffects");
static_assert(sizeof(BP_BloodSplat_C_ShowScentEffects) == 0x000010, "Wrong size on BP_BloodSplat_C_ShowScentEffects");
static_assert(offsetof(BP_BloodSplat_C_ShowScentEffects, Scenter) == 0x000000, "Member 'BP_BloodSplat_C_ShowScentEffects::Scenter' has a wrong offset!");
static_assert(offsetof(BP_BloodSplat_C_ShowScentEffects, bScentStarted) == 0x000008, "Member 'BP_BloodSplat_C_ShowScentEffects::bScentStarted' has a wrong offset!");

}

