#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BloodSplat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BloodSplat.BP_BloodSplat_C
// 0x0048 (0x0350 - 0x0308)
class ABP_BloodSplat_C final : public ATIDecalsBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          ScentableBox;                                      // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DecalMaterialInstance;                             // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           LoopBloodHandler;                                  // 0x0320(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ScentMaterialInstance;                             // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ATIScentEffectManager*                  ScentEffectManager;                                // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0338(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CustomEvent_0();
	void ExecuteUbergraph_BP_BloodSplat(int32 EntryPoint);
	void HideScentEffects(class ATIDinosaurBase* Scenter, bool bScentFinished);
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void ShowScentEffects(class ATIDinosaurBase* Scenter, bool bScentStarted);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BloodSplat_C">();
	}
	static class ABP_BloodSplat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BloodSplat_C>();
	}
};
static_assert(alignof(ABP_BloodSplat_C) == 0x000008, "Wrong alignment on ABP_BloodSplat_C");
static_assert(sizeof(ABP_BloodSplat_C) == 0x000350, "Wrong size on ABP_BloodSplat_C");
static_assert(offsetof(ABP_BloodSplat_C, UberGraphFrame) == 0x000308, "Member 'ABP_BloodSplat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BloodSplat_C, ScentableBox) == 0x000310, "Member 'ABP_BloodSplat_C::ScentableBox' has a wrong offset!");
static_assert(offsetof(ABP_BloodSplat_C, DecalMaterialInstance) == 0x000318, "Member 'ABP_BloodSplat_C::DecalMaterialInstance' has a wrong offset!");
static_assert(offsetof(ABP_BloodSplat_C, LoopBloodHandler) == 0x000320, "Member 'ABP_BloodSplat_C::LoopBloodHandler' has a wrong offset!");
static_assert(offsetof(ABP_BloodSplat_C, ScentMaterialInstance) == 0x000328, "Member 'ABP_BloodSplat_C::ScentMaterialInstance' has a wrong offset!");
static_assert(offsetof(ABP_BloodSplat_C, ScentEffectManager) == 0x000330, "Member 'ABP_BloodSplat_C::ScentEffectManager' has a wrong offset!");
static_assert(offsetof(ABP_BloodSplat_C, Location) == 0x000338, "Member 'ABP_BloodSplat_C::Location' has a wrong offset!");

}

