#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BloodEffectManager

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BloodEffectManager.BP_BloodEffectManager_C.GetGlobalFade
// 0x0008 (0x0008 - 0x0000)
struct BP_BloodEffectManager_C_GetGlobalFade final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BloodEffectManager_C_GetGlobalFade) == 0x000004, "Wrong alignment on BP_BloodEffectManager_C_GetGlobalFade");
static_assert(sizeof(BP_BloodEffectManager_C_GetGlobalFade) == 0x000008, "Wrong size on BP_BloodEffectManager_C_GetGlobalFade");
static_assert(offsetof(BP_BloodEffectManager_C_GetGlobalFade, ReturnValue) == 0x000000, "Member 'BP_BloodEffectManager_C_GetGlobalFade::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BloodEffectManager_C_GetGlobalFade, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000004, "Member 'BP_BloodEffectManager_C_GetGlobalFade::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");

// Function BP_BloodEffectManager.BP_BloodEffectManager_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct BP_BloodEffectManager_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BloodEffectManager_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_BloodEffectManager_C_UserConstructionScript");
static_assert(sizeof(BP_BloodEffectManager_C_UserConstructionScript) == 0x000001, "Wrong size on BP_BloodEffectManager_C_UserConstructionScript");
static_assert(offsetof(BP_BloodEffectManager_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000000, "Member 'BP_BloodEffectManager_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

}

