#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Chicken

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Chicken.BP_Chicken_C
// 0x0020 (0x1D90 - 0x1D70)
class ABP_Chicken_C final : public ATIChicken
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1D70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Colour;                                            // 0x1D78(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D7C[0x4];                                     // 0x1D7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterial*>                      Materials;                                         // 0x1D80(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_Chicken(int32 EntryPoint);
	void ReceiveBeginPlay();
	void SetMaterial();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Chicken_C">();
	}
	static class ABP_Chicken_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Chicken_C>();
	}
};
static_assert(alignof(ABP_Chicken_C) == 0x000010, "Wrong alignment on ABP_Chicken_C");
static_assert(sizeof(ABP_Chicken_C) == 0x001D90, "Wrong size on ABP_Chicken_C");
static_assert(offsetof(ABP_Chicken_C, UberGraphFrame) == 0x001D70, "Member 'ABP_Chicken_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Chicken_C, Colour) == 0x001D78, "Member 'ABP_Chicken_C::Colour' has a wrong offset!");
static_assert(offsetof(ABP_Chicken_C, Materials) == 0x001D80, "Member 'ABP_Chicken_C::Materials' has a wrong offset!");

}

