#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Chicken

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Chicken.BP_Chicken_C.ExecuteUbergraph_BP_Chicken
// 0x0018 (0x0018 - 0x0000)
struct BP_Chicken_C_ExecuteUbergraph_BP_Chicken final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterial*                              CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Chicken_C_ExecuteUbergraph_BP_Chicken) == 0x000008, "Wrong alignment on BP_Chicken_C_ExecuteUbergraph_BP_Chicken");
static_assert(sizeof(BP_Chicken_C_ExecuteUbergraph_BP_Chicken) == 0x000018, "Wrong size on BP_Chicken_C_ExecuteUbergraph_BP_Chicken");
static_assert(offsetof(BP_Chicken_C_ExecuteUbergraph_BP_Chicken, EntryPoint) == 0x000000, "Member 'BP_Chicken_C_ExecuteUbergraph_BP_Chicken::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Chicken_C_ExecuteUbergraph_BP_Chicken, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_Chicken_C_ExecuteUbergraph_BP_Chicken::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chicken_C_ExecuteUbergraph_BP_Chicken, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000008, "Member 'BP_Chicken_C_ExecuteUbergraph_BP_Chicken::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chicken_C_ExecuteUbergraph_BP_Chicken, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_Chicken_C_ExecuteUbergraph_BP_Chicken::CallFunc_Array_Get_Item' has a wrong offset!");

}

