#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ForagingSpot

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ForagingSpot.BP_ForagingSpot_C.ExecuteUbergraph_BP_ForagingSpot
// 0x0088 (0x0088 - 0x0000)
struct BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIDinosaurBase*                        K2Node_Event_Scenter_1;                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bScentStarted;                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIDinosaurBase*                        K2Node_Event_Scenter;                              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bScentFinished;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller_1;          // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATIHUD*                                 K2Node_DynamicCast_AsThe_Isle_HUD;                 // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIHUD*                                 K2Node_DynamicCast_AsThe_Isle_HUD_1;               // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot) == 0x000008, "Wrong alignment on BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot");
static_assert(sizeof(BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot) == 0x000088, "Wrong size on BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot");
static_assert(offsetof(BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot, EntryPoint) == 0x000000, "Member 'BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot, K2Node_Event_Scenter_1) == 0x000008, "Member 'BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot::K2Node_Event_Scenter_1' has a wrong offset!");
static_assert(offsetof(BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot, K2Node_Event_bScentStarted) == 0x000010, "Member 'BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot::K2Node_Event_bScentStarted' has a wrong offset!");
static_assert(offsetof(BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot, K2Node_Event_Scenter) == 0x000018, "Member 'BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot::K2Node_Event_Scenter' has a wrong offset!");
static_assert(offsetof(BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot, K2Node_Event_bScentFinished) == 0x000020, "Member 'BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot::K2Node_Event_bScentFinished' has a wrong offset!");
static_assert(offsetof(BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot, CallFunc_GetController_ReturnValue) == 0x000028, "Member 'BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot, CallFunc_GetController_ReturnValue_1) == 0x000030, "Member 'BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot::CallFunc_GetController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot, K2Node_DynamicCast_AsPlayer_Controller) == 0x000038, "Member 'BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot::K2Node_DynamicCast_AsPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot, K2Node_DynamicCast_AsPlayer_Controller_1) == 0x000048, "Member 'BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot::K2Node_DynamicCast_AsPlayer_Controller_1' has a wrong offset!");
static_assert(offsetof(BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot, CallFunc_GetHUD_ReturnValue) == 0x000058, "Member 'BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot, CallFunc_GetHUD_ReturnValue_1) == 0x000060, "Member 'BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot, K2Node_DynamicCast_AsThe_Isle_HUD) == 0x000068, "Member 'BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot::K2Node_DynamicCast_AsThe_Isle_HUD' has a wrong offset!");
static_assert(offsetof(BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot, K2Node_DynamicCast_AsThe_Isle_HUD_1) == 0x000078, "Member 'BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot::K2Node_DynamicCast_AsThe_Isle_HUD_1' has a wrong offset!");
static_assert(offsetof(BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot, K2Node_DynamicCast_bSuccess_3) == 0x000080, "Member 'BP_ForagingSpot_C_ExecuteUbergraph_BP_ForagingSpot::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function BP_ForagingSpot.BP_ForagingSpot_C.GetScentLocation
// 0x0030 (0x0030 - 0x0000)
struct BP_ForagingSpot_C_GetScentLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ForagingSpot_C_GetScentLocation) == 0x000008, "Wrong alignment on BP_ForagingSpot_C_GetScentLocation");
static_assert(sizeof(BP_ForagingSpot_C_GetScentLocation) == 0x000030, "Wrong size on BP_ForagingSpot_C_GetScentLocation");
static_assert(offsetof(BP_ForagingSpot_C_GetScentLocation, ReturnValue) == 0x000000, "Member 'BP_ForagingSpot_C_GetScentLocation::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ForagingSpot_C_GetScentLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_ForagingSpot_C_GetScentLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function BP_ForagingSpot.BP_ForagingSpot_C.HideScentEffects
// 0x0010 (0x0010 - 0x0000)
struct BP_ForagingSpot_C_HideScentEffects final
{
public:
	class ATIDinosaurBase*                        Scenter;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bScentFinished;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ForagingSpot_C_HideScentEffects) == 0x000008, "Wrong alignment on BP_ForagingSpot_C_HideScentEffects");
static_assert(sizeof(BP_ForagingSpot_C_HideScentEffects) == 0x000010, "Wrong size on BP_ForagingSpot_C_HideScentEffects");
static_assert(offsetof(BP_ForagingSpot_C_HideScentEffects, Scenter) == 0x000000, "Member 'BP_ForagingSpot_C_HideScentEffects::Scenter' has a wrong offset!");
static_assert(offsetof(BP_ForagingSpot_C_HideScentEffects, bScentFinished) == 0x000008, "Member 'BP_ForagingSpot_C_HideScentEffects::bScentFinished' has a wrong offset!");

// Function BP_ForagingSpot.BP_ForagingSpot_C.IsCorpse
// 0x0001 (0x0001 - 0x0000)
struct BP_ForagingSpot_C_IsCorpse final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ForagingSpot_C_IsCorpse) == 0x000001, "Wrong alignment on BP_ForagingSpot_C_IsCorpse");
static_assert(sizeof(BP_ForagingSpot_C_IsCorpse) == 0x000001, "Wrong size on BP_ForagingSpot_C_IsCorpse");
static_assert(offsetof(BP_ForagingSpot_C_IsCorpse, ReturnValue) == 0x000000, "Member 'BP_ForagingSpot_C_IsCorpse::ReturnValue' has a wrong offset!");

// Function BP_ForagingSpot.BP_ForagingSpot_C.IsScentableFootprint
// 0x0001 (0x0001 - 0x0000)
struct BP_ForagingSpot_C_IsScentableFootprint final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ForagingSpot_C_IsScentableFootprint) == 0x000001, "Wrong alignment on BP_ForagingSpot_C_IsScentableFootprint");
static_assert(sizeof(BP_ForagingSpot_C_IsScentableFootprint) == 0x000001, "Wrong size on BP_ForagingSpot_C_IsScentableFootprint");
static_assert(offsetof(BP_ForagingSpot_C_IsScentableFootprint, ReturnValue) == 0x000000, "Member 'BP_ForagingSpot_C_IsScentableFootprint::ReturnValue' has a wrong offset!");

// Function BP_ForagingSpot.BP_ForagingSpot_C.ShowScentEffects
// 0x0010 (0x0010 - 0x0000)
struct BP_ForagingSpot_C_ShowScentEffects final
{
public:
	class ATIDinosaurBase*                        Scenter;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bScentStarted;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ForagingSpot_C_ShowScentEffects) == 0x000008, "Wrong alignment on BP_ForagingSpot_C_ShowScentEffects");
static_assert(sizeof(BP_ForagingSpot_C_ShowScentEffects) == 0x000010, "Wrong size on BP_ForagingSpot_C_ShowScentEffects");
static_assert(offsetof(BP_ForagingSpot_C_ShowScentEffects, Scenter) == 0x000000, "Member 'BP_ForagingSpot_C_ShowScentEffects::Scenter' has a wrong offset!");
static_assert(offsetof(BP_ForagingSpot_C_ShowScentEffects, bScentStarted) == 0x000008, "Member 'BP_ForagingSpot_C_ShowScentEffects::bScentStarted' has a wrong offset!");

}

