#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Footprint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Footprint.BP_Footprint_C.ExecuteUbergraph_BP_Footprint
// 0x01D8 (0x01D8 - 0x0000)
struct BP_Footprint_C_ExecuteUbergraph_BP_Footprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIDinosaurBase*                        K2Node_Event_Scenter_1;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bScentFinished;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIDinosaurBase*                        K2Node_Event_Scenter;                              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bScentStarted;                        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWallowMasked_ReturnValue;               // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value_1;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value_2;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Map_Find_Value_3;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_3;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewIsTracked;                        // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x00E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_3;        // 0x0163(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_4;        // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0166(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0167(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x016B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0170(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0188(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Pitch_ImplicitCast;           // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFadeScreenSize_NewFadeScreenSize_ImplicitCast; // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint) == 0x000008, "Wrong alignment on BP_Footprint_C_ExecuteUbergraph_BP_Footprint");
static_assert(sizeof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint) == 0x0001D8, "Wrong size on BP_Footprint_C_ExecuteUbergraph_BP_Footprint");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, EntryPoint) == 0x000000, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, Temp_struct_Variable) == 0x000008, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_Array_RemoveItem_ReturnValue) == 0x000019, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, Temp_struct_Variable_1) == 0x00001C, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, Temp_bool_Variable) == 0x00002C, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, K2Node_Event_Scenter_1) == 0x000030, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::K2Node_Event_Scenter_1' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, K2Node_Event_bScentFinished) == 0x000038, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::K2Node_Event_bScentFinished' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_IsValid_ReturnValue_2) == 0x000039, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, K2Node_Event_Scenter) == 0x000040, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::K2Node_Event_Scenter' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, K2Node_Event_bScentStarted) == 0x000048, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::K2Node_Event_bScentStarted' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_IsValid_ReturnValue_3) == 0x000049, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_IsWallowMasked_ReturnValue) == 0x00004A, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_IsWallowMasked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_Not_PreBool_ReturnValue) == 0x00004B, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_Not_PreBool_ReturnValue_1) == 0x00004C, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_BooleanAND_ReturnValue) == 0x00004D, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00004E, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_Map_Find_Value) == 0x000050, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_Map_Find_ReturnValue) == 0x000058, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_Map_Find_Value_1) == 0x000060, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_Map_Find_ReturnValue_1) == 0x000068, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_IsValid_ReturnValue_4) == 0x000069, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_Map_Find_Value_2) == 0x000070, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_Map_Find_ReturnValue_2) == 0x000078, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_Map_Find_Value_3) == 0x000080, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_Map_Find_Value_3' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_Map_Find_ReturnValue_3) == 0x000088, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_Map_Find_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000090, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000098, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_BreakRotator_Roll) == 0x0000B0, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_BreakRotator_Pitch) == 0x0000B4, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_BreakRotator_Yaw) == 0x0000B8, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_MakeRotator_ReturnValue) == 0x0000C8, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0000E0, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, K2Node_Event_bNewIsTracked) == 0x0000E1, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::K2Node_Event_bNewIsTracked' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, K2Node_Select_Default) == 0x0000E4, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x0000F8, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000100, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_GetActorScale3D_ReturnValue) == 0x000108, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_Not_PreBool_ReturnValue_2) == 0x000120, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_BreakVector_X) == 0x000128, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_BreakVector_Y) == 0x000130, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_BreakVector_Z) == 0x000138, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000140, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_MakeVector_ReturnValue) == 0x000148, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000160, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000161, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x000162, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_EqualEqual_NameName_ReturnValue_3) == 0x000163, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_EqualEqual_NameName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_EqualEqual_NameName_ReturnValue_4) == 0x000164, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_EqualEqual_NameName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_BooleanOR_ReturnValue) == 0x000165, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_IsValid_ReturnValue_5) == 0x000166, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_BooleanOR_ReturnValue_1) == 0x000167, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_BooleanOR_ReturnValue_2) == 0x000168, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_BooleanOR_ReturnValue_3) == 0x000169, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_IsServer_ReturnValue) == 0x00016A, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_IsValid_ReturnValue_6) == 0x00016B, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x00016C, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, K2Node_CreateDelegate_OutputDelegate) == 0x000170, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000180, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000188, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000190, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_Abs_ReturnValue) == 0x000198, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0001A0, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0001A8, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x0001AC, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x0001B0, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x0001B4, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0001B8, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_MakeRotator_Pitch_ImplicitCast) == 0x0001C0, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_MakeRotator_Pitch_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0001C8, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ExecuteUbergraph_BP_Footprint, CallFunc_SetFadeScreenSize_NewFadeScreenSize_ImplicitCast) == 0x0001D0, "Member 'BP_Footprint_C_ExecuteUbergraph_BP_Footprint::CallFunc_SetFadeScreenSize_NewFadeScreenSize_ImplicitCast' has a wrong offset!");

// Function BP_Footprint.BP_Footprint_C.HideScentEffects
// 0x0010 (0x0010 - 0x0000)
struct BP_Footprint_C_HideScentEffects final
{
public:
	class ATIDinosaurBase*                        Scenter;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bScentFinished;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Footprint_C_HideScentEffects) == 0x000008, "Wrong alignment on BP_Footprint_C_HideScentEffects");
static_assert(sizeof(BP_Footprint_C_HideScentEffects) == 0x000010, "Wrong size on BP_Footprint_C_HideScentEffects");
static_assert(offsetof(BP_Footprint_C_HideScentEffects, Scenter) == 0x000000, "Member 'BP_Footprint_C_HideScentEffects::Scenter' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_HideScentEffects, bScentFinished) == 0x000008, "Member 'BP_Footprint_C_HideScentEffects::bScentFinished' has a wrong offset!");

// Function BP_Footprint.BP_Footprint_C.SetTracked
// 0x0001 (0x0001 - 0x0000)
struct BP_Footprint_C_SetTracked final
{
public:
	bool                                          bNewIsTracked;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Footprint_C_SetTracked) == 0x000001, "Wrong alignment on BP_Footprint_C_SetTracked");
static_assert(sizeof(BP_Footprint_C_SetTracked) == 0x000001, "Wrong size on BP_Footprint_C_SetTracked");
static_assert(offsetof(BP_Footprint_C_SetTracked, bNewIsTracked) == 0x000000, "Member 'BP_Footprint_C_SetTracked::bNewIsTracked' has a wrong offset!");

// Function BP_Footprint.BP_Footprint_C.ShowScentEffects
// 0x0010 (0x0010 - 0x0000)
struct BP_Footprint_C_ShowScentEffects final
{
public:
	class ATIDinosaurBase*                        Scenter;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bScentStarted;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Footprint_C_ShowScentEffects) == 0x000008, "Wrong alignment on BP_Footprint_C_ShowScentEffects");
static_assert(sizeof(BP_Footprint_C_ShowScentEffects) == 0x000010, "Wrong size on BP_Footprint_C_ShowScentEffects");
static_assert(offsetof(BP_Footprint_C_ShowScentEffects, Scenter) == 0x000000, "Member 'BP_Footprint_C_ShowScentEffects::Scenter' has a wrong offset!");
static_assert(offsetof(BP_Footprint_C_ShowScentEffects, bScentStarted) == 0x000008, "Member 'BP_Footprint_C_ShowScentEffects::bScentStarted' has a wrong offset!");

}

