#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Footprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Footprint.BP_Footprint_C
// 0x0190 (0x0498 - 0x0308)
class ABP_Footprint_C final : public ATIDecalsBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   TrackerPlane;                                      // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          ScentableBox;                                      // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DecalMaterialInstance;                             // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Wet;                                               // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Bloody;                                            // 0x0329(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32A[0x6];                                      // 0x032A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               ScentMaterialInstance;                             // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ATIScentEffectManager*                  ScentEffectManager;                                // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, double>                     NormalOffsetXPerClassFront;                        // 0x0340(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, double>                     NormalOffsetYPerClassFront;                        // 0x0390(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   OwnerClassName;                                    // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, double>                     NormalOffsetXPerClassBack;                         // 0x03E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, double>                     NormalOffsetYPerClassBack;                         // 0x0438(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ATIScentEffectManager*                  TrackedFootprintEffectManager;                     // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               TrackerMaterialInstance;                           // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CustomEvent_0();
	void ExecuteUbergraph_BP_Footprint(int32 EntryPoint);
	void ExternalBeginPlay();
	void HideScentEffects(class ATIDinosaurBase* Scenter, bool bScentFinished);
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void ReSetFootprint();
	void SetTracked(bool bNewIsTracked);
	void ShowScentEffects(class ATIDinosaurBase* Scenter, bool bScentStarted);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Footprint_C">();
	}
	static class ABP_Footprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Footprint_C>();
	}
};
static_assert(alignof(ABP_Footprint_C) == 0x000008, "Wrong alignment on ABP_Footprint_C");
static_assert(sizeof(ABP_Footprint_C) == 0x000498, "Wrong size on ABP_Footprint_C");
static_assert(offsetof(ABP_Footprint_C, UberGraphFrame) == 0x000308, "Member 'ABP_Footprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Footprint_C, TrackerPlane) == 0x000310, "Member 'ABP_Footprint_C::TrackerPlane' has a wrong offset!");
static_assert(offsetof(ABP_Footprint_C, ScentableBox) == 0x000318, "Member 'ABP_Footprint_C::ScentableBox' has a wrong offset!");
static_assert(offsetof(ABP_Footprint_C, DecalMaterialInstance) == 0x000320, "Member 'ABP_Footprint_C::DecalMaterialInstance' has a wrong offset!");
static_assert(offsetof(ABP_Footprint_C, Wet) == 0x000328, "Member 'ABP_Footprint_C::Wet' has a wrong offset!");
static_assert(offsetof(ABP_Footprint_C, Bloody) == 0x000329, "Member 'ABP_Footprint_C::Bloody' has a wrong offset!");
static_assert(offsetof(ABP_Footprint_C, ScentMaterialInstance) == 0x000330, "Member 'ABP_Footprint_C::ScentMaterialInstance' has a wrong offset!");
static_assert(offsetof(ABP_Footprint_C, ScentEffectManager) == 0x000338, "Member 'ABP_Footprint_C::ScentEffectManager' has a wrong offset!");
static_assert(offsetof(ABP_Footprint_C, NormalOffsetXPerClassFront) == 0x000340, "Member 'ABP_Footprint_C::NormalOffsetXPerClassFront' has a wrong offset!");
static_assert(offsetof(ABP_Footprint_C, NormalOffsetYPerClassFront) == 0x000390, "Member 'ABP_Footprint_C::NormalOffsetYPerClassFront' has a wrong offset!");
static_assert(offsetof(ABP_Footprint_C, OwnerClassName) == 0x0003E0, "Member 'ABP_Footprint_C::OwnerClassName' has a wrong offset!");
static_assert(offsetof(ABP_Footprint_C, NormalOffsetXPerClassBack) == 0x0003E8, "Member 'ABP_Footprint_C::NormalOffsetXPerClassBack' has a wrong offset!");
static_assert(offsetof(ABP_Footprint_C, NormalOffsetYPerClassBack) == 0x000438, "Member 'ABP_Footprint_C::NormalOffsetYPerClassBack' has a wrong offset!");
static_assert(offsetof(ABP_Footprint_C, TrackedFootprintEffectManager) == 0x000488, "Member 'ABP_Footprint_C::TrackedFootprintEffectManager' has a wrong offset!");
static_assert(offsetof(ABP_Footprint_C, TrackerMaterialInstance) == 0x000490, "Member 'ABP_Footprint_C::TrackerMaterialInstance' has a wrong offset!");

}

