#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Flies

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TheIsle_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Flies.BP_Flies_C
// 0x0098 (0x0370 - 0x02D8)
class ABP_Flies_C final : public ATIInsectsBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        FliesSwarmSoundAgitated;                           // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        FliesSwarmSound;                                   // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         AmountMultiplierRev_Amount_8BB7731E4ACAC746E8D321829502B399; // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            AmountMultiplierRev__Direction_8BB7731E4ACAC746E8D321829502B399; // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     AmountMultiplierRev;                               // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         AmountMultiplier_Amount_6BB090F34AEA8CD844A0C5BE943A0861; // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            AmountMultiplier__Direction_6BB090F34AEA8CD844A0C5BE943A0861; // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     AmountMultiplier;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         PlayerNearbyStart_Value_C6F549D842AF9D20CB1ADDB1170B7F47; // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            PlayerNearbyStart__Direction_C6F549D842AF9D20CB1ADDB1170B7F47; // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_315[0x3];                                      // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     PlayerNearbyStart;                                 // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        FliesSpread;                                       // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FliesAmount;                                       // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FliesTurbulence;                                   // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FliesInitialTotal;                                 // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAlreadyInitiated_;                                // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                NiagaraTargetLocation;                             // 0x0348(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           NiagaraLocationHandler;                            // 0x0360(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          FliesAdjstmentTimeOver;                            // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AmountMultiplier__FinishedFunc();
	void AmountMultiplier__UpdateFunc();
	void AmountMultiplierRev__FinishedFunc();
	void AmountMultiplierRev__UpdateFunc();
	void BndEvt__BP_Flies_SphereComponent_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_Flies_SphereComponent_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void CustomEvent();
	void CustomEvent_0();
	void CustomEvent_1();
	void ExecuteUbergraph_BP_Flies(int32 EntryPoint);
	void ExternalStarter();
	void PlayerNearbyStart__FinishedFunc();
	void PlayerNearbyStart__UpdateFunc();
	void ReceiveBeginPlay();
	void SetAmountAsState(ECorpseType CorpseStage);
	void StartApproachPlayer();
	void StopApproachPlayer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Flies_C">();
	}
	static class ABP_Flies_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Flies_C>();
	}
};
static_assert(alignof(ABP_Flies_C) == 0x000008, "Wrong alignment on ABP_Flies_C");
static_assert(sizeof(ABP_Flies_C) == 0x000370, "Wrong size on ABP_Flies_C");
static_assert(offsetof(ABP_Flies_C, UberGraphFrame) == 0x0002D8, "Member 'ABP_Flies_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Flies_C, FliesSwarmSoundAgitated) == 0x0002E0, "Member 'ABP_Flies_C::FliesSwarmSoundAgitated' has a wrong offset!");
static_assert(offsetof(ABP_Flies_C, FliesSwarmSound) == 0x0002E8, "Member 'ABP_Flies_C::FliesSwarmSound' has a wrong offset!");
static_assert(offsetof(ABP_Flies_C, AmountMultiplierRev_Amount_8BB7731E4ACAC746E8D321829502B399) == 0x0002F0, "Member 'ABP_Flies_C::AmountMultiplierRev_Amount_8BB7731E4ACAC746E8D321829502B399' has a wrong offset!");
static_assert(offsetof(ABP_Flies_C, AmountMultiplierRev__Direction_8BB7731E4ACAC746E8D321829502B399) == 0x0002F4, "Member 'ABP_Flies_C::AmountMultiplierRev__Direction_8BB7731E4ACAC746E8D321829502B399' has a wrong offset!");
static_assert(offsetof(ABP_Flies_C, AmountMultiplierRev) == 0x0002F8, "Member 'ABP_Flies_C::AmountMultiplierRev' has a wrong offset!");
static_assert(offsetof(ABP_Flies_C, AmountMultiplier_Amount_6BB090F34AEA8CD844A0C5BE943A0861) == 0x000300, "Member 'ABP_Flies_C::AmountMultiplier_Amount_6BB090F34AEA8CD844A0C5BE943A0861' has a wrong offset!");
static_assert(offsetof(ABP_Flies_C, AmountMultiplier__Direction_6BB090F34AEA8CD844A0C5BE943A0861) == 0x000304, "Member 'ABP_Flies_C::AmountMultiplier__Direction_6BB090F34AEA8CD844A0C5BE943A0861' has a wrong offset!");
static_assert(offsetof(ABP_Flies_C, AmountMultiplier) == 0x000308, "Member 'ABP_Flies_C::AmountMultiplier' has a wrong offset!");
static_assert(offsetof(ABP_Flies_C, PlayerNearbyStart_Value_C6F549D842AF9D20CB1ADDB1170B7F47) == 0x000310, "Member 'ABP_Flies_C::PlayerNearbyStart_Value_C6F549D842AF9D20CB1ADDB1170B7F47' has a wrong offset!");
static_assert(offsetof(ABP_Flies_C, PlayerNearbyStart__Direction_C6F549D842AF9D20CB1ADDB1170B7F47) == 0x000314, "Member 'ABP_Flies_C::PlayerNearbyStart__Direction_C6F549D842AF9D20CB1ADDB1170B7F47' has a wrong offset!");
static_assert(offsetof(ABP_Flies_C, PlayerNearbyStart) == 0x000318, "Member 'ABP_Flies_C::PlayerNearbyStart' has a wrong offset!");
static_assert(offsetof(ABP_Flies_C, FliesSpread) == 0x000320, "Member 'ABP_Flies_C::FliesSpread' has a wrong offset!");
static_assert(offsetof(ABP_Flies_C, FliesAmount) == 0x000328, "Member 'ABP_Flies_C::FliesAmount' has a wrong offset!");
static_assert(offsetof(ABP_Flies_C, FliesTurbulence) == 0x000330, "Member 'ABP_Flies_C::FliesTurbulence' has a wrong offset!");
static_assert(offsetof(ABP_Flies_C, FliesInitialTotal) == 0x000338, "Member 'ABP_Flies_C::FliesInitialTotal' has a wrong offset!");
static_assert(offsetof(ABP_Flies_C, bAlreadyInitiated_) == 0x000340, "Member 'ABP_Flies_C::bAlreadyInitiated_' has a wrong offset!");
static_assert(offsetof(ABP_Flies_C, NiagaraTargetLocation) == 0x000348, "Member 'ABP_Flies_C::NiagaraTargetLocation' has a wrong offset!");
static_assert(offsetof(ABP_Flies_C, NiagaraLocationHandler) == 0x000360, "Member 'ABP_Flies_C::NiagaraLocationHandler' has a wrong offset!");
static_assert(offsetof(ABP_Flies_C, FliesAdjstmentTimeOver) == 0x000368, "Member 'ABP_Flies_C::FliesAdjstmentTimeOver' has a wrong offset!");

}

