#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FishSchool_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Niagara_structs.hpp"


namespace SDK::Params
{

// Function BP_FishSchool_Base.BP_FishSchool_Base_C.CalculateJumpVelocity
// 0x0060 (0x0060 - 0x0000)
struct BP_FishSchool_Base_C_CalculateJumpVelocity final
{
public:
	double                                        StartZ;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TargetZ;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Margin;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InitialVelocity;                                   // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InitialSpeedZ;                                     // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Gravity;                                           // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DeltaZ;                                            // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Sqrt_ReturnValue;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FishSchool_Base_C_CalculateJumpVelocity) == 0x000008, "Wrong alignment on BP_FishSchool_Base_C_CalculateJumpVelocity");
static_assert(sizeof(BP_FishSchool_Base_C_CalculateJumpVelocity) == 0x000060, "Wrong size on BP_FishSchool_Base_C_CalculateJumpVelocity");
static_assert(offsetof(BP_FishSchool_Base_C_CalculateJumpVelocity, StartZ) == 0x000000, "Member 'BP_FishSchool_Base_C_CalculateJumpVelocity::StartZ' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_CalculateJumpVelocity, TargetZ) == 0x000008, "Member 'BP_FishSchool_Base_C_CalculateJumpVelocity::TargetZ' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_CalculateJumpVelocity, Margin) == 0x000010, "Member 'BP_FishSchool_Base_C_CalculateJumpVelocity::Margin' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_CalculateJumpVelocity, InitialVelocity) == 0x000018, "Member 'BP_FishSchool_Base_C_CalculateJumpVelocity::InitialVelocity' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_CalculateJumpVelocity, InitialSpeedZ) == 0x000020, "Member 'BP_FishSchool_Base_C_CalculateJumpVelocity::InitialSpeedZ' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_CalculateJumpVelocity, Gravity) == 0x000028, "Member 'BP_FishSchool_Base_C_CalculateJumpVelocity::Gravity' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_CalculateJumpVelocity, DeltaZ) == 0x000030, "Member 'BP_FishSchool_Base_C_CalculateJumpVelocity::DeltaZ' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_CalculateJumpVelocity, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_FishSchool_Base_C_CalculateJumpVelocity::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_CalculateJumpVelocity, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_FishSchool_Base_C_CalculateJumpVelocity::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_CalculateJumpVelocity, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_FishSchool_Base_C_CalculateJumpVelocity::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_CalculateJumpVelocity, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000050, "Member 'BP_FishSchool_Base_C_CalculateJumpVelocity::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_CalculateJumpVelocity, CallFunc_Sqrt_ReturnValue) == 0x000058, "Member 'BP_FishSchool_Base_C_CalculateJumpVelocity::CallFunc_Sqrt_ReturnValue' has a wrong offset!");

// Function BP_FishSchool_Base.BP_FishSchool_Base_C.ExecuteUbergraph_BP_FishSchool_Base
// 0x00D0 (0x00D0 - 0x0000)
struct BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FBasicParticleData>             K2Node_Event_Data;                                 // 0x0010(0x0010)(ConstParm, ReferenceParm)
	class UNiagaraSystem*                         K2Node_Event_NiagaraSystem;                        // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_SimulationPositionOffset;             // 0x0028(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBasicParticleData                     CallFunc_Array_Get_Item;                           // 0x0040(0x0038)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base) == 0x000008, "Wrong alignment on BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base");
static_assert(sizeof(BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base) == 0x0000D0, "Wrong size on BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base");
static_assert(offsetof(BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base, EntryPoint) == 0x000000, "Member 'BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base, CallFunc_HasAuthority_ReturnValue) == 0x000009, "Member 'BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base, K2Node_Event_Data) == 0x000010, "Member 'BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base::K2Node_Event_Data' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base, K2Node_Event_NiagaraSystem) == 0x000020, "Member 'BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base::K2Node_Event_NiagaraSystem' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base, K2Node_Event_SimulationPositionOffset) == 0x000028, "Member 'BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base::K2Node_Event_SimulationPositionOffset' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base, Temp_int_Loop_Counter_Variable) == 0x00007C, "Member 'BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base, CallFunc_Add_IntInt_ReturnValue) == 0x000084, "Member 'BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base, CallFunc_BreakVector_X) == 0x000088, "Member 'BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base, CallFunc_BreakVector_Y) == 0x000090, "Member 'BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base, CallFunc_BreakVector_Z) == 0x000098, "Member 'BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base, CallFunc_BreakVector_X_1) == 0x0000A0, "Member 'BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base, CallFunc_BreakVector_Y_1) == 0x0000A8, "Member 'BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base, CallFunc_BreakVector_Z_1) == 0x0000B0, "Member 'BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base, CallFunc_MakeVector_ReturnValue) == 0x0000B8, "Member 'BP_FishSchool_Base_C_ExecuteUbergraph_BP_FishSchool_Base::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function BP_FishSchool_Base.BP_FishSchool_Base_C.ReceiveParticleData
// 0x0030 (0x0030 - 0x0000)
struct BP_FishSchool_Base_C_ReceiveParticleData final
{
public:
	TArray<struct FBasicParticleData>             Data;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UNiagaraSystem*                         NiagaraSystem;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SimulationPositionOffset;                          // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FishSchool_Base_C_ReceiveParticleData) == 0x000008, "Wrong alignment on BP_FishSchool_Base_C_ReceiveParticleData");
static_assert(sizeof(BP_FishSchool_Base_C_ReceiveParticleData) == 0x000030, "Wrong size on BP_FishSchool_Base_C_ReceiveParticleData");
static_assert(offsetof(BP_FishSchool_Base_C_ReceiveParticleData, Data) == 0x000000, "Member 'BP_FishSchool_Base_C_ReceiveParticleData::Data' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_ReceiveParticleData, NiagaraSystem) == 0x000010, "Member 'BP_FishSchool_Base_C_ReceiveParticleData::NiagaraSystem' has a wrong offset!");
static_assert(offsetof(BP_FishSchool_Base_C_ReceiveParticleData, SimulationPositionOffset) == 0x000018, "Member 'BP_FishSchool_Base_C_ReceiveParticleData::SimulationPositionOffset' has a wrong offset!");

}

