#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GoreIntestines

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GoreIntestines.BP_GoreIntestines_C.ExecuteUbergraph_BP_GoreIntestines
// 0x0008 (0x0008 - 0x0000)
struct BP_GoreIntestines_C_ExecuteUbergraph_BP_GoreIntestines final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPickedUp;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GoreIntestines_C_ExecuteUbergraph_BP_GoreIntestines) == 0x000004, "Wrong alignment on BP_GoreIntestines_C_ExecuteUbergraph_BP_GoreIntestines");
static_assert(sizeof(BP_GoreIntestines_C_ExecuteUbergraph_BP_GoreIntestines) == 0x000008, "Wrong size on BP_GoreIntestines_C_ExecuteUbergraph_BP_GoreIntestines");
static_assert(offsetof(BP_GoreIntestines_C_ExecuteUbergraph_BP_GoreIntestines, EntryPoint) == 0x000000, "Member 'BP_GoreIntestines_C_ExecuteUbergraph_BP_GoreIntestines::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GoreIntestines_C_ExecuteUbergraph_BP_GoreIntestines, K2Node_Event_bPickedUp) == 0x000004, "Member 'BP_GoreIntestines_C_ExecuteUbergraph_BP_GoreIntestines::K2Node_Event_bPickedUp' has a wrong offset!");

// Function BP_GoreIntestines.BP_GoreIntestines_C.OnbIsPickedUpChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_GoreIntestines_C_OnbIsPickedUpChanged final
{
public:
	bool                                          bPickedUp;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GoreIntestines_C_OnbIsPickedUpChanged) == 0x000001, "Wrong alignment on BP_GoreIntestines_C_OnbIsPickedUpChanged");
static_assert(sizeof(BP_GoreIntestines_C_OnbIsPickedUpChanged) == 0x000001, "Wrong size on BP_GoreIntestines_C_OnbIsPickedUpChanged");
static_assert(offsetof(BP_GoreIntestines_C_OnbIsPickedUpChanged, bPickedUp) == 0x000000, "Member 'BP_GoreIntestines_C_OnbIsPickedUpChanged::bPickedUp' has a wrong offset!");

}

