#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GoreLungeRight

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GoreLungeRight.BP_GoreLungeRight_C.ExecuteUbergraph_BP_GoreLungeRight
// 0x0008 (0x0008 - 0x0000)
struct BP_GoreLungeRight_C_ExecuteUbergraph_BP_GoreLungeRight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPickedUp;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GoreLungeRight_C_ExecuteUbergraph_BP_GoreLungeRight) == 0x000004, "Wrong alignment on BP_GoreLungeRight_C_ExecuteUbergraph_BP_GoreLungeRight");
static_assert(sizeof(BP_GoreLungeRight_C_ExecuteUbergraph_BP_GoreLungeRight) == 0x000008, "Wrong size on BP_GoreLungeRight_C_ExecuteUbergraph_BP_GoreLungeRight");
static_assert(offsetof(BP_GoreLungeRight_C_ExecuteUbergraph_BP_GoreLungeRight, EntryPoint) == 0x000000, "Member 'BP_GoreLungeRight_C_ExecuteUbergraph_BP_GoreLungeRight::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GoreLungeRight_C_ExecuteUbergraph_BP_GoreLungeRight, K2Node_Event_bPickedUp) == 0x000004, "Member 'BP_GoreLungeRight_C_ExecuteUbergraph_BP_GoreLungeRight::K2Node_Event_bPickedUp' has a wrong offset!");

// Function BP_GoreLungeRight.BP_GoreLungeRight_C.OnbIsPickedUpChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_GoreLungeRight_C_OnbIsPickedUpChanged final
{
public:
	bool                                          bPickedUp;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GoreLungeRight_C_OnbIsPickedUpChanged) == 0x000001, "Wrong alignment on BP_GoreLungeRight_C_OnbIsPickedUpChanged");
static_assert(sizeof(BP_GoreLungeRight_C_OnbIsPickedUpChanged) == 0x000001, "Wrong size on BP_GoreLungeRight_C_OnbIsPickedUpChanged");
static_assert(offsetof(BP_GoreLungeRight_C_OnbIsPickedUpChanged, bPickedUp) == 0x000000, "Member 'BP_GoreLungeRight_C_OnbIsPickedUpChanged::bPickedUp' has a wrong offset!");

}

