#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GoreStomach

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GoreStomach.BP_GoreStomach_C.ExecuteUbergraph_BP_GoreStomach
// 0x0008 (0x0008 - 0x0000)
struct BP_GoreStomach_C_ExecuteUbergraph_BP_GoreStomach final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPickedUp;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GoreStomach_C_ExecuteUbergraph_BP_GoreStomach) == 0x000004, "Wrong alignment on BP_GoreStomach_C_ExecuteUbergraph_BP_GoreStomach");
static_assert(sizeof(BP_GoreStomach_C_ExecuteUbergraph_BP_GoreStomach) == 0x000008, "Wrong size on BP_GoreStomach_C_ExecuteUbergraph_BP_GoreStomach");
static_assert(offsetof(BP_GoreStomach_C_ExecuteUbergraph_BP_GoreStomach, EntryPoint) == 0x000000, "Member 'BP_GoreStomach_C_ExecuteUbergraph_BP_GoreStomach::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GoreStomach_C_ExecuteUbergraph_BP_GoreStomach, K2Node_Event_bPickedUp) == 0x000004, "Member 'BP_GoreStomach_C_ExecuteUbergraph_BP_GoreStomach::K2Node_Event_bPickedUp' has a wrong offset!");

// Function BP_GoreStomach.BP_GoreStomach_C.OnbIsPickedUpChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_GoreStomach_C_OnbIsPickedUpChanged final
{
public:
	bool                                          bPickedUp;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GoreStomach_C_OnbIsPickedUpChanged) == 0x000001, "Wrong alignment on BP_GoreStomach_C_OnbIsPickedUpChanged");
static_assert(sizeof(BP_GoreStomach_C_OnbIsPickedUpChanged) == 0x000001, "Wrong size on BP_GoreStomach_C_OnbIsPickedUpChanged");
static_assert(offsetof(BP_GoreStomach_C_OnbIsPickedUpChanged, bPickedUp) == 0x000000, "Member 'BP_GoreStomach_C_OnbIsPickedUpChanged::bPickedUp' has a wrong offset!");

}

