#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HallucinationChar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HallucinationChar.BP_HallucinationChar_C
// 0x0060 (0x06E0 - 0x0680)
class ABP_HallucinationChar_C final : public ATIHallucinationCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0680(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCapsuleComponent*                      HitDetectCapsule;                                  // 0x0688(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNavigationInvokerComponent*            NavigationInvoker;                                 // 0x0690(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_DiloDissolvevfx_01;                             // 0x0698(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BodyMaterialInstance;                              // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               EyeMaterialInstance;                               // 0x06A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldBite;                                       // 0x06B0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldThreat;                                     // 0x06B1(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanBiteAndMove;                                   // 0x06B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B3[0x5];                                      // 0x06B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MainDamage;                                        // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GrowthValue;                                       // 0x06C0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bMeshFading;                                       // 0x06C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C5[0x3];                                      // 0x06C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RestartedBehaviorTimes;                            // 0x06C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasBeenTeleported;                                // 0x06CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CD[0x3];                                      // 0x06CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAITask_MoveTo*                         Move1Task;                                         // 0x06D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateMeshFadeOutEffect();
	void BndEvt__BP_HallucinationChar_CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_HallucinationChar_HitDetectCapsule_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void CallToFadeOut(bool bFastFadeout);
	void ClientCallBiteMontage();
	void ClientCallThreatMontage();
	void ExecuteUbergraph_BP_HallucinationChar(int32 EntryPoint);
	void ForceTeleportToActor(bool bForceTeleport);
	void OnBlendOut_37A339424DCE98F2DEDBC595C6A7B09A(class FName NotifyName);
	void OnBlendOut_9B9E20CF4C7105395E47F9A5810C39E3(class FName NotifyName);
	void OnCompleted_37A339424DCE98F2DEDBC595C6A7B09A(class FName NotifyName);
	void OnCompleted_9B9E20CF4C7105395E47F9A5810C39E3(class FName NotifyName);
	void OnInterrupted_37A339424DCE98F2DEDBC595C6A7B09A(class FName NotifyName);
	void OnInterrupted_9B9E20CF4C7105395E47F9A5810C39E3(class FName NotifyName);
	void OnMoveFinished_806D36BC465278644223AA8C2089A4B3(EPathFollowingResult Result, class AAIController* AIController);
	void OnMoveFinished_9D108A654A62D0C83196BC92851D2CE4(EPathFollowingResult Result, class AAIController* AIController);
	void OnMoveFinished_9ED1F5DF44D812A0D0BF999745A02A5B(EPathFollowingResult Result, class AAIController* AIController);
	void OnNotifyBegin_37A339424DCE98F2DEDBC595C6A7B09A(class FName NotifyName);
	void OnNotifyBegin_9B9E20CF4C7105395E47F9A5810C39E3(class FName NotifyName);
	void OnNotifyEnd_37A339424DCE98F2DEDBC595C6A7B09A(class FName NotifyName);
	void OnNotifyEnd_9B9E20CF4C7105395E47F9A5810C39E3(class FName NotifyName);
	void OnRep_bShouldBite();
	void OnRep_bShouldThreat();
	void OnRequestFailed_806D36BC465278644223AA8C2089A4B3();
	void OnRequestFailed_9D108A654A62D0C83196BC92851D2CE4();
	void OnRequestFailed_9ED1F5DF44D812A0D0BF999745A02A5B();
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void ReceiveTick(float DeltaSeconds);
	void RestartBehavior();
	void RestartSecondBehavior();
	void SetMaterialColors();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HallucinationChar_C">();
	}
	static class ABP_HallucinationChar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HallucinationChar_C>();
	}
};
static_assert(alignof(ABP_HallucinationChar_C) == 0x000010, "Wrong alignment on ABP_HallucinationChar_C");
static_assert(sizeof(ABP_HallucinationChar_C) == 0x0006E0, "Wrong size on ABP_HallucinationChar_C");
static_assert(offsetof(ABP_HallucinationChar_C, UberGraphFrame) == 0x000680, "Member 'ABP_HallucinationChar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C, HitDetectCapsule) == 0x000688, "Member 'ABP_HallucinationChar_C::HitDetectCapsule' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C, NavigationInvoker) == 0x000690, "Member 'ABP_HallucinationChar_C::NavigationInvoker' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C, NS_DiloDissolvevfx_01) == 0x000698, "Member 'ABP_HallucinationChar_C::NS_DiloDissolvevfx_01' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C, BodyMaterialInstance) == 0x0006A0, "Member 'ABP_HallucinationChar_C::BodyMaterialInstance' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C, EyeMaterialInstance) == 0x0006A8, "Member 'ABP_HallucinationChar_C::EyeMaterialInstance' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C, bShouldBite) == 0x0006B0, "Member 'ABP_HallucinationChar_C::bShouldBite' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C, bShouldThreat) == 0x0006B1, "Member 'ABP_HallucinationChar_C::bShouldThreat' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C, bCanBiteAndMove) == 0x0006B2, "Member 'ABP_HallucinationChar_C::bCanBiteAndMove' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C, MainDamage) == 0x0006B8, "Member 'ABP_HallucinationChar_C::MainDamage' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C, GrowthValue) == 0x0006C0, "Member 'ABP_HallucinationChar_C::GrowthValue' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C, bMeshFading) == 0x0006C4, "Member 'ABP_HallucinationChar_C::bMeshFading' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C, RestartedBehaviorTimes) == 0x0006C8, "Member 'ABP_HallucinationChar_C::RestartedBehaviorTimes' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C, bHasBeenTeleported) == 0x0006CC, "Member 'ABP_HallucinationChar_C::bHasBeenTeleported' has a wrong offset!");
static_assert(offsetof(ABP_HallucinationChar_C, Move1Task) == 0x0006D0, "Member 'ABP_HallucinationChar_C::Move1Task' has a wrong offset!");

}

