#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerController

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "TheIsle_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_PlayerController.BP_PlayerController_C.AcceptTeamJoinRequest
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerController_C_AcceptTeamJoinRequest final
{
public:
	class FString                                 RequesterIDKey;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerController_C_AcceptTeamJoinRequest) == 0x000008, "Wrong alignment on BP_PlayerController_C_AcceptTeamJoinRequest");
static_assert(sizeof(BP_PlayerController_C_AcceptTeamJoinRequest) == 0x000010, "Wrong size on BP_PlayerController_C_AcceptTeamJoinRequest");
static_assert(offsetof(BP_PlayerController_C_AcceptTeamJoinRequest, RequesterIDKey) == 0x000000, "Member 'BP_PlayerController_C_AcceptTeamJoinRequest::RequesterIDKey' has a wrong offset!");

// Function BP_PlayerController.BP_PlayerController_C.CheckRenderingSettings
// 0x0088 (0x0088 - 0x0000)
struct BP_PlayerController_C_CheckRenderingSettings final
{
public:
	int32                                         CallFunc_GetRenderingSettings_FoliageDensityScale; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRenderingSettings_bHasFoliageDensity;  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRenderingSettings_ShadowQuality;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRenderingSettings_bHasShadowQuality;   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRenderingSettings_WaterSingleLayer;    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRenderingSettings_bHasWaterSingleLayer; // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRenderingSettings_FoliageMaxTrianglesToRender; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRenderingSettings_bHasFoliageMaxTris;  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRenderingSettings_FoliageMinimumScreenSize; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRenderingSettings_bHasFoliageMinSize;  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRenderingSettings_FoliageCullAll;      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRenderingSettings_bHasFoliageCull;     // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRenderingSettings_GrassMaxAsyncTasks;  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRenderingSettings_bHasGrassAsync;      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRenderingSettings_GrassDensityScale;   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRenderingSettings_bHasGrassDensity;    // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRenderingSettings_GrassCullDistanceScale; // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRenderingSettings_bHasGrassCullScale;  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRenderingSettings_GrassEnable;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRenderingSettings_bHasGrassEnable;     // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRenderingSettings_GrassMaxCreatePerFrame; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRenderingSettings_bHasGrassMaxPerFrame; // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRenderingSettings_GrassDiscardDataOnLoad; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRenderingSettings_bHasGrassDiscardData; // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRenderingSettings_FoliageLODDisstanceScale; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRenderingSettings_bHasFoliageLODScale; // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRenderingSettings_NaniteEnabled;       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRenderingSettings_bHasNanite;          // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRenderingSettings_ReturnValue;         // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerController_ReturnValue;           // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_4;           // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_5;           // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_6;           // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_7;           // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_8;           // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_9;           // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerController_C_CheckRenderingSettings) == 0x000008, "Wrong alignment on BP_PlayerController_C_CheckRenderingSettings");
static_assert(sizeof(BP_PlayerController_C_CheckRenderingSettings) == 0x000088, "Wrong size on BP_PlayerController_C_CheckRenderingSettings");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_FoliageDensityScale) == 0x000000, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_FoliageDensityScale' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_bHasFoliageDensity) == 0x000004, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_bHasFoliageDensity' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_ShadowQuality) == 0x000008, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_ShadowQuality' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_bHasShadowQuality) == 0x00000C, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_bHasShadowQuality' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_WaterSingleLayer) == 0x000010, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_WaterSingleLayer' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_bHasWaterSingleLayer) == 0x000014, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_bHasWaterSingleLayer' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_FoliageMaxTrianglesToRender) == 0x000018, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_FoliageMaxTrianglesToRender' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_bHasFoliageMaxTris) == 0x00001C, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_bHasFoliageMaxTris' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_FoliageMinimumScreenSize) == 0x000020, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_FoliageMinimumScreenSize' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_bHasFoliageMinSize) == 0x000024, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_bHasFoliageMinSize' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_FoliageCullAll) == 0x000028, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_FoliageCullAll' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_bHasFoliageCull) == 0x00002C, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_bHasFoliageCull' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_GrassMaxAsyncTasks) == 0x000030, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_GrassMaxAsyncTasks' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_bHasGrassAsync) == 0x000034, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_bHasGrassAsync' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_GrassDensityScale) == 0x000038, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_GrassDensityScale' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_bHasGrassDensity) == 0x00003C, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_bHasGrassDensity' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_GrassCullDistanceScale) == 0x000040, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_GrassCullDistanceScale' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_bHasGrassCullScale) == 0x000044, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_bHasGrassCullScale' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_GrassEnable) == 0x000048, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_GrassEnable' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_bHasGrassEnable) == 0x00004C, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_bHasGrassEnable' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_GrassMaxCreatePerFrame) == 0x000050, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_GrassMaxCreatePerFrame' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_bHasGrassMaxPerFrame) == 0x000054, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_bHasGrassMaxPerFrame' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_GrassDiscardDataOnLoad) == 0x000058, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_GrassDiscardDataOnLoad' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_bHasGrassDiscardData) == 0x00005C, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_bHasGrassDiscardData' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_FoliageLODDisstanceScale) == 0x000060, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_FoliageLODDisstanceScale' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_bHasFoliageLODScale) == 0x000064, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_bHasFoliageLODScale' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_NaniteEnabled) == 0x000068, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_NaniteEnabled' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_bHasNanite) == 0x00006C, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_bHasNanite' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_GetRenderingSettings_ReturnValue) == 0x00006D, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_GetRenderingSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_IsPlayerController_ReturnValue) == 0x00006E, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_IsPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00006F, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000070, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000071, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x000072, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_LessEqual_IntInt_ReturnValue_3) == 0x000073, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_LessEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_LessEqual_IntInt_ReturnValue_4) == 0x000074, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_LessEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_LessEqual_IntInt_ReturnValue_5) == 0x000075, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_LessEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_LessEqual_IntInt_ReturnValue_6) == 0x000076, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_LessEqual_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000077, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000078, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_Less_IntInt_ReturnValue) == 0x000079, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_LessEqual_IntInt_ReturnValue_7) == 0x00007A, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_LessEqual_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_LessEqual_IntInt_ReturnValue_8) == 0x00007B, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_LessEqual_IntInt_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_LessEqual_IntInt_ReturnValue_9) == 0x00007C, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_LessEqual_IntInt_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_PlayerController_C_CheckRenderingSettings, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000080, "Member 'BP_PlayerController_C_CheckRenderingSettings::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_PlayerController.BP_PlayerController_C.ClientReceivedBanList
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerController_C_ClientReceivedBanList final
{
public:
	TArray<struct FIPlayerBannedData>             BanList;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_PlayerController_C_ClientReceivedBanList) == 0x000008, "Wrong alignment on BP_PlayerController_C_ClientReceivedBanList");
static_assert(sizeof(BP_PlayerController_C_ClientReceivedBanList) == 0x000010, "Wrong size on BP_PlayerController_C_ClientReceivedBanList");
static_assert(offsetof(BP_PlayerController_C_ClientReceivedBanList, BanList) == 0x000000, "Member 'BP_PlayerController_C_ClientReceivedBanList::BanList' has a wrong offset!");

// Function BP_PlayerController.BP_PlayerController_C.ClientSendHumanButtonUpdate
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerController_C_ClientSendHumanButtonUpdate final
{
public:
	bool                                          HumanEnabled;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerController_C_ClientSendHumanButtonUpdate) == 0x000001, "Wrong alignment on BP_PlayerController_C_ClientSendHumanButtonUpdate");
static_assert(sizeof(BP_PlayerController_C_ClientSendHumanButtonUpdate) == 0x000001, "Wrong size on BP_PlayerController_C_ClientSendHumanButtonUpdate");
static_assert(offsetof(BP_PlayerController_C_ClientSendHumanButtonUpdate, HumanEnabled) == 0x000000, "Member 'BP_PlayerController_C_ClientSendHumanButtonUpdate::HumanEnabled' has a wrong offset!");

// Function BP_PlayerController.BP_PlayerController_C.CloseSkinSystem
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerController_C_CloseSkinSystem final
{
public:
	bool                                          bDestroy;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerController_C_CloseSkinSystem) == 0x000001, "Wrong alignment on BP_PlayerController_C_CloseSkinSystem");
static_assert(sizeof(BP_PlayerController_C_CloseSkinSystem) == 0x000001, "Wrong size on BP_PlayerController_C_CloseSkinSystem");
static_assert(offsetof(BP_PlayerController_C_CloseSkinSystem, bDestroy) == 0x000000, "Member 'BP_PlayerController_C_CloseSkinSystem::bDestroy' has a wrong offset!");

// Function BP_PlayerController.BP_PlayerController_C.ConsoleCmd
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerController_C_ConsoleCmd final
{
public:
	class FString                                 Command;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerController_C_ConsoleCmd) == 0x000008, "Wrong alignment on BP_PlayerController_C_ConsoleCmd");
static_assert(sizeof(BP_PlayerController_C_ConsoleCmd) == 0x000010, "Wrong size on BP_PlayerController_C_ConsoleCmd");
static_assert(offsetof(BP_PlayerController_C_ConsoleCmd, Command) == 0x000000, "Member 'BP_PlayerController_C_ConsoleCmd::Command' has a wrong offset!");

// Function BP_PlayerController.BP_PlayerController_C.CredentialsReceivedAdminRequests_Event_3
// 0x0001 (0x0001 - 0x0000)
struct BP_PlayerController_C_CredentialsReceivedAdminRequests_Event_3 final
{
public:
	ECredentialType                               CredentialType;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerController_C_CredentialsReceivedAdminRequests_Event_3) == 0x000001, "Wrong alignment on BP_PlayerController_C_CredentialsReceivedAdminRequests_Event_3");
static_assert(sizeof(BP_PlayerController_C_CredentialsReceivedAdminRequests_Event_3) == 0x000001, "Wrong size on BP_PlayerController_C_CredentialsReceivedAdminRequests_Event_3");
static_assert(offsetof(BP_PlayerController_C_CredentialsReceivedAdminRequests_Event_3, CredentialType) == 0x000000, "Member 'BP_PlayerController_C_CredentialsReceivedAdminRequests_Event_3::CredentialType' has a wrong offset!");

// Function BP_PlayerController.BP_PlayerController_C.DeclineTeamJoinRequest
// 0x0010 (0x0010 - 0x0000)
struct BP_PlayerController_C_DeclineTeamJoinRequest final
{
public:
	class FString                                 RequesterIDKey;                                    // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerController_C_DeclineTeamJoinRequest) == 0x000008, "Wrong alignment on BP_PlayerController_C_DeclineTeamJoinRequest");
static_assert(sizeof(BP_PlayerController_C_DeclineTeamJoinRequest) == 0x000010, "Wrong size on BP_PlayerController_C_DeclineTeamJoinRequest");
static_assert(offsetof(BP_PlayerController_C_DeclineTeamJoinRequest, RequesterIDKey) == 0x000000, "Member 'BP_PlayerController_C_DeclineTeamJoinRequest::RequesterIDKey' has a wrong offset!");

// Function BP_PlayerController.BP_PlayerController_C.DevSpawnRequestCalled
// 0x0008 (0x0008 - 0x0000)
struct BP_PlayerController_C_DevSpawnRequestCalled final
{
public:
	class UClass*                                 ClassToSpawn;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PlayerController_C_DevSpawnRequestCalled) == 0x000008, "Wrong alignment on BP_PlayerController_C_DevSpawnRequestCalled");
static_assert(sizeof(BP_PlayerController_C_DevSpawnRequestCalled) == 0x000008, "Wrong size on BP_PlayerController_C_DevSpawnRequestCalled");
static_assert(offsetof(BP_PlayerController_C_DevSpawnRequestCalled, ClassToSpawn) == 0x000000, "Member 'BP_PlayerController_C_DevSpawnRequestCalled::ClassToSpawn' has a wrong offset!");

// Function BP_PlayerController.BP_PlayerController_C.ExecuteUbergraph_BP_PlayerController
// 0x1DA0 (0x1DA0 - 0x0000)
struct BP_PlayerController_C_ExecuteUbergraph_BP_PlayerController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATIAIWorldEventBase*>            CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable;                               // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsThe_Isle_Dinosaur_Base;  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MyDinosaurProfile_C*               CallFunc_Create_ReturnValue;                       // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_3;                        // 0x00B0(0x0018)(HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_7;                  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_7;                   // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATIAIWorldEventBase*                    CallFunc_Array_Get_Item;                           // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsAdminPanel;                   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_NameToFilter_1;                 // 0x0100(0x0010)()
	class FText                                   K2Node_CustomEvent_IDToFilter_1;                   // 0x0110(0x0010)()
	class APawn*                                  K2Node_Event_PossessedPawn;                        // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATICharacterBase*                       K2Node_DynamicCast_AsThe_Isle_Character_Base;      // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_HUD_C*                              K2Node_DynamicCast_AsBP_HUD;                       // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTIGameHUDWidget*                       CallFunc_GetGameHUD_ReturnValue;                   // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_8;                  // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD;                  // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0174(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0184(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0198(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UWBP_HUD_Annoucement_C*                 CallFunc_Create_ReturnValue_1;                     // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AB[0x5];                                      // 0x01AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_PlayerNameToBan;                // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_PlayerSteamId;                  // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_ReasonToBan;                    // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_BanTime;                        // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_CustomEvent_Names;                          // 0x01F0(0x0010)(ConstParm, ReferenceParm)
	TArray<class FText>                           K2Node_CustomEvent_SteamIDs;                       // 0x0200(0x0010)(ConstParm, ReferenceParm)
	class FText                                   K2Node_CustomEvent_NameToFilter;                   // 0x0210(0x0010)()
	class FText                                   K2Node_CustomEvent_IDToFilter;                     // 0x0220(0x0010)()
	TArray<class FString>                         K2Node_CustomEvent_Credentials;                    // 0x0230(0x0010)(ConstParm, ReferenceParm)
	class ATIGameModeBase*                        K2Node_DynamicCast_AsThe_Isle_Game_Mode_Base;      // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24A[0x2];                                      // 0x024A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_253[0x5];                                      // 0x0253(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PlayersList_C*                     K2Node_DynamicCast_AsWBP_Players_List;             // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0263(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_AdminPanel_C*                      K2Node_DynamicCast_AsWBP_Admin_Panel;              // 0x0268(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_8;                   // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_AdminPanel_C*                      K2Node_DynamicCast_AsWBP_Admin_Panel_1;            // 0x0280(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_9;                   // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_HUD_Annoucement_C*                 K2Node_DynamicCast_AsWBP_HUD_Annoucement;          // 0x0298(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_CustomEvent_Character_6;                    // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Growth_4;                       // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Health_3;                       // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Hunger_1;                       // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Thirst_1;                       // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Stamina_1;                      // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_CustomEvent_Character_5;                    // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_GroupSize_1;                    // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_9;                  // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_10;                 // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_9;                 // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_10;                // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_10;                  // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_CustomEvent_Character_4;                    // 0x0300(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Growth_3;                       // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Health_2;                       // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Hunger;                         // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Thirst;                         // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Stamina;                        // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_CustomEvent_Character_3;                    // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_GroupSize;                      // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_4;                        // 0x0340(0x0018)(HasGetValueTypeHash)
	TArray<class ATIAIBaseController*>            CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0358(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0370(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTIAvailableClassData>          K2Node_CustomEvent_Classes_1;                      // 0x0378(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FTIAvailableClassData>          K2Node_CustomEvent_CookedClasses_1;                // 0x0388(0x0010)(ConstParm, ReferenceParm)
	class ATIGameModeBase*                        K2Node_DynamicCast_AsThe_Isle_Game_Mode_Base_1;    // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_1;                     // 0x03A8(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C2[0x6];                                      // 0x03C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key_5;                        // 0x03C8(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x3];                                      // 0x03E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_11;                  // 0x03E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Command_1;                      // 0x03E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_bIsEditor_ReturnValue;                    // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_Command;                        // 0x0400(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FText>                           CallFunc_GetPlayerNames_ReturnedNames;             // 0x0410(0x0010)(ReferenceParm)
	TArray<class FText>                           CallFunc_GetPlayerNames_OutSteamIds;               // 0x0420(0x0010)(ReferenceParm)
	TArray<uint8>                                 CallFunc_GetPlayerNames_ReturnedPings;             // 0x0430(0x0010)(ReferenceParm)
	TArray<class FString>                         CallFunc_GetPlayerNames_ReturnedCredentials;       // 0x0440(0x0010)(ReferenceParm)
	struct FKey                                   K2Node_InputKeyEvent_Key_6;                        // 0x0450(0x0018)(HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Latitude;                       // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Longitude;                      // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_bIsEditor_ReturnValue_1;                  // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_Lat;                            // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_Lon;                            // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_2;                // 0x0490(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
