#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Puke

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Puke.BP_Puke_C
// 0x0020 (0x0328 - 0x0308)
class ABP_Puke_C : public ATIDecalsBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          ScentableBox;                                      // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DecalMaterialInstance;                             // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           LoopPukeHandler;                                   // 0x0320(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CustomEvent_0();
	void ExecuteUbergraph_BP_Puke(int32 EntryPoint);
	struct FVector GetScentLocation();
	void HideScentEffects(class ATIDinosaurBase* Scenter, bool bScentFinished);
	bool IsCorpse();
	void ReceiveBeginPlay();
	void ShowScentEffects(class ATIDinosaurBase* Scenter, bool bScentStarted);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Puke_C">();
	}
	static class ABP_Puke_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Puke_C>();
	}
};
static_assert(alignof(ABP_Puke_C) == 0x000008, "Wrong alignment on ABP_Puke_C");
static_assert(sizeof(ABP_Puke_C) == 0x000328, "Wrong size on ABP_Puke_C");
static_assert(offsetof(ABP_Puke_C, UberGraphFrame) == 0x000308, "Member 'ABP_Puke_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Puke_C, ScentableBox) == 0x000310, "Member 'ABP_Puke_C::ScentableBox' has a wrong offset!");
static_assert(offsetof(ABP_Puke_C, DecalMaterialInstance) == 0x000318, "Member 'ABP_Puke_C::DecalMaterialInstance' has a wrong offset!");
static_assert(offsetof(ABP_Puke_C, LoopPukeHandler) == 0x000320, "Member 'ABP_Puke_C::LoopPukeHandler' has a wrong offset!");

}

