#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PieceOfPlant

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PieceOfPlant.BP_PieceOfPlant_C
// 0x0048 (0x0480 - 0x0438)
class ABP_PieceOfPlant_C : public ATIGoreBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayAttribute                     FoodValue;                                         // 0x0440(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UProjectileMovementComponent*           NewProjectileCreated;                              // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_PieceOfMeat_NewProjectileCreated_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature(const struct FHitResult& ImpactResult);
	void ExecuteUbergraph_BP_PieceOfPlant(int32 EntryPoint);
	void OnbIsPickedUpChanged(bool bPickedUp);
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void ShowScentEffects(class ATIDinosaurBase* Scenter, bool bScentStarted);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PieceOfPlant_C">();
	}
	static class ABP_PieceOfPlant_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PieceOfPlant_C>();
	}
};
static_assert(alignof(ABP_PieceOfPlant_C) == 0x000008, "Wrong alignment on ABP_PieceOfPlant_C");
static_assert(sizeof(ABP_PieceOfPlant_C) == 0x000480, "Wrong size on ABP_PieceOfPlant_C");
static_assert(offsetof(ABP_PieceOfPlant_C, UberGraphFrame) == 0x000438, "Member 'ABP_PieceOfPlant_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PieceOfPlant_C, FoodValue) == 0x000440, "Member 'ABP_PieceOfPlant_C::FoodValue' has a wrong offset!");
static_assert(offsetof(ABP_PieceOfPlant_C, NewProjectileCreated) == 0x000478, "Member 'ABP_PieceOfPlant_C::NewProjectileCreated' has a wrong offset!");

}

