#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ptero_Harass_MeatChunk

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Ptero_Harass_MeatChunk.BP_Ptero_Harass_MeatChunk_C
// 0x00B0 (0x0370 - 0x02C0)
class ABP_Ptero_Harass_MeatChunk_C final : public ATIAIWorldEventPteroHarass
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Pterodactylus;                                     // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CurrentTarget;                                     // 0x02E0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalHits;                                         // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Timer;                                             // 0x02F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ATIGoreBase*                            DroppedPiece;                                      // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         AttractionStrength;                                // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasForcedDrop;                                     // 0x0304(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        PossibleLandLocations;                             // 0x0308(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                AvoidingLocation;                                  // 0x0318(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCanHitTarget;                                     // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CountTemp;                                         // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHarassStandard;                                 // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFlyingAway;                                       // 0x0339(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A[0x6];                                      // 0x033A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimToTextureDataAsset*                DataAsset;                                         // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ATICharacterBase*                       LastDamager;                                       // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        ParticlePositions;                                 // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        LocalParticlePositions;                            // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ClientHasTarget();
	void DropMeat();
	void ExecuteUbergraph_BP_Ptero_Harass_MeatChunk(int32 EntryPoint);
	void FlyAway();
	void ForcePickup(class ATICharacterBase* Ptero);
	void HitByCharacter(class ATICharacterBase* Character);
	void HitPlayer();
	void ParsedHitterEvent(class ATICharacterBase* Character);
	void ParticleBoundsUpdater();
	void ReceiveBeginPlay();
	void ReceiveParticleData(const TArray<struct FBasicParticleData>& Data, class UNiagaraSystem* NiagaraSystem, const struct FVector& SimulationPositionOffset);
	void ReceiveTick(float DeltaSeconds);
	void SetFoodValue();
	void SetupParticleBounds();
	void SetupParticleSystem();
	void SpawnPteraInMouth(const struct FVector& CompyMouth);
	void StartHitEvent();
	void StartingEvent();
	void StartNewSystem(class UNiagaraComponent* PSystem);
	void StartTick();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Ptero_Harass_MeatChunk_C">();
	}
	static class ABP_Ptero_Harass_MeatChunk_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Ptero_Harass_MeatChunk_C>();
	}
};
static_assert(alignof(ABP_Ptero_Harass_MeatChunk_C) == 0x000008, "Wrong alignment on ABP_Ptero_Harass_MeatChunk_C");
static_assert(sizeof(ABP_Ptero_Harass_MeatChunk_C) == 0x000370, "Wrong size on ABP_Ptero_Harass_MeatChunk_C");
static_assert(offsetof(ABP_Ptero_Harass_MeatChunk_C, UberGraphFrame) == 0x0002C0, "Member 'ABP_Ptero_Harass_MeatChunk_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Ptero_Harass_MeatChunk_C, Box) == 0x0002C8, "Member 'ABP_Ptero_Harass_MeatChunk_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_Ptero_Harass_MeatChunk_C, Pterodactylus) == 0x0002D0, "Member 'ABP_Ptero_Harass_MeatChunk_C::Pterodactylus' has a wrong offset!");
static_assert(offsetof(ABP_Ptero_Harass_MeatChunk_C, DefaultSceneRoot) == 0x0002D8, "Member 'ABP_Ptero_Harass_MeatChunk_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Ptero_Harass_MeatChunk_C, CurrentTarget) == 0x0002E0, "Member 'ABP_Ptero_Harass_MeatChunk_C::CurrentTarget' has a wrong offset!");
static_assert(offsetof(ABP_Ptero_Harass_MeatChunk_C, TotalHits) == 0x0002E8, "Member 'ABP_Ptero_Harass_MeatChunk_C::TotalHits' has a wrong offset!");
static_assert(offsetof(ABP_Ptero_Harass_MeatChunk_C, Timer) == 0x0002F0, "Member 'ABP_Ptero_Harass_MeatChunk_C::Timer' has a wrong offset!");
static_assert(offsetof(ABP_Ptero_Harass_MeatChunk_C, DroppedPiece) == 0x0002F8, "Member 'ABP_Ptero_Harass_MeatChunk_C::DroppedPiece' has a wrong offset!");
static_assert(offsetof(ABP_Ptero_Harass_MeatChunk_C, AttractionStrength) == 0x000300, "Member 'ABP_Ptero_Harass_MeatChunk_C::AttractionStrength' has a wrong offset!");
static_assert(offsetof(ABP_Ptero_Harass_MeatChunk_C, HasForcedDrop) == 0x000304, "Member 'ABP_Ptero_Harass_MeatChunk_C::HasForcedDrop' has a wrong offset!");
static_assert(offsetof(ABP_Ptero_Harass_MeatChunk_C, PossibleLandLocations) == 0x000308, "Member 'ABP_Ptero_Harass_MeatChunk_C::PossibleLandLocations' has a wrong offset!");
static_assert(offsetof(ABP_Ptero_Harass_MeatChunk_C, AvoidingLocation) == 0x000318, "Member 'ABP_Ptero_Harass_MeatChunk_C::AvoidingLocation' has a wrong offset!");
static_assert(offsetof(ABP_Ptero_Harass_MeatChunk_C, bCanHitTarget) == 0x000330, "Member 'ABP_Ptero_Harass_MeatChunk_C::bCanHitTarget' has a wrong offset!");
static_assert(offsetof(ABP_Ptero_Harass_MeatChunk_C, CountTemp) == 0x000334, "Member 'ABP_Ptero_Harass_MeatChunk_C::CountTemp' has a wrong offset!");
static_assert(offsetof(ABP_Ptero_Harass_MeatChunk_C, bIsHarassStandard) == 0x000338, "Member 'ABP_Ptero_Harass_MeatChunk_C::bIsHarassStandard' has a wrong offset!");
static_assert(offsetof(ABP_Ptero_Harass_MeatChunk_C, bFlyingAway) == 0x000339, "Member 'ABP_Ptero_Harass_MeatChunk_C::bFlyingAway' has a wrong offset!");
static_assert(offsetof(ABP_Ptero_Harass_MeatChunk_C, DataAsset) == 0x000340, "Member 'ABP_Ptero_Harass_MeatChunk_C::DataAsset' has a wrong offset!");
static_assert(offsetof(ABP_Ptero_Harass_MeatChunk_C, LastDamager) == 0x000348, "Member 'ABP_Ptero_Harass_MeatChunk_C::LastDamager' has a wrong offset!");
static_assert(offsetof(ABP_Ptero_Harass_MeatChunk_C, ParticlePositions) == 0x000350, "Member 'ABP_Ptero_Harass_MeatChunk_C::ParticlePositions' has a wrong offset!");
static_assert(offsetof(ABP_Ptero_Harass_MeatChunk_C, LocalParticlePositions) == 0x000360, "Member 'ABP_Ptero_Harass_MeatChunk_C::LocalParticlePositions' has a wrong offset!");

}

