#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ptero_JumpScare

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Ptero_JumpScare.BP_Ptero_JumpScare_C
// 0x0018 (0x0320 - 0x0308)
class ABP_Ptero_JumpScare_C final : public ATIAIWorldEventPteroScare
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Pterodactylus;                                     // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Ptero_JumpScare(int32 EntryPoint);
	void SpawnPteroScareEffects();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Ptero_JumpScare_C">();
	}
	static class ABP_Ptero_JumpScare_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Ptero_JumpScare_C>();
	}
};
static_assert(alignof(ABP_Ptero_JumpScare_C) == 0x000008, "Wrong alignment on ABP_Ptero_JumpScare_C");
static_assert(sizeof(ABP_Ptero_JumpScare_C) == 0x000320, "Wrong size on ABP_Ptero_JumpScare_C");
static_assert(offsetof(ABP_Ptero_JumpScare_C, UberGraphFrame) == 0x000308, "Member 'ABP_Ptero_JumpScare_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Ptero_JumpScare_C, Pterodactylus) == 0x000310, "Member 'ABP_Ptero_JumpScare_C::Pterodactylus' has a wrong offset!");
static_assert(offsetof(ABP_Ptero_JumpScare_C, DefaultSceneRoot) == 0x000318, "Member 'ABP_Ptero_JumpScare_C::DefaultSceneRoot' has a wrong offset!");

}

