#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PieceOfMeat

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PieceOfMeat.BP_PieceOfMeat_C.ExecuteUbergraph_BP_PieceOfMeat
// 0x00A0 (0x00A0 - 0x0000)
struct BP_PieceOfMeat_C_ExecuteUbergraph_BP_PieceOfMeat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPickedUp;                            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsPickedUp_ReturnValue;                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0030(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           CallFunc_AddComponent_ReturnValue;                 // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PieceOfMeat_C_ExecuteUbergraph_BP_PieceOfMeat) == 0x000010, "Wrong alignment on BP_PieceOfMeat_C_ExecuteUbergraph_BP_PieceOfMeat");
static_assert(sizeof(BP_PieceOfMeat_C_ExecuteUbergraph_BP_PieceOfMeat) == 0x0000A0, "Wrong size on BP_PieceOfMeat_C_ExecuteUbergraph_BP_PieceOfMeat");
static_assert(offsetof(BP_PieceOfMeat_C_ExecuteUbergraph_BP_PieceOfMeat, EntryPoint) == 0x000000, "Member 'BP_PieceOfMeat_C_ExecuteUbergraph_BP_PieceOfMeat::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PieceOfMeat_C_ExecuteUbergraph_BP_PieceOfMeat, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'BP_PieceOfMeat_C_ExecuteUbergraph_BP_PieceOfMeat::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PieceOfMeat_C_ExecuteUbergraph_BP_PieceOfMeat, CallFunc_HasAuthority_ReturnValue) == 0x000005, "Member 'BP_PieceOfMeat_C_ExecuteUbergraph_BP_PieceOfMeat::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PieceOfMeat_C_ExecuteUbergraph_BP_PieceOfMeat, K2Node_Event_bPickedUp) == 0x000006, "Member 'BP_PieceOfMeat_C_ExecuteUbergraph_BP_PieceOfMeat::K2Node_Event_bPickedUp' has a wrong offset!");
static_assert(offsetof(BP_PieceOfMeat_C_ExecuteUbergraph_BP_PieceOfMeat, CallFunc_IsValid_ReturnValue) == 0x000007, "Member 'BP_PieceOfMeat_C_ExecuteUbergraph_BP_PieceOfMeat::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PieceOfMeat_C_ExecuteUbergraph_BP_PieceOfMeat, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_PieceOfMeat_C_ExecuteUbergraph_BP_PieceOfMeat::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PieceOfMeat_C_ExecuteUbergraph_BP_PieceOfMeat, CallFunc_GetIsPickedUp_ReturnValue) == 0x00000C, "Member 'BP_PieceOfMeat_C_ExecuteUbergraph_BP_PieceOfMeat::CallFunc_GetIsPickedUp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PieceOfMeat_C_ExecuteUbergraph_BP_PieceOfMeat, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_PieceOfMeat_C_ExecuteUbergraph_BP_PieceOfMeat::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PieceOfMeat_C_ExecuteUbergraph_BP_PieceOfMeat, Temp_struct_Variable) == 0x000030, "Member 'BP_PieceOfMeat_C_ExecuteUbergraph_BP_PieceOfMeat::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_PieceOfMeat_C_ExecuteUbergraph_BP_PieceOfMeat, CallFunc_AddComponent_ReturnValue) == 0x000090, "Member 'BP_PieceOfMeat_C_ExecuteUbergraph_BP_PieceOfMeat::CallFunc_AddComponent_ReturnValue' has a wrong offset!");

// Function BP_PieceOfMeat.BP_PieceOfMeat_C.OnbIsPickedUpChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_PieceOfMeat_C_OnbIsPickedUpChanged final
{
public:
	bool                                          bPickedUp;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PieceOfMeat_C_OnbIsPickedUpChanged) == 0x000001, "Wrong alignment on BP_PieceOfMeat_C_OnbIsPickedUpChanged");
static_assert(sizeof(BP_PieceOfMeat_C_OnbIsPickedUpChanged) == 0x000001, "Wrong size on BP_PieceOfMeat_C_OnbIsPickedUpChanged");
static_assert(offsetof(BP_PieceOfMeat_C_OnbIsPickedUpChanged, bPickedUp) == 0x000000, "Member 'BP_PieceOfMeat_C_OnbIsPickedUpChanged::bPickedUp' has a wrong offset!");

// Function BP_PieceOfMeat.BP_PieceOfMeat_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PieceOfMeat_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PieceOfMeat_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PieceOfMeat_C_ReceiveTick");
static_assert(sizeof(BP_PieceOfMeat_C_ReceiveTick) == 0x000004, "Wrong size on BP_PieceOfMeat_C_ReceiveTick");
static_assert(offsetof(BP_PieceOfMeat_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PieceOfMeat_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

