#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Puke

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Puke.BP_Puke_C.ExecuteUbergraph_BP_Puke
// 0x00F8 (0x00F8 - 0x0000)
struct BP_Puke_C_ExecuteUbergraph_BP_Puke final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATIDinosaurBase*                        K2Node_Event_Scenter_1;                            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bScentStarted;                        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATICharacterBase*                       K2Node_DynamicCast_AsThe_Isle_Character_Base;      // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIHUD*                                 CallFunc_GetIsleHUD_ReturnValue;                   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATICeratosaurus*                        K2Node_DynamicCast_AsThe_Isle_Ceratosaurus;        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATIDinosaurBase*                        K2Node_Event_Scenter;                              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bScentFinished;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATIHUD*                                 CallFunc_GetIsleHUD_ReturnValue_1;                 // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATICeratosaurus*                        K2Node_DynamicCast_AsThe_Isle_Ceratosaurus_1;      // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Puke_C_ExecuteUbergraph_BP_Puke) == 0x000008, "Wrong alignment on BP_Puke_C_ExecuteUbergraph_BP_Puke");
static_assert(sizeof(BP_Puke_C_ExecuteUbergraph_BP_Puke) == 0x0000F8, "Wrong size on BP_Puke_C_ExecuteUbergraph_BP_Puke");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, EntryPoint) == 0x000000, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, CallFunc_K2_GetScalarParameterValue_ReturnValue) == 0x000008, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::CallFunc_K2_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, CallFunc_FClamp_ReturnValue) == 0x000028, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, CallFunc_GetOwner_ReturnValue) == 0x000030, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, K2Node_Event_Scenter_1) == 0x000038, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::K2Node_Event_Scenter_1' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, K2Node_Event_bScentStarted) == 0x000040, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::K2Node_Event_bScentStarted' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, K2Node_DynamicCast_AsThe_Isle_Character_Base) == 0x000048, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::K2Node_DynamicCast_AsThe_Isle_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, CallFunc_GetIsleHUD_ReturnValue) == 0x000058, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::CallFunc_GetIsleHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x000060, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, K2Node_DynamicCast_AsThe_Isle_Ceratosaurus) == 0x000068, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::K2Node_DynamicCast_AsThe_Isle_Ceratosaurus' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000078, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, K2Node_Event_Scenter) == 0x000080, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::K2Node_Event_Scenter' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, K2Node_Event_bScentFinished) == 0x000088, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::K2Node_Event_bScentFinished' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, CallFunc_MakeVector_ReturnValue) == 0x000090, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, CallFunc_GetIsleHUD_ReturnValue_1) == 0x0000A8, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::CallFunc_GetIsleHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, K2Node_DynamicCast_AsThe_Isle_Ceratosaurus_1) == 0x0000B0, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::K2Node_DynamicCast_AsThe_Isle_Ceratosaurus_1' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, K2Node_DynamicCast_bSuccess_2) == 0x0000B8, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, K2Node_CreateDelegate_OutputDelegate) == 0x0000BC, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000D0, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x0000D8, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x0000E0, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0000E8, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ExecuteUbergraph_BP_Puke, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x0000F0, "Member 'BP_Puke_C_ExecuteUbergraph_BP_Puke::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_Puke.BP_Puke_C.GetScentLocation
// 0x0030 (0x0030 - 0x0000)
struct BP_Puke_C_GetScentLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Puke_C_GetScentLocation) == 0x000008, "Wrong alignment on BP_Puke_C_GetScentLocation");
static_assert(sizeof(BP_Puke_C_GetScentLocation) == 0x000030, "Wrong size on BP_Puke_C_GetScentLocation");
static_assert(offsetof(BP_Puke_C_GetScentLocation, ReturnValue) == 0x000000, "Member 'BP_Puke_C_GetScentLocation::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_GetScentLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_Puke_C_GetScentLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function BP_Puke.BP_Puke_C.HideScentEffects
// 0x0010 (0x0010 - 0x0000)
struct BP_Puke_C_HideScentEffects final
{
public:
	class ATIDinosaurBase*                        Scenter;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bScentFinished;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Puke_C_HideScentEffects) == 0x000008, "Wrong alignment on BP_Puke_C_HideScentEffects");
static_assert(sizeof(BP_Puke_C_HideScentEffects) == 0x000010, "Wrong size on BP_Puke_C_HideScentEffects");
static_assert(offsetof(BP_Puke_C_HideScentEffects, Scenter) == 0x000000, "Member 'BP_Puke_C_HideScentEffects::Scenter' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_HideScentEffects, bScentFinished) == 0x000008, "Member 'BP_Puke_C_HideScentEffects::bScentFinished' has a wrong offset!");

// Function BP_Puke.BP_Puke_C.IsCorpse
// 0x0001 (0x0001 - 0x0000)
struct BP_Puke_C_IsCorpse final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Puke_C_IsCorpse) == 0x000001, "Wrong alignment on BP_Puke_C_IsCorpse");
static_assert(sizeof(BP_Puke_C_IsCorpse) == 0x000001, "Wrong size on BP_Puke_C_IsCorpse");
static_assert(offsetof(BP_Puke_C_IsCorpse, ReturnValue) == 0x000000, "Member 'BP_Puke_C_IsCorpse::ReturnValue' has a wrong offset!");

// Function BP_Puke.BP_Puke_C.ShowScentEffects
// 0x0010 (0x0010 - 0x0000)
struct BP_Puke_C_ShowScentEffects final
{
public:
	class ATIDinosaurBase*                        Scenter;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bScentStarted;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Puke_C_ShowScentEffects) == 0x000008, "Wrong alignment on BP_Puke_C_ShowScentEffects");
static_assert(sizeof(BP_Puke_C_ShowScentEffects) == 0x000010, "Wrong size on BP_Puke_C_ShowScentEffects");
static_assert(offsetof(BP_Puke_C_ShowScentEffects, Scenter) == 0x000000, "Member 'BP_Puke_C_ShowScentEffects::Scenter' has a wrong offset!");
static_assert(offsetof(BP_Puke_C_ShowScentEffects, bScentStarted) == 0x000008, "Member 'BP_Puke_C_ShowScentEffects::bScentStarted' has a wrong offset!");

}

