#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReplayPlayerController

#include "Basic.hpp"

#include "TheIsle_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function BP_ReplayPlayerController.BP_ReplayPlayerController_C.ExecuteUbergraph_BP_ReplayPlayerController
// 0x0178 (0x0178 - 0x0000)
struct BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASpectatorPawn*                         CallFunc_GetSpectatorPawn_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0010(0x0018)(HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_3;                     // 0x0028(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASpectatorPawn*                         CallFunc_GetSpectatorPawn_ReturnValue_1;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UMG_ReplayHUD_C*                    K2Node_DynamicCast_AsBP_UMG_Replay_HUD;            // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFloatingPawnMovement*                  K2Node_DynamicCast_AsFloating_Pawn_Movement;       // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_4;                     // 0x0078(0x0018)(HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentReplayPlayRate_ReturnValue;     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentReplayPlayRate_ReturnValue_1;   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputActionEvent_Key_1;                     // 0x00B8(0x0018)(HasGetValueTypeHash)
	struct FKey                                   Temp_struct_Variable;                              // 0x00D0(0x0018)(HasGetValueTypeHash)
	float                                         K2Node_InputAxisEvent_AxisValue;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentCameraZoom_ReturnValue;         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key_2;                     // 0x0100(0x0018)(HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTIReplayEvent>                 K2Node_Event_ReplayEvents;                         // 0x0120(0x0010)(ConstParm, ReferenceParm)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_UMG_ReplayHUD_C*                    K2Node_DynamicCast_AsBP_UMG_Replay_HUD_1;          // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCurrentReplayPlayRate_PlayRate_ImplicitCast; // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCurrentReplayPlayRate_PlayRate_ImplicitCast_1; // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AdjustCameraZoom_NewZoom_ImplicitCast;    // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController) == 0x000008, "Wrong alignment on BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController");
static_assert(sizeof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController) == 0x000178, "Wrong size on BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, EntryPoint) == 0x000000, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, CallFunc_GetSpectatorPawn_ReturnValue) == 0x000008, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::CallFunc_GetSpectatorPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, K2Node_InputActionEvent_Key) == 0x000010, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, K2Node_InputActionEvent_Key_3) == 0x000028, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::K2Node_InputActionEvent_Key_3' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, CallFunc_GetSpectatorPawn_ReturnValue_1) == 0x000048, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::CallFunc_GetSpectatorPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, K2Node_DynamicCast_AsBP_UMG_Replay_HUD) == 0x000050, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::K2Node_DynamicCast_AsBP_UMG_Replay_HUD' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, K2Node_DynamicCast_AsFloating_Pawn_Movement) == 0x000060, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::K2Node_DynamicCast_AsFloating_Pawn_Movement' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, CallFunc_GetObjectClass_ReturnValue) == 0x000070, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, K2Node_InputActionEvent_Key_4) == 0x000078, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::K2Node_InputActionEvent_Key_4' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, CallFunc_GetCurrentReplayPlayRate_ReturnValue) == 0x000090, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::CallFunc_GetCurrentReplayPlayRate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, CallFunc_GetCurrentReplayPlayRate_ReturnValue_1) == 0x000094, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::CallFunc_GetCurrentReplayPlayRate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000098, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, CallFunc_FClamp_ReturnValue) == 0x0000A8, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, CallFunc_FClamp_ReturnValue_1) == 0x0000B0, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, K2Node_InputActionEvent_Key_1) == 0x0000B8, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::K2Node_InputActionEvent_Key_1' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, Temp_struct_Variable) == 0x0000D0, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, K2Node_InputAxisEvent_AxisValue) == 0x0000E8, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::K2Node_InputAxisEvent_AxisValue' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000F0, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, CallFunc_GetCurrentCameraZoom_ReturnValue) == 0x0000F8, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::CallFunc_GetCurrentCameraZoom_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, K2Node_InputActionEvent_Key_2) == 0x000100, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::K2Node_InputActionEvent_Key_2' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000118, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, K2Node_Event_ReplayEvents) == 0x000120, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::K2Node_Event_ReplayEvents' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, K2Node_Event_DeltaSeconds) == 0x000130, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, K2Node_DynamicCast_AsBP_UMG_Replay_HUD_1) == 0x000138, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::K2Node_DynamicCast_AsBP_UMG_Replay_HUD_1' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, K2Node_DynamicCast_bSuccess_2) == 0x000140, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, CallFunc_Subtract_DoubleDouble_A_ImplicitCast) == 0x000148, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::CallFunc_Subtract_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000150, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, CallFunc_SetCurrentReplayPlayRate_PlayRate_ImplicitCast) == 0x000158, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::CallFunc_SetCurrentReplayPlayRate_PlayRate_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, CallFunc_SetCurrentReplayPlayRate_PlayRate_ImplicitCast_1) == 0x00015C, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::CallFunc_SetCurrentReplayPlayRate_PlayRate_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000160, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, CallFunc_Add_DoubleDouble_A_ImplicitCast_1) == 0x000168, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::CallFunc_Add_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController, CallFunc_AdjustCameraZoom_NewZoom_ImplicitCast) == 0x000170, "Member 'BP_ReplayPlayerController_C_ExecuteUbergraph_BP_ReplayPlayerController::CallFunc_AdjustCameraZoom_NewZoom_ImplicitCast' has a wrong offset!");

// Function BP_ReplayPlayerController.BP_ReplayPlayerController_C.InpActEvt_ReplaySpeedDown_K2Node_InputActionEvent_1
// 0x0018 (0x0018 - 0x0000)
struct BP_ReplayPlayerController_C_InpActEvt_ReplaySpeedDown_K2Node_InputActionEvent_1 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReplayPlayerController_C_InpActEvt_ReplaySpeedDown_K2Node_InputActionEvent_1) == 0x000008, "Wrong alignment on BP_ReplayPlayerController_C_InpActEvt_ReplaySpeedDown_K2Node_InputActionEvent_1");
static_assert(sizeof(BP_ReplayPlayerController_C_InpActEvt_ReplaySpeedDown_K2Node_InputActionEvent_1) == 0x000018, "Wrong size on BP_ReplayPlayerController_C_InpActEvt_ReplaySpeedDown_K2Node_InputActionEvent_1");
static_assert(offsetof(BP_ReplayPlayerController_C_InpActEvt_ReplaySpeedDown_K2Node_InputActionEvent_1, Key) == 0x000000, "Member 'BP_ReplayPlayerController_C_InpActEvt_ReplaySpeedDown_K2Node_InputActionEvent_1::Key' has a wrong offset!");

// Function BP_ReplayPlayerController.BP_ReplayPlayerController_C.InpActEvt_ReplaySpeedUp_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct BP_ReplayPlayerController_C_InpActEvt_ReplaySpeedUp_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReplayPlayerController_C_InpActEvt_ReplaySpeedUp_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on BP_ReplayPlayerController_C_InpActEvt_ReplaySpeedUp_K2Node_InputActionEvent_0");
static_assert(sizeof(BP_ReplayPlayerController_C_InpActEvt_ReplaySpeedUp_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on BP_ReplayPlayerController_C_InpActEvt_ReplaySpeedUp_K2Node_InputActionEvent_0");
static_assert(offsetof(BP_ReplayPlayerController_C_InpActEvt_ReplaySpeedUp_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'BP_ReplayPlayerController_C_InpActEvt_ReplaySpeedUp_K2Node_InputActionEvent_0::Key' has a wrong offset!");

// Function BP_ReplayPlayerController.BP_ReplayPlayerController_C.InpActEvt_Sprint_K2Node_InputActionEvent_2
// 0x0018 (0x0018 - 0x0000)
struct BP_ReplayPlayerController_C_InpActEvt_Sprint_K2Node_InputActionEvent_2 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReplayPlayerController_C_InpActEvt_Sprint_K2Node_InputActionEvent_2) == 0x000008, "Wrong alignment on BP_ReplayPlayerController_C_InpActEvt_Sprint_K2Node_InputActionEvent_2");
static_assert(sizeof(BP_ReplayPlayerController_C_InpActEvt_Sprint_K2Node_InputActionEvent_2) == 0x000018, "Wrong size on BP_ReplayPlayerController_C_InpActEvt_Sprint_K2Node_InputActionEvent_2");
static_assert(offsetof(BP_ReplayPlayerController_C_InpActEvt_Sprint_K2Node_InputActionEvent_2, Key) == 0x000000, "Member 'BP_ReplayPlayerController_C_InpActEvt_Sprint_K2Node_InputActionEvent_2::Key' has a wrong offset!");

// Function BP_ReplayPlayerController.BP_ReplayPlayerController_C.InpActEvt_Sprint_K2Node_InputActionEvent_3
// 0x0018 (0x0018 - 0x0000)
struct BP_ReplayPlayerController_C_InpActEvt_Sprint_K2Node_InputActionEvent_3 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReplayPlayerController_C_InpActEvt_Sprint_K2Node_InputActionEvent_3) == 0x000008, "Wrong alignment on BP_ReplayPlayerController_C_InpActEvt_Sprint_K2Node_InputActionEvent_3");
static_assert(sizeof(BP_ReplayPlayerController_C_InpActEvt_Sprint_K2Node_InputActionEvent_3) == 0x000018, "Wrong size on BP_ReplayPlayerController_C_InpActEvt_Sprint_K2Node_InputActionEvent_3");
static_assert(offsetof(BP_ReplayPlayerController_C_InpActEvt_Sprint_K2Node_InputActionEvent_3, Key) == 0x000000, "Member 'BP_ReplayPlayerController_C_InpActEvt_Sprint_K2Node_InputActionEvent_3::Key' has a wrong offset!");

// Function BP_ReplayPlayerController.BP_ReplayPlayerController_C.InpActEvt_ToggleHUD_K2Node_InputActionEvent_4
// 0x0018 (0x0018 - 0x0000)
struct BP_ReplayPlayerController_C_InpActEvt_ToggleHUD_K2Node_InputActionEvent_4 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReplayPlayerController_C_InpActEvt_ToggleHUD_K2Node_InputActionEvent_4) == 0x000008, "Wrong alignment on BP_ReplayPlayerController_C_InpActEvt_ToggleHUD_K2Node_InputActionEvent_4");
static_assert(sizeof(BP_ReplayPlayerController_C_InpActEvt_ToggleHUD_K2Node_InputActionEvent_4) == 0x000018, "Wrong size on BP_ReplayPlayerController_C_InpActEvt_ToggleHUD_K2Node_InputActionEvent_4");
static_assert(offsetof(BP_ReplayPlayerController_C_InpActEvt_ToggleHUD_K2Node_InputActionEvent_4, Key) == 0x000000, "Member 'BP_ReplayPlayerController_C_InpActEvt_ToggleHUD_K2Node_InputActionEvent_4::Key' has a wrong offset!");

// Function BP_ReplayPlayerController.BP_ReplayPlayerController_C.InpAxisEvt_Zoom_K2Node_InputAxisEvent_1
// 0x0004 (0x0004 - 0x0000)
struct BP_ReplayPlayerController_C_InpAxisEvt_Zoom_K2Node_InputAxisEvent_1 final
{
public:
	float                                         AxisValue;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReplayPlayerController_C_InpAxisEvt_Zoom_K2Node_InputAxisEvent_1) == 0x000004, "Wrong alignment on BP_ReplayPlayerController_C_InpAxisEvt_Zoom_K2Node_InputAxisEvent_1");
static_assert(sizeof(BP_ReplayPlayerController_C_InpAxisEvt_Zoom_K2Node_InputAxisEvent_1) == 0x000004, "Wrong size on BP_ReplayPlayerController_C_InpAxisEvt_Zoom_K2Node_InputAxisEvent_1");
static_assert(offsetof(BP_ReplayPlayerController_C_InpAxisEvt_Zoom_K2Node_InputAxisEvent_1, AxisValue) == 0x000000, "Member 'BP_ReplayPlayerController_C_InpAxisEvt_Zoom_K2Node_InputAxisEvent_1::AxisValue' has a wrong offset!");

// Function BP_ReplayPlayerController.BP_ReplayPlayerController_C.OnReplayEventsEnumerated
// 0x0010 (0x0010 - 0x0000)
struct BP_ReplayPlayerController_C_OnReplayEventsEnumerated final
{
public:
	TArray<struct FTIReplayEvent>                 ReplayEvents;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_ReplayPlayerController_C_OnReplayEventsEnumerated) == 0x000008, "Wrong alignment on BP_ReplayPlayerController_C_OnReplayEventsEnumerated");
static_assert(sizeof(BP_ReplayPlayerController_C_OnReplayEventsEnumerated) == 0x000010, "Wrong size on BP_ReplayPlayerController_C_OnReplayEventsEnumerated");
static_assert(offsetof(BP_ReplayPlayerController_C_OnReplayEventsEnumerated, ReplayEvents) == 0x000000, "Member 'BP_ReplayPlayerController_C_OnReplayEventsEnumerated::ReplayEvents' has a wrong offset!");

// Function BP_ReplayPlayerController.BP_ReplayPlayerController_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_ReplayPlayerController_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReplayPlayerController_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_ReplayPlayerController_C_ReceiveTick");
static_assert(sizeof(BP_ReplayPlayerController_C_ReceiveTick) == 0x000004, "Wrong size on BP_ReplayPlayerController_C_ReceiveTick");
static_assert(offsetof(BP_ReplayPlayerController_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_ReplayPlayerController_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

