#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Rabbit

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Rabbit.BP_Rabbit_C
// 0x0070 (0x1EA0 - 0x1E30)
class ABP_Rabbit_C final : public ATIRabbit
{
public:
	bool                                          bIsDigging;                                        // 0x1E30(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDiggingOut;                                     // 0x1E31(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E32[0x6];                                     // 0x1E32(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_RabbitBurrow_C*                     Burrow_0;                                          // 0x1E38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DestinationOut;                                    // 0x1E40(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DestinationIn;                                     // 0x1E58(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PreBurrowLoc;                                      // 0x1E70(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               PreBurrowRotation;                                 // 0x1E88(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Rabbit_C">();
	}
	static class ABP_Rabbit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Rabbit_C>();
	}
};
static_assert(alignof(ABP_Rabbit_C) == 0x000010, "Wrong alignment on ABP_Rabbit_C");
static_assert(sizeof(ABP_Rabbit_C) == 0x001EA0, "Wrong size on ABP_Rabbit_C");
static_assert(offsetof(ABP_Rabbit_C, bIsDigging) == 0x001E30, "Member 'ABP_Rabbit_C::bIsDigging' has a wrong offset!");
static_assert(offsetof(ABP_Rabbit_C, bIsDiggingOut) == 0x001E31, "Member 'ABP_Rabbit_C::bIsDiggingOut' has a wrong offset!");
static_assert(offsetof(ABP_Rabbit_C, Burrow_0) == 0x001E38, "Member 'ABP_Rabbit_C::Burrow_0' has a wrong offset!");
static_assert(offsetof(ABP_Rabbit_C, DestinationOut) == 0x001E40, "Member 'ABP_Rabbit_C::DestinationOut' has a wrong offset!");
static_assert(offsetof(ABP_Rabbit_C, DestinationIn) == 0x001E58, "Member 'ABP_Rabbit_C::DestinationIn' has a wrong offset!");
static_assert(offsetof(ABP_Rabbit_C, PreBurrowLoc) == 0x001E70, "Member 'ABP_Rabbit_C::PreBurrowLoc' has a wrong offset!");
static_assert(offsetof(ABP_Rabbit_C, PreBurrowRotation) == 0x001E88, "Member 'ABP_Rabbit_C::PreBurrowRotation' has a wrong offset!");

}

