#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SurvivalGameState

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SurvivalGameState.BP_SurvivalGameState_C.ExecuteUbergraph_BP_SurvivalGameState
// 0x0118 (0x0118 - 0x0000)
struct BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIAIWorldSpawner*                      CallFunc_GetActorOfClass_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class AActor* Character)> K2Node_CreateDelegate_OutputDelegate;             // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATICharacterBase*>               CallFunc_Set_ToArray_Result;                       // 0x0088(0x0010)(ReferenceParm)
	class ATICharacterBase*                       CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsAlive_ReturnValue;                   // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Remove_ReturnValue;                   // 0x00A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           K2Node_CustomEvent_Character;                      // 0x00A8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIFishSchool*                          K2Node_DynamicCast_AsTIFish_School;                // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATICharacterBase*                       K2Node_DynamicCast_AsThe_Isle_Character_Base;      // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        CallFunc_Set_ToArray_Result_1;                     // 0x00D8(0x0010)(ReferenceParm)
	class UObject*                                CallFunc_Array_Get_Item_1;                         // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Remove_ReturnValue_1;                 // 0x00F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F7[0x1];                                       // 0x00F7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetDevIDsAdvanced_ReturnValue;            // 0x0100(0x0010)(ReferenceParm)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState) == 0x000008, "Wrong alignment on BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState");
static_assert(sizeof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState) == 0x000118, "Wrong size on BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, EntryPoint) == 0x000000, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_GetActorOfClass_ReturnValue) == 0x000008, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, Temp_int_Variable) == 0x000018, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000040, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, Temp_int_Array_Index_Variable_1) == 0x000050, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_HasAuthority_ReturnValue) == 0x000054, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, K2Node_Event_DeltaSeconds) == 0x000058, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000060, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_Round_ReturnValue) == 0x000068, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_Add_IntInt_ReturnValue_1) == 0x00006C, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_Min_ReturnValue) == 0x000070, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_Conv_IntToByte_ReturnValue) == 0x000074, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, Temp_int_Loop_Counter_Variable_1) == 0x000078, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_Add_IntInt_ReturnValue_2) == 0x00007C, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_HasAuthority_ReturnValue_1) == 0x000080, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_Set_ToArray_Result) == 0x000088, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_Array_Get_Item) == 0x000098, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_IsValid_ReturnValue_1) == 0x0000A4, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_Less_IntInt_ReturnValue) == 0x0000A5, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_GetIsAlive_ReturnValue) == 0x0000A6, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_GetIsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_Set_Remove_ReturnValue) == 0x0000A7, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_Set_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, K2Node_CustomEvent_Character) == 0x0000A8, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::K2Node_CustomEvent_Character' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_Array_Length_ReturnValue_1) == 0x0000B0, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, K2Node_DynamicCast_AsTIFish_School) == 0x0000B8, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::K2Node_DynamicCast_AsTIFish_School' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, K2Node_DynamicCast_AsThe_Isle_Character_Base) == 0x0000C8, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::K2Node_DynamicCast_AsThe_Isle_Character_Base' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, Temp_int_Variable_1) == 0x0000D4, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_Set_ToArray_Result_1) == 0x0000D8, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_Set_ToArray_Result_1' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_Array_Get_Item_1) == 0x0000E8, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_Array_Length_ReturnValue_2) == 0x0000F0, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_IsValid_ReturnValue_2) == 0x0000F4, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000F5, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_Set_Remove_ReturnValue_1) == 0x0000F6, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_Set_Remove_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000F8, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_GetDevIDsAdvanced_ReturnValue) == 0x000100, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_GetDevIDsAdvanced_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000110, "Member 'BP_SurvivalGameState_C_ExecuteUbergraph_BP_SurvivalGameState::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function BP_SurvivalGameState.BP_SurvivalGameState_C.OnCharacterSpawned_Event
// 0x0008 (0x0008 - 0x0000)
struct BP_SurvivalGameState_C_OnCharacterSpawned_Event final
{
public:
	const class AActor*                           Character;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SurvivalGameState_C_OnCharacterSpawned_Event) == 0x000008, "Wrong alignment on BP_SurvivalGameState_C_OnCharacterSpawned_Event");
static_assert(sizeof(BP_SurvivalGameState_C_OnCharacterSpawned_Event) == 0x000008, "Wrong size on BP_SurvivalGameState_C_OnCharacterSpawned_Event");
static_assert(offsetof(BP_SurvivalGameState_C_OnCharacterSpawned_Event, Character) == 0x000000, "Member 'BP_SurvivalGameState_C_OnCharacterSpawned_Event::Character' has a wrong offset!");

// Function BP_SurvivalGameState.BP_SurvivalGameState_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SurvivalGameState_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SurvivalGameState_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SurvivalGameState_C_ReceiveTick");
static_assert(sizeof(BP_SurvivalGameState_C_ReceiveTick) == 0x000004, "Wrong size on BP_SurvivalGameState_C_ReceiveTick");
static_assert(offsetof(BP_SurvivalGameState_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SurvivalGameState_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

