#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SurvivalGameState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SurvivalGameState.BP_SurvivalGameState_C
// 0x0068 (0x0408 - 0x03A0)
class ABP_SurvivalGameState_C final : public ATISurvivalGameState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         AIStasis;                                          // 0x03B0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ServerPlayerAmount;                                // 0x03B4(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSet<class UObject*>                          AllAIFishSchools;                                  // 0x03B8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_SurvivalGameState(int32 EntryPoint);
	void GetAIControllerCounts();
	void OnCharacterSpawned_Event(const class AActor* Character);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SurvivalGameState_C">();
	}
	static class ABP_SurvivalGameState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SurvivalGameState_C>();
	}
};
static_assert(alignof(ABP_SurvivalGameState_C) == 0x000008, "Wrong alignment on ABP_SurvivalGameState_C");
static_assert(sizeof(ABP_SurvivalGameState_C) == 0x000408, "Wrong size on ABP_SurvivalGameState_C");
static_assert(offsetof(ABP_SurvivalGameState_C, UberGraphFrame) == 0x0003A0, "Member 'ABP_SurvivalGameState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SurvivalGameState_C, DefaultSceneRoot) == 0x0003A8, "Member 'ABP_SurvivalGameState_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_SurvivalGameState_C, AIStasis) == 0x0003B0, "Member 'ABP_SurvivalGameState_C::AIStasis' has a wrong offset!");
static_assert(offsetof(ABP_SurvivalGameState_C, ServerPlayerAmount) == 0x0003B4, "Member 'ABP_SurvivalGameState_C::ServerPlayerAmount' has a wrong offset!");
static_assert(offsetof(ABP_SurvivalGameState_C, AllAIFishSchools) == 0x0003B8, "Member 'ABP_SurvivalGameState_C::AllAIFishSchools' has a wrong offset!");

}

