#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SwallowActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TheIsle_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SwallowActor.BP_SwallowActor_C
// 0x0060 (0x0330 - 0x02D0)
class ABP_SwallowActor_C final : public ATISwallowedActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         GalliSwallowPlantNormal_Alpha_60E8FBF54E8D1723FD72FAAD63782953; // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            GalliSwallowPlantNormal__Direction_60E8FBF54E8D1723FD72FAAD63782953; // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E5[0x3];                                      // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     GalliSwallowPlantNormal;                           // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         GalliSwallowCorpseNormal_Alpha_843017274E8D9B4B14FCA98C3B5FE7F5; // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            GalliSwallowCorpseNormal__Direction_843017274E8D9B4B14FCA98C3B5FE7F5; // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     GalliSwallowCorpseNormal;                          // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         GalliSwallowCorpseHands_Alpha_316726CE4D65ABED4B29F4B8A11BD284; // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            GalliSwallowCorpseHands__Direction_316726CE4D65ABED4B29F4B8A11BD284; // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     GalliSwallowCorpseHands;                           // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ATIGallimimus*                          InstigatorActorGalli;                              // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ATICharacterBase*                       DraggedActor;                                      // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ATIGoreBase*                            GoreTarget;                                        // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         TimelineAlpha;                                     // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SwallowActor(int32 EntryPoint);
	void GalliMainExecute();
	void GalliSwallowCorpseHands__FinishedFunc();
	void GalliSwallowCorpseHands__UpdateFunc();
	void GalliSwallowCorpseNormal__FinishedFunc();
	void GalliSwallowCorpseNormal__UpdateFunc();
	void GalliSwallowPlantNormal__FinishedFunc();
	void GalliSwallowPlantNormal__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SwallowActor_C">();
	}
	static class ABP_SwallowActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SwallowActor_C>();
	}
};
static_assert(alignof(ABP_SwallowActor_C) == 0x000008, "Wrong alignment on ABP_SwallowActor_C");
static_assert(sizeof(ABP_SwallowActor_C) == 0x000330, "Wrong size on ABP_SwallowActor_C");
static_assert(offsetof(ABP_SwallowActor_C, UberGraphFrame) == 0x0002D0, "Member 'ABP_SwallowActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SwallowActor_C, DefaultSceneRoot) == 0x0002D8, "Member 'ABP_SwallowActor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_SwallowActor_C, GalliSwallowPlantNormal_Alpha_60E8FBF54E8D1723FD72FAAD63782953) == 0x0002E0, "Member 'ABP_SwallowActor_C::GalliSwallowPlantNormal_Alpha_60E8FBF54E8D1723FD72FAAD63782953' has a wrong offset!");
static_assert(offsetof(ABP_SwallowActor_C, GalliSwallowPlantNormal__Direction_60E8FBF54E8D1723FD72FAAD63782953) == 0x0002E4, "Member 'ABP_SwallowActor_C::GalliSwallowPlantNormal__Direction_60E8FBF54E8D1723FD72FAAD63782953' has a wrong offset!");
static_assert(offsetof(ABP_SwallowActor_C, GalliSwallowPlantNormal) == 0x0002E8, "Member 'ABP_SwallowActor_C::GalliSwallowPlantNormal' has a wrong offset!");
static_assert(offsetof(ABP_SwallowActor_C, GalliSwallowCorpseNormal_Alpha_843017274E8D9B4B14FCA98C3B5FE7F5) == 0x0002F0, "Member 'ABP_SwallowActor_C::GalliSwallowCorpseNormal_Alpha_843017274E8D9B4B14FCA98C3B5FE7F5' has a wrong offset!");
static_assert(offsetof(ABP_SwallowActor_C, GalliSwallowCorpseNormal__Direction_843017274E8D9B4B14FCA98C3B5FE7F5) == 0x0002F4, "Member 'ABP_SwallowActor_C::GalliSwallowCorpseNormal__Direction_843017274E8D9B4B14FCA98C3B5FE7F5' has a wrong offset!");
static_assert(offsetof(ABP_SwallowActor_C, GalliSwallowCorpseNormal) == 0x0002F8, "Member 'ABP_SwallowActor_C::GalliSwallowCorpseNormal' has a wrong offset!");
static_assert(offsetof(ABP_SwallowActor_C, GalliSwallowCorpseHands_Alpha_316726CE4D65ABED4B29F4B8A11BD284) == 0x000300, "Member 'ABP_SwallowActor_C::GalliSwallowCorpseHands_Alpha_316726CE4D65ABED4B29F4B8A11BD284' has a wrong offset!");
static_assert(offsetof(ABP_SwallowActor_C, GalliSwallowCorpseHands__Direction_316726CE4D65ABED4B29F4B8A11BD284) == 0x000304, "Member 'ABP_SwallowActor_C::GalliSwallowCorpseHands__Direction_316726CE4D65ABED4B29F4B8A11BD284' has a wrong offset!");
static_assert(offsetof(ABP_SwallowActor_C, GalliSwallowCorpseHands) == 0x000308, "Member 'ABP_SwallowActor_C::GalliSwallowCorpseHands' has a wrong offset!");
static_assert(offsetof(ABP_SwallowActor_C, InstigatorActorGalli) == 0x000310, "Member 'ABP_SwallowActor_C::InstigatorActorGalli' has a wrong offset!");
static_assert(offsetof(ABP_SwallowActor_C, DraggedActor) == 0x000318, "Member 'ABP_SwallowActor_C::DraggedActor' has a wrong offset!");
static_assert(offsetof(ABP_SwallowActor_C, GoreTarget) == 0x000320, "Member 'ABP_SwallowActor_C::GoreTarget' has a wrong offset!");
static_assert(offsetof(ABP_SwallowActor_C, TimelineAlpha) == 0x000328, "Member 'ABP_SwallowActor_C::TimelineAlpha' has a wrong offset!");

}

