#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SurvivalGameMode

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "TheIsle_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_SurvivalGameMode.BP_SurvivalGameMode_C.CallAdminCredentialDelegates
// 0x0010 (0x0010 - 0x0000)
struct BP_SurvivalGameMode_C_CallAdminCredentialDelegates final
{
public:
	class ATIPlayerController*                    PC;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bOwnerPanel;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAdminRequests;                                    // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECredentialType                               Temp_byte_Variable;                                // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAdmin_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECredentialType                               Temp_byte_Variable_1;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECredentialType                               K2Node_Select_Default;                             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SurvivalGameMode_C_CallAdminCredentialDelegates) == 0x000008, "Wrong alignment on BP_SurvivalGameMode_C_CallAdminCredentialDelegates");
static_assert(sizeof(BP_SurvivalGameMode_C_CallAdminCredentialDelegates) == 0x000010, "Wrong size on BP_SurvivalGameMode_C_CallAdminCredentialDelegates");
static_assert(offsetof(BP_SurvivalGameMode_C_CallAdminCredentialDelegates, PC) == 0x000000, "Member 'BP_SurvivalGameMode_C_CallAdminCredentialDelegates::PC' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallAdminCredentialDelegates, bOwnerPanel) == 0x000008, "Member 'BP_SurvivalGameMode_C_CallAdminCredentialDelegates::bOwnerPanel' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallAdminCredentialDelegates, bAdminRequests) == 0x000009, "Member 'BP_SurvivalGameMode_C_CallAdminCredentialDelegates::bAdminRequests' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallAdminCredentialDelegates, Temp_bool_Variable) == 0x00000A, "Member 'BP_SurvivalGameMode_C_CallAdminCredentialDelegates::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallAdminCredentialDelegates, Temp_byte_Variable) == 0x00000B, "Member 'BP_SurvivalGameMode_C_CallAdminCredentialDelegates::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallAdminCredentialDelegates, CallFunc_IsAdmin_ReturnValue) == 0x00000C, "Member 'BP_SurvivalGameMode_C_CallAdminCredentialDelegates::CallFunc_IsAdmin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallAdminCredentialDelegates, Temp_byte_Variable_1) == 0x00000D, "Member 'BP_SurvivalGameMode_C_CallAdminCredentialDelegates::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallAdminCredentialDelegates, K2Node_Select_Default) == 0x00000E, "Member 'BP_SurvivalGameMode_C_CallAdminCredentialDelegates::K2Node_Select_Default' has a wrong offset!");

// Function BP_SurvivalGameMode.BP_SurvivalGameMode_C.CallAdminOrDevCredentialDelegates
// 0x0010 (0x0010 - 0x0000)
struct BP_SurvivalGameMode_C_CallAdminOrDevCredentialDelegates final
{
public:
	class ATIPlayerController*                    PC;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bOwnerPanel;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAdminRequests;                                    // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalDevOrAdmin;                                   // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECredentialType                               Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDevOrAdmin_ReturnValue;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECredentialType                               Temp_byte_Variable_1;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECredentialType                               K2Node_Select_Default;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SurvivalGameMode_C_CallAdminOrDevCredentialDelegates) == 0x000008, "Wrong alignment on BP_SurvivalGameMode_C_CallAdminOrDevCredentialDelegates");
static_assert(sizeof(BP_SurvivalGameMode_C_CallAdminOrDevCredentialDelegates) == 0x000010, "Wrong size on BP_SurvivalGameMode_C_CallAdminOrDevCredentialDelegates");
static_assert(offsetof(BP_SurvivalGameMode_C_CallAdminOrDevCredentialDelegates, PC) == 0x000000, "Member 'BP_SurvivalGameMode_C_CallAdminOrDevCredentialDelegates::PC' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallAdminOrDevCredentialDelegates, bOwnerPanel) == 0x000008, "Member 'BP_SurvivalGameMode_C_CallAdminOrDevCredentialDelegates::bOwnerPanel' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallAdminOrDevCredentialDelegates, bAdminRequests) == 0x000009, "Member 'BP_SurvivalGameMode_C_CallAdminOrDevCredentialDelegates::bAdminRequests' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallAdminOrDevCredentialDelegates, LocalDevOrAdmin) == 0x00000A, "Member 'BP_SurvivalGameMode_C_CallAdminOrDevCredentialDelegates::LocalDevOrAdmin' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallAdminOrDevCredentialDelegates, Temp_bool_Variable) == 0x00000B, "Member 'BP_SurvivalGameMode_C_CallAdminOrDevCredentialDelegates::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallAdminOrDevCredentialDelegates, Temp_byte_Variable) == 0x00000C, "Member 'BP_SurvivalGameMode_C_CallAdminOrDevCredentialDelegates::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallAdminOrDevCredentialDelegates, CallFunc_IsDevOrAdmin_ReturnValue) == 0x00000D, "Member 'BP_SurvivalGameMode_C_CallAdminOrDevCredentialDelegates::CallFunc_IsDevOrAdmin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallAdminOrDevCredentialDelegates, Temp_byte_Variable_1) == 0x00000E, "Member 'BP_SurvivalGameMode_C_CallAdminOrDevCredentialDelegates::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallAdminOrDevCredentialDelegates, K2Node_Select_Default) == 0x00000F, "Member 'BP_SurvivalGameMode_C_CallAdminOrDevCredentialDelegates::K2Node_Select_Default' has a wrong offset!");

// Function BP_SurvivalGameMode.BP_SurvivalGameMode_C.CallDevCredentialDelegates
// 0x0018 (0x0018 - 0x0000)
struct BP_SurvivalGameMode_C_CallDevCredentialDelegates final
{
public:
	class ATIPlayerController*                    PC;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bOwnerPanel;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAdminRequests;                                    // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalDev;                                          // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalAdmin;                                        // 0x000B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECredentialType                               Temp_byte_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECredentialType                               Temp_byte_Variable_1;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDeveloper_ReturnValue;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECredentialType                               K2Node_Select_Default;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SurvivalGameMode_C_CallDevCredentialDelegates) == 0x000008, "Wrong alignment on BP_SurvivalGameMode_C_CallDevCredentialDelegates");
static_assert(sizeof(BP_SurvivalGameMode_C_CallDevCredentialDelegates) == 0x000018, "Wrong size on BP_SurvivalGameMode_C_CallDevCredentialDelegates");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates, PC) == 0x000000, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates::PC' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates, bOwnerPanel) == 0x000008, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates::bOwnerPanel' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates, bAdminRequests) == 0x000009, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates::bAdminRequests' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates, LocalDev) == 0x00000A, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates::LocalDev' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates, LocalAdmin) == 0x00000B, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates::LocalAdmin' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates, Temp_byte_Variable) == 0x00000C, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates, Temp_byte_Variable_1) == 0x00000D, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates, CallFunc_IsDeveloper_ReturnValue) == 0x00000E, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates::CallFunc_IsDeveloper_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates, Temp_bool_Variable) == 0x00000F, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates, K2Node_Select_Default) == 0x000010, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates::K2Node_Select_Default' has a wrong offset!");

// Function BP_SurvivalGameMode.BP_SurvivalGameMode_C.CallDevCredentialDelegates_SpecialDinos
// 0x0070 (0x0070 - 0x0000)
struct BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos final
{
public:
	class ABP_PlayerController_C*                 PC;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalAdmin;                                        // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalDev;                                          // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECredentialType                               Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECredentialType                               Temp_byte_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECredentialType                               K2Node_Select_Default;                             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_SurvivalGameState_C*                K2Node_DynamicCast_AsBP_Survival_Game_State;       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetDevIDsAdvanced_ReturnValue;            // 0x0040(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos) == 0x000008, "Wrong alignment on BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos");
static_assert(sizeof(BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos) == 0x000070, "Wrong size on BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos, PC) == 0x000000, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos::PC' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos, LocalAdmin) == 0x000008, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos::LocalAdmin' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos, LocalDev) == 0x000009, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos::LocalDev' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos, Temp_byte_Variable) == 0x00000A, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos, Temp_byte_Variable_1) == 0x00000B, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos, Temp_bool_True_if_break_was_hit_Variable) == 0x00000C, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos, CallFunc_Not_PreBool_ReturnValue) == 0x000014, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos, Temp_bool_Variable) == 0x00001C, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos, K2Node_Select_Default) == 0x000024, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos, CallFunc_GetGameState_ReturnValue) == 0x000028, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos, K2Node_DynamicCast_AsBP_Survival_Game_State) == 0x000030, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos::K2Node_DynamicCast_AsBP_Survival_Game_State' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos, CallFunc_GetDevIDsAdvanced_ReturnValue) == 0x000040, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos::CallFunc_GetDevIDsAdvanced_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000069, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos, CallFunc_BooleanAND_ReturnValue) == 0x00006A, "Member 'BP_SurvivalGameMode_C_CallDevCredentialDelegates_SpecialDinos::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_SurvivalGameMode.BP_SurvivalGameMode_C.CheckPlayerPermissions
// 0x0010 (0x0010 - 0x0000)
struct BP_SurvivalGameMode_C_CheckPlayerPermissions final
{
public:
	class ATIPlayerController*                    Controller;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECredentialType                               Credential;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsOwnerPanel;                                     // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsAdminRequest;                                   // 0x000A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SurvivalGameMode_C_CheckPlayerPermissions) == 0x000008, "Wrong alignment on BP_SurvivalGameMode_C_CheckPlayerPermissions");
static_assert(sizeof(BP_SurvivalGameMode_C_CheckPlayerPermissions) == 0x000010, "Wrong size on BP_SurvivalGameMode_C_CheckPlayerPermissions");
static_assert(offsetof(BP_SurvivalGameMode_C_CheckPlayerPermissions, Controller) == 0x000000, "Member 'BP_SurvivalGameMode_C_CheckPlayerPermissions::Controller' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CheckPlayerPermissions, Credential) == 0x000008, "Member 'BP_SurvivalGameMode_C_CheckPlayerPermissions::Credential' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CheckPlayerPermissions, bIsOwnerPanel) == 0x000009, "Member 'BP_SurvivalGameMode_C_CheckPlayerPermissions::bIsOwnerPanel' has a wrong offset!");
static_assert(offsetof(BP_SurvivalGameMode_C_CheckPlayerPermissions, bIsAdminRequest) == 0x00000A, "Member 'BP_SurvivalGameMode_C_CheckPlayerPermissions::bIsAdminRequest' has a wrong offset!");

// Function BP_SurvivalGameMode.BP_SurvivalGameMode_C.EventServerCheckPlayerDev
// 0x0008 (0x0008 - 0x0000)
struct BP_SurvivalGameMode_C_EventServerCheckPlayerDev final
{
public:
	class ABP_PlayerController_C*                 PlayerController;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SurvivalGameMode_C_EventServerCheckPlayerDev) == 0x000008, "Wrong alignment on BP_SurvivalGameMode_C_EventServerCheckPlayerDev");
static_assert(sizeof(BP_SurvivalGameMode_C_EventServerCheckPlayerDev) == 0x000008, "Wrong size on BP_SurvivalGameMode_C_EventServerCheckPlayerDev");
static_assert(offsetof(BP_SurvivalGameMode_C_EventServerCheckPlayerDev, PlayerController) == 0x000000, "Member 'BP_SurvivalGameMode_C_EventServerCheckPlayerDev::PlayerController' has a wrong offset!");

// Function BP_SurvivalGameMode.BP_SurvivalGameMode_C.ExecuteUbergraph_BP_SurvivalGameMode
// 0x08C8 (0x08C8 - 0x0000)
struct BP_SurvivalGameMode_C_ExecuteUbergraph_BP_SurvivalGameMode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_Event_NewPlayer;                            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_ExitingController;                    // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerController_C*                 K2Node_DynamicCast_AsBP_Player_Controller;         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIPlayerController*                    K2Node_DynamicCast_AsThe_Isle_Player_Controller;   // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue_1;              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ATIDinosaurBase*                        K2Node_DynamicCast_AsThe_Isle_Dinosaur_Base;       // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ServerSavePlayersStatus_C*          CallFunc_CreateSaveGameObject_ReturnValue;         // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x00D0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_Map_Keys_Keys_1;                          // 0x00F0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIPlayerController*                    K2Node_Event_PlayerController;                     // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class APlayerController*                K2Node_CustomEvent_PC;                             // 0x0110(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerController_C*                 K2Node_DynamicCast_AsBP_Player_Controller_1;       // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Remove_ReturnValue;                   // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ATIPlayerController*>            CallFunc_Set_ToArray_Result;                       // 0x0128(0x0010)(ReferenceParm)
	class FString                                 K2Node_CustomEvent_PlayerSteamId;                  // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_PlayerName;                     // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_PlayerController_C*                 K2Node_CustomEvent_AdminController;                // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATIPlayerController*                    CallFunc_Array_Get_Item;                           // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDevOrAdmin_ReturnValue;                 // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue_2;              // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerName_ReturnValue_3;              // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19B[0x5];                                      // 0x019B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AUltra_Dynamic_Sky_C*                   CallFunc_GetActorOfClass_ReturnValue;              // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AUltra_Dynamic_Sky_C*                   CallFunc_GetActorOfClass_ReturnValue_1;            // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item_1;                         // 0x01B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Find_Value;                           // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_FlowmapRiverSystem_C*>       CallFunc_GetAllActorsOfClass_OutActors;            // 0x01D8(0x0010)(ReferenceParm)
	TArray<class ABP_AquaticSurface_C*>           CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x01E8(0x0010)(ReferenceParm)
	class ABP_FlowmapRiverSystem_C*               CallFunc_Array_Get_Item_2;                         // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0208(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_bIsEditor_ReturnValue;                    // 0x020D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20E[0x2];                                      // 0x020E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AUltra_Dynamic_Weather_C*               CallFunc_GetActorOfClass_ReturnValue_2;            // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AUltra_Dynamic_Sky_C*                   CallFunc_GetActorOfClass_ReturnValue_3;            // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerController_C*                 K2Node_DynamicCast_AsBP_Player_Controller_2;       // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIDinosaurBase*                        K2Node_DynamicCast_AsThe_Isle_Dinosaur_Base_1;     // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGroupID_ReturnValue;                   // 0x0244(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Remove_ReturnValue_1;                 // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_bIsEditor_ReturnValue_1;                  // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_bIsEditor_ReturnValue_2;                  // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_bIsEditor_ReturnValue_3;                  // 0x0253(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_bIsEditor_ReturnValue_4;                  // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_bIsEditor_ReturnValue_5;                  // 0x0255(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_bIsEditor_ReturnValue_6;                  // 0x0256(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0257(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AUltra_Dynamic_Weather_C*               CallFunc_GetActorOfClass_ReturnValue_4;            // 0x0258(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_262[0x6];                                      // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year;                       // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month;                      // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day;                        // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour;                       // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute;                     // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second;                     // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond;                // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0290(0x0010)(ConstParm, ReferenceParm)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x02B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ABP_AquaticSurface_C*                   CallFunc_Array_Get_Item_3;                         // 0x02D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_bIsEditor_ReturnValue_7;                  // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x02F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATIPlayerController*                    K2Node_Event_AdminController_6;                    // 0x0330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Time;                                 // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIPlayerController*                    K2Node_Event_AdminController_5;                    // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDevOrAdmin_ReturnValue_1;               // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue_4;              // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDevOrAdmin_ReturnValue_2;               // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_362[0x6];                                      // 0x0362(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue_5;              // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIPlayerController*                    K2Node_Event_AdminController_4;                    // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsDay;                               // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Brightness;                           // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_Event_Controller_3;                         // 0x0390(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDevOrAdmin_ReturnValue_3;               // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue_6;              // 0x03A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIPlayerController*                    K2Node_Event_AdminController_3;                    // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EWaterLevel                                   K2Node_Event_WaterLevel;                           // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bComesFromServer;                     // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x03C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x03C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C5[0x3];                                      // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIPlayerController*                    K2Node_Event_AdminController_2;                    // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_Weather;                              // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_Controller_2;                         // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSafeLog;                             // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bFromMenu;                            // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E2[0x6];                                      // 0x03E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUDS_Weather_Settings_C*                K2Node_DynamicCast_AsUDS_Weather_Settings;         // 0x03E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue_7;              // 0x03F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
