#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpectatorName

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SpectatorName.BP_SpectatorName_C
// 0x0030 (0x0348 - 0x0318)
class ABP_SpectatorName_C final : public ATISpectatorName
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       Widget;                                            // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWBP_SpecPlayersNames_C*                SpecNameWidgetRef;                                 // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FString                                 LocalActorName;                                    // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BPForceUpdateSpectatorInfo();
	void ExecuteUbergraph_BP_SpectatorName(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SpectatorName_C">();
	}
	static class ABP_SpectatorName_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SpectatorName_C>();
	}
};
static_assert(alignof(ABP_SpectatorName_C) == 0x000008, "Wrong alignment on ABP_SpectatorName_C");
static_assert(sizeof(ABP_SpectatorName_C) == 0x000348, "Wrong size on ABP_SpectatorName_C");
static_assert(offsetof(ABP_SpectatorName_C, UberGraphFrame) == 0x000318, "Member 'ABP_SpectatorName_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SpectatorName_C, Widget) == 0x000320, "Member 'ABP_SpectatorName_C::Widget' has a wrong offset!");
static_assert(offsetof(ABP_SpectatorName_C, DefaultSceneRoot) == 0x000328, "Member 'ABP_SpectatorName_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_SpectatorName_C, SpecNameWidgetRef) == 0x000330, "Member 'ABP_SpectatorName_C::SpecNameWidgetRef' has a wrong offset!");
static_assert(offsetof(ABP_SpectatorName_C, LocalActorName) == 0x000338, "Member 'ABP_SpectatorName_C::LocalActorName' has a wrong offset!");

}

