#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SpectatorName

#include "Basic.hpp"

#include "TheIsle_structs.hpp"


namespace SDK::Params
{

// Function BP_SpectatorName.BP_SpectatorName_C.ExecuteUbergraph_BP_SpectatorName
// 0x01C8 (0x01C8 - 0x0000)
struct BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ReplaceInline_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0010)()
	class UWBP_SpecPlayersNames_C*                K2Node_DynamicCast_AsWBP_Spec_Players_Names;       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpectatorData                         CallFunc_GetSpectatorInfo_ReturnValue;             // 0x0038(0x0088)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00C0(0x0010)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x00D0(0x0010)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x00E0(0x0010)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_2;          // 0x00F0(0x0010)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_3;          // 0x0100(0x0010)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_4;          // 0x0110(0x0010)()
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_5;          // 0x0128(0x0010)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_6;          // 0x0138(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0148(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0158(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0168(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_5;          // 0x0178(0x0010)()
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast_1;   // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast_2;   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast_3;   // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast_4;   // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast_5;   // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast_6;   // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName) == 0x000008, "Wrong alignment on BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName");
static_assert(sizeof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName) == 0x0001C8, "Wrong size on BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, EntryPoint) == 0x000000, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_ReplaceInline_ReturnValue) == 0x000004, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_ReplaceInline_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000010, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, K2Node_DynamicCast_AsWBP_Spec_Players_Names) == 0x000028, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::K2Node_DynamicCast_AsWBP_Spec_Players_Names' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_GetSpectatorInfo_ReturnValue) == 0x000038, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_GetSpectatorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000C0, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_Conv_DoubleToText_ReturnValue) == 0x0000D0, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_Conv_DoubleToText_ReturnValue_1) == 0x0000E0, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_Conv_DoubleToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_Conv_DoubleToText_ReturnValue_2) == 0x0000F0, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_Conv_DoubleToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_Conv_DoubleToText_ReturnValue_3) == 0x000100, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_Conv_DoubleToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_Conv_DoubleToText_ReturnValue_4) == 0x000110, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_Conv_DoubleToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000120, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_Conv_DoubleToText_ReturnValue_5) == 0x000128, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_Conv_DoubleToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_Conv_DoubleToText_ReturnValue_6) == 0x000138, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_Conv_DoubleToText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000148, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000158, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_Conv_StringToText_ReturnValue_4) == 0x000168, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_Conv_StringToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_Conv_StringToText_ReturnValue_5) == 0x000178, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_Conv_StringToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x000188, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_Conv_DoubleToText_Value_ImplicitCast_1) == 0x000190, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_Conv_DoubleToText_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x000198, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_Conv_DoubleToText_Value_ImplicitCast_2) == 0x0001A0, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_Conv_DoubleToText_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_Conv_DoubleToText_Value_ImplicitCast_3) == 0x0001A8, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_Conv_DoubleToText_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_Conv_DoubleToText_Value_ImplicitCast_4) == 0x0001B0, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_Conv_DoubleToText_Value_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_Conv_DoubleToText_Value_ImplicitCast_5) == 0x0001B8, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_Conv_DoubleToText_Value_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName, CallFunc_Conv_DoubleToText_Value_ImplicitCast_6) == 0x0001C0, "Member 'BP_SpectatorName_C_ExecuteUbergraph_BP_SpectatorName::CallFunc_Conv_DoubleToText_Value_ImplicitCast_6' has a wrong offset!");

}

