#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SchoolFishGore_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SchoolFishGore_Base.BP_SchoolFishGore_Base_C.ExecuteUbergraph_BP_SchoolFishGore_Base
// 0x0020 (0x0020 - 0x0000)
struct BP_SchoolFishGore_Base_C_ExecuteUbergraph_BP_SchoolFishGore_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SchoolFishGore_Base_C_ExecuteUbergraph_BP_SchoolFishGore_Base) == 0x000008, "Wrong alignment on BP_SchoolFishGore_Base_C_ExecuteUbergraph_BP_SchoolFishGore_Base");
static_assert(sizeof(BP_SchoolFishGore_Base_C_ExecuteUbergraph_BP_SchoolFishGore_Base) == 0x000020, "Wrong size on BP_SchoolFishGore_Base_C_ExecuteUbergraph_BP_SchoolFishGore_Base");
static_assert(offsetof(BP_SchoolFishGore_Base_C_ExecuteUbergraph_BP_SchoolFishGore_Base, EntryPoint) == 0x000000, "Member 'BP_SchoolFishGore_Base_C_ExecuteUbergraph_BP_SchoolFishGore_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SchoolFishGore_Base_C_ExecuteUbergraph_BP_SchoolFishGore_Base, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_SchoolFishGore_Base_C_ExecuteUbergraph_BP_SchoolFishGore_Base::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SchoolFishGore_Base_C_ExecuteUbergraph_BP_SchoolFishGore_Base, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_SchoolFishGore_Base_C_ExecuteUbergraph_BP_SchoolFishGore_Base::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

// Function BP_SchoolFishGore_Base.BP_SchoolFishGore_Base_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SchoolFishGore_Base_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SchoolFishGore_Base_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SchoolFishGore_Base_C_ReceiveTick");
static_assert(sizeof(BP_SchoolFishGore_Base_C_ReceiveTick) == 0x000004, "Wrong size on BP_SchoolFishGore_Base_C_ReceiveTick");
static_assert(offsetof(BP_SchoolFishGore_Base_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SchoolFishGore_Base_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

