#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SaltLickActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SaltLickActor.BP_SaltLickActor_C
// 0x0020 (0x02B8 - 0x0298)
class ABP_SaltLickActor_C final : public ATIInteractableActorBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       ScentSphere;                                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SaltLickActor(int32 EntryPoint);
	struct FVector GetScentLocation();
	void HideScentEffects(class ATIDinosaurBase* Scenter, bool bScentFinished);
	bool IsCorpse();
	bool IsScentableFootprint();
	void ReceiveBeginPlay();
	void ShowScentEffects(class ATIDinosaurBase* Scenter, bool bScentStarted);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SaltLickActor_C">();
	}
	static class ABP_SaltLickActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SaltLickActor_C>();
	}
};
static_assert(alignof(ABP_SaltLickActor_C) == 0x000008, "Wrong alignment on ABP_SaltLickActor_C");
static_assert(sizeof(ABP_SaltLickActor_C) == 0x0002B8, "Wrong size on ABP_SaltLickActor_C");
static_assert(offsetof(ABP_SaltLickActor_C, UberGraphFrame) == 0x000298, "Member 'ABP_SaltLickActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SaltLickActor_C, ScentSphere) == 0x0002A0, "Member 'ABP_SaltLickActor_C::ScentSphere' has a wrong offset!");
static_assert(offsetof(ABP_SaltLickActor_C, StaticMesh) == 0x0002A8, "Member 'ABP_SaltLickActor_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_SaltLickActor_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_SaltLickActor_C::DefaultSceneRoot' has a wrong offset!");

}

