#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TitleGameMode

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_TitleGameMode.BP_TitleGameMode_C.ExecuteUbergraph_BP_TitleGameMode
// 0x0018 (0x0018 - 0x0000)
struct BP_TitleGameMode_C_ExecuteUbergraph_BP_TitleGameMode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_Event_NewPlayer;                            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Title_C*                           CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TitleGameMode_C_ExecuteUbergraph_BP_TitleGameMode) == 0x000008, "Wrong alignment on BP_TitleGameMode_C_ExecuteUbergraph_BP_TitleGameMode");
static_assert(sizeof(BP_TitleGameMode_C_ExecuteUbergraph_BP_TitleGameMode) == 0x000018, "Wrong size on BP_TitleGameMode_C_ExecuteUbergraph_BP_TitleGameMode");
static_assert(offsetof(BP_TitleGameMode_C_ExecuteUbergraph_BP_TitleGameMode, EntryPoint) == 0x000000, "Member 'BP_TitleGameMode_C_ExecuteUbergraph_BP_TitleGameMode::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TitleGameMode_C_ExecuteUbergraph_BP_TitleGameMode, K2Node_Event_NewPlayer) == 0x000008, "Member 'BP_TitleGameMode_C_ExecuteUbergraph_BP_TitleGameMode::K2Node_Event_NewPlayer' has a wrong offset!");
static_assert(offsetof(BP_TitleGameMode_C_ExecuteUbergraph_BP_TitleGameMode, CallFunc_Create_ReturnValue) == 0x000010, "Member 'BP_TitleGameMode_C_ExecuteUbergraph_BP_TitleGameMode::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function BP_TitleGameMode.BP_TitleGameMode_C.K2_PostLogin
// 0x0008 (0x0008 - 0x0000)
struct BP_TitleGameMode_C_K2_PostLogin final
{
public:
	class APlayerController*                      NewPlayer;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TitleGameMode_C_K2_PostLogin) == 0x000008, "Wrong alignment on BP_TitleGameMode_C_K2_PostLogin");
static_assert(sizeof(BP_TitleGameMode_C_K2_PostLogin) == 0x000008, "Wrong size on BP_TitleGameMode_C_K2_PostLogin");
static_assert(offsetof(BP_TitleGameMode_C_K2_PostLogin, NewPlayer) == 0x000000, "Member 'BP_TitleGameMode_C_K2_PostLogin::NewPlayer' has a wrong offset!");

}

