#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UMG_ReplayWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TheIsle_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UMG_ReplayWidget.BP_UMG_ReplayWidget_C
// 0x0168 (0x0448 - 0x02E0)
class UBP_UMG_ReplayWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MinimizeButtonFade;                                // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Exit;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_FastForward;                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Minimize;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Player;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_PlayPause;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Rewind;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_SpeedDecrease;                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_SpeedIncrease;                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Stop;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                FocusButton;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_219;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PlayPause;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_TimeScrub;                                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MiniHov;                                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Panel_Main;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayrateBG;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_Duration;                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_CurrentDuration;                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Focus;                                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PlayRate;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_State;                                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_TotalDuration;                                // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_253;                                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Toggle_IDs;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ReplayPaused;                                      // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ReplayPlayRate;                                    // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           UpdateTimerHandle;                                 // 0x03C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerIndex;                                       // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        MaxDistance;                                       // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATICharacterBase*                       CloseCharacter;                                    // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   CharacterText;                                     // 0x03E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class ATICharacterBase*>               CurrentPlayers;                                    // 0x03F8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FTimerHandle                           RealUpdateTimeHandle;                              // 0x0408(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowUserNames;                                    // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_SpectatorName_C*>            NameActors;                                        // 0x0418(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<struct FTIReplayEvent>                 DeathEvents;                                       // 0x0428(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FTIReplayEvent>                 DamageEvents;                                      // 0x0438(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__BP_UMG_ReplayWidget_FocusButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__BP_UMG_ReplayWidget_Toggle_IDs_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_Exit_K2Node_ComponentBoundEvent_70_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_FastForward_K2Node_ComponentBoundEvent_66_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_Minimize_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_Player_K2Node_ComponentBoundEvent_40_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_PlayPause_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_PlayPause_K2Node_ComponentBoundEvent_86_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_PlayPause_K2Node_ComponentBoundEvent_94_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_Rewind_K2Node_ComponentBoundEvent_90_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_SpeedDecrease_K2Node_ComponentBoundEvent_218_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_SpeedIncrease_K2Node_ComponentBoundEvent_240_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_Stop_K2Node_ComponentBoundEvent_143_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MiniHov_K2Node_ComponentBoundEvent_843_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__MiniHov_K2Node_ComponentBoundEvent_867_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_BP_UMG_ReplayWidget(int32 EntryPoint);
	void GoToReplayTimeInPercent(double Percent);
	void GotoReplayTimeInSeconds(double Seconds);
	void MultithreadedFunctionExecute();
	void OnFailure_28BAA70F43E09E426D558BB1F52C9E5A();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnSuccess_28BAA70F43E09E426D558BB1F52C9E5A();
	void RefreshFromTimeScrub();
	void ReplayEvents(const TArray<struct FTIReplayEvent>& Events);
	void RetoggleIDS();
	void SelectNextPlayer();
	void SetPlayRate(double Play_Rate);
	void SetReplayPaused(bool Paused);
	void SetTimeLabel(double Input_Seconds, class UTextBlock* Text_Widget);
	void StartPlayerListUpdater();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	struct FEventReply TimeScrub_Clicked(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent);
	void Update();
	void UpdateClosePlayer();
	void UpdatePlayerList();
	void UpdatePlayers();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UMG_ReplayWidget_C">();
	}
	static class UBP_UMG_ReplayWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UMG_ReplayWidget_C>();
	}
};
static_assert(alignof(UBP_UMG_ReplayWidget_C) == 0x000008, "Wrong alignment on UBP_UMG_ReplayWidget_C");
static_assert(sizeof(UBP_UMG_ReplayWidget_C) == 0x000448, "Wrong size on UBP_UMG_ReplayWidget_C");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, UberGraphFrame) == 0x0002E0, "Member 'UBP_UMG_ReplayWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, MinimizeButtonFade) == 0x0002E8, "Member 'UBP_UMG_ReplayWidget_C::MinimizeButtonFade' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, Background) == 0x0002F0, "Member 'UBP_UMG_ReplayWidget_C::Background' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, Button_Exit) == 0x0002F8, "Member 'UBP_UMG_ReplayWidget_C::Button_Exit' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, Button_FastForward) == 0x000300, "Member 'UBP_UMG_ReplayWidget_C::Button_FastForward' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, Button_Minimize) == 0x000308, "Member 'UBP_UMG_ReplayWidget_C::Button_Minimize' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, Button_Player) == 0x000310, "Member 'UBP_UMG_ReplayWidget_C::Button_Player' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, Button_PlayPause) == 0x000318, "Member 'UBP_UMG_ReplayWidget_C::Button_PlayPause' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, Button_Rewind) == 0x000320, "Member 'UBP_UMG_ReplayWidget_C::Button_Rewind' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, Button_SpeedDecrease) == 0x000328, "Member 'UBP_UMG_ReplayWidget_C::Button_SpeedDecrease' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, Button_SpeedIncrease) == 0x000330, "Member 'UBP_UMG_ReplayWidget_C::Button_SpeedIncrease' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, Button_Stop) == 0x000338, "Member 'UBP_UMG_ReplayWidget_C::Button_Stop' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, FocusButton) == 0x000340, "Member 'UBP_UMG_ReplayWidget_C::FocusButton' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, Image_219) == 0x000348, "Member 'UBP_UMG_ReplayWidget_C::Image_219' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, Image_PlayPause) == 0x000350, "Member 'UBP_UMG_ReplayWidget_C::Image_PlayPause' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, Image_TimeScrub) == 0x000358, "Member 'UBP_UMG_ReplayWidget_C::Image_TimeScrub' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, MiniHov) == 0x000360, "Member 'UBP_UMG_ReplayWidget_C::MiniHov' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, Panel_Main) == 0x000368, "Member 'UBP_UMG_ReplayWidget_C::Panel_Main' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, PlayrateBG) == 0x000370, "Member 'UBP_UMG_ReplayWidget_C::PlayrateBG' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, ProgressBar_Duration) == 0x000378, "Member 'UBP_UMG_ReplayWidget_C::ProgressBar_Duration' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, Text_CurrentDuration) == 0x000380, "Member 'UBP_UMG_ReplayWidget_C::Text_CurrentDuration' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, Text_Focus) == 0x000388, "Member 'UBP_UMG_ReplayWidget_C::Text_Focus' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, Text_PlayRate) == 0x000390, "Member 'UBP_UMG_ReplayWidget_C::Text_PlayRate' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, Text_State) == 0x000398, "Member 'UBP_UMG_ReplayWidget_C::Text_State' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, Text_TotalDuration) == 0x0003A0, "Member 'UBP_UMG_ReplayWidget_C::Text_TotalDuration' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, TextBlock_253) == 0x0003A8, "Member 'UBP_UMG_ReplayWidget_C::TextBlock_253' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, Toggle_IDs) == 0x0003B0, "Member 'UBP_UMG_ReplayWidget_C::Toggle_IDs' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, ReplayPaused) == 0x0003B8, "Member 'UBP_UMG_ReplayWidget_C::ReplayPaused' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, ReplayPlayRate) == 0x0003C0, "Member 'UBP_UMG_ReplayWidget_C::ReplayPlayRate' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, UpdateTimerHandle) == 0x0003C8, "Member 'UBP_UMG_ReplayWidget_C::UpdateTimerHandle' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, PlayerIndex) == 0x0003D0, "Member 'UBP_UMG_ReplayWidget_C::PlayerIndex' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, MaxDistance) == 0x0003D8, "Member 'UBP_UMG_ReplayWidget_C::MaxDistance' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, CloseCharacter) == 0x0003E0, "Member 'UBP_UMG_ReplayWidget_C::CloseCharacter' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, CharacterText) == 0x0003E8, "Member 'UBP_UMG_ReplayWidget_C::CharacterText' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, CurrentPlayers) == 0x0003F8, "Member 'UBP_UMG_ReplayWidget_C::CurrentPlayers' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, RealUpdateTimeHandle) == 0x000408, "Member 'UBP_UMG_ReplayWidget_C::RealUpdateTimeHandle' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, bShowUserNames) == 0x000410, "Member 'UBP_UMG_ReplayWidget_C::bShowUserNames' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, NameActors) == 0x000418, "Member 'UBP_UMG_ReplayWidget_C::NameActors' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, DeathEvents) == 0x000428, "Member 'UBP_UMG_ReplayWidget_C::DeathEvents' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayWidget_C, DamageEvents) == 0x000438, "Member 'UBP_UMG_ReplayWidget_C::DamageEvents' has a wrong offset!");

}

