#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UMG_ReplayMenuRow

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TheIsle_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_UMG_ReplayMenuRow.BP_UMG_ReplayMenuRow_C.BndEvt__BP_UMG_ReplayMenuRow_ReplayName_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_UMG_ReplayMenuRow_C_BndEvt__BP_UMG_ReplayMenuRow_ReplayName_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UMG_ReplayMenuRow_C_BndEvt__BP_UMG_ReplayMenuRow_ReplayName_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on BP_UMG_ReplayMenuRow_C_BndEvt__BP_UMG_ReplayMenuRow_ReplayName_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(BP_UMG_ReplayMenuRow_C_BndEvt__BP_UMG_ReplayMenuRow_ReplayName_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000018, "Wrong size on BP_UMG_ReplayMenuRow_C_BndEvt__BP_UMG_ReplayMenuRow_ReplayName_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_BndEvt__BP_UMG_ReplayMenuRow_ReplayName_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'BP_UMG_ReplayMenuRow_C_BndEvt__BP_UMG_ReplayMenuRow_ReplayName_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_BndEvt__BP_UMG_ReplayMenuRow_ReplayName_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000010, "Member 'BP_UMG_ReplayMenuRow_C_BndEvt__BP_UMG_ReplayMenuRow_ReplayName_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function BP_UMG_ReplayMenuRow.BP_UMG_ReplayMenuRow_C.ExecuteUbergraph_BP_UMG_ReplayMenuRow
// 0x00A8 (0x00A8 - 0x0000)
struct BP_UMG_ReplayMenuRow_C_ExecuteUbergraph_BP_UMG_ReplayMenuRow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0040(0x0010)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Mid_ReturnValue;                          // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeValidFileName_ReturnValue;            // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UMG_ReplayMenuRow_C_ExecuteUbergraph_BP_UMG_ReplayMenuRow) == 0x000008, "Wrong alignment on BP_UMG_ReplayMenuRow_C_ExecuteUbergraph_BP_UMG_ReplayMenuRow");
static_assert(sizeof(BP_UMG_ReplayMenuRow_C_ExecuteUbergraph_BP_UMG_ReplayMenuRow) == 0x0000A8, "Wrong size on BP_UMG_ReplayMenuRow_C_ExecuteUbergraph_BP_UMG_ReplayMenuRow");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_ExecuteUbergraph_BP_UMG_ReplayMenuRow, EntryPoint) == 0x000000, "Member 'BP_UMG_ReplayMenuRow_C_ExecuteUbergraph_BP_UMG_ReplayMenuRow::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_ExecuteUbergraph_BP_UMG_ReplayMenuRow, K2Node_Event_MyGeometry) == 0x000004, "Member 'BP_UMG_ReplayMenuRow_C_ExecuteUbergraph_BP_UMG_ReplayMenuRow::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_ExecuteUbergraph_BP_UMG_ReplayMenuRow, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'BP_UMG_ReplayMenuRow_C_ExecuteUbergraph_BP_UMG_ReplayMenuRow::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_ExecuteUbergraph_BP_UMG_ReplayMenuRow, K2Node_ComponentBoundEvent_Text) == 0x000040, "Member 'BP_UMG_ReplayMenuRow_C_ExecuteUbergraph_BP_UMG_ReplayMenuRow::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_ExecuteUbergraph_BP_UMG_ReplayMenuRow, K2Node_ComponentBoundEvent_CommitMethod) == 0x000050, "Member 'BP_UMG_ReplayMenuRow_C_ExecuteUbergraph_BP_UMG_ReplayMenuRow::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_ExecuteUbergraph_BP_UMG_ReplayMenuRow, CallFunc_Conv_TextToString_ReturnValue) == 0x000058, "Member 'BP_UMG_ReplayMenuRow_C_ExecuteUbergraph_BP_UMG_ReplayMenuRow::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_ExecuteUbergraph_BP_UMG_ReplayMenuRow, CallFunc_Mid_ReturnValue) == 0x000068, "Member 'BP_UMG_ReplayMenuRow_C_ExecuteUbergraph_BP_UMG_ReplayMenuRow::CallFunc_Mid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_ExecuteUbergraph_BP_UMG_ReplayMenuRow, CallFunc_MakeValidFileName_ReturnValue) == 0x000078, "Member 'BP_UMG_ReplayMenuRow_C_ExecuteUbergraph_BP_UMG_ReplayMenuRow::CallFunc_MakeValidFileName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_ExecuteUbergraph_BP_UMG_ReplayMenuRow, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'BP_UMG_ReplayMenuRow_C_ExecuteUbergraph_BP_UMG_ReplayMenuRow::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_ExecuteUbergraph_BP_UMG_ReplayMenuRow, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000098, "Member 'BP_UMG_ReplayMenuRow_C_ExecuteUbergraph_BP_UMG_ReplayMenuRow::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");

// Function BP_UMG_ReplayMenuRow.BP_UMG_ReplayMenuRow_C.SetSelected
// 0x0001 (0x0001 - 0x0000)
struct BP_UMG_ReplayMenuRow_C_SetSelected final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UMG_ReplayMenuRow_C_SetSelected) == 0x000001, "Wrong alignment on BP_UMG_ReplayMenuRow_C_SetSelected");
static_assert(sizeof(BP_UMG_ReplayMenuRow_C_SetSelected) == 0x000001, "Wrong size on BP_UMG_ReplayMenuRow_C_SetSelected");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_SetSelected, Selected) == 0x000000, "Member 'BP_UMG_ReplayMenuRow_C_SetSelected::Selected' has a wrong offset!");

// Function BP_UMG_ReplayMenuRow.BP_UMG_ReplayMenuRow_C.Setup
// 0x02F0 (0x02F0 - 0x0000)
struct BP_UMG_ReplayMenuRow_C_Setup final
{
public:
	int32                                         Replay_Index;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDemoEntry                             Replay_Data_0;                                     // 0x0008(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UBP_UMG_ReplayMenu_C*                   Parent_0;                                          // 0x0088(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCooldownExpired_ReturnValue;           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetTimeSince_ReturnValue;                 // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan2_Days;                      // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan2_Hours;                     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan2_Minutes;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan2_Seconds;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan2_FractionNano;              // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C8(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0120(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0140(0x0010)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0168(0x0010)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0180(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01E0(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01F0(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0200(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0210(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0258(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x02A0(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x02B0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x02C0(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x02D0(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x02E0(0x0010)()
};
static_assert(alignof(BP_UMG_ReplayMenuRow_C_Setup) == 0x000008, "Wrong alignment on BP_UMG_ReplayMenuRow_C_Setup");
static_assert(sizeof(BP_UMG_ReplayMenuRow_C_Setup) == 0x0002F0, "Wrong size on BP_UMG_ReplayMenuRow_C_Setup");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, Replay_Index) == 0x000000, "Member 'BP_UMG_ReplayMenuRow_C_Setup::Replay_Index' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, Replay_Data_0) == 0x000008, "Member 'BP_UMG_ReplayMenuRow_C_Setup::Replay_Data_0' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, Parent_0) == 0x000088, "Member 'BP_UMG_ReplayMenuRow_C_Setup::Parent_0' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, CallFunc_HasCooldownExpired_ReturnValue) == 0x000090, "Member 'BP_UMG_ReplayMenuRow_C_Setup::CallFunc_HasCooldownExpired_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, CallFunc_GetTimeSince_ReturnValue) == 0x000098, "Member 'BP_UMG_ReplayMenuRow_C_Setup::CallFunc_GetTimeSince_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, CallFunc_BreakTimespan2_Days) == 0x0000A0, "Member 'BP_UMG_ReplayMenuRow_C_Setup::CallFunc_BreakTimespan2_Days' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, CallFunc_BreakTimespan2_Hours) == 0x0000A4, "Member 'BP_UMG_ReplayMenuRow_C_Setup::CallFunc_BreakTimespan2_Hours' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, CallFunc_BreakTimespan2_Minutes) == 0x0000A8, "Member 'BP_UMG_ReplayMenuRow_C_Setup::CallFunc_BreakTimespan2_Minutes' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, CallFunc_BreakTimespan2_Seconds) == 0x0000AC, "Member 'BP_UMG_ReplayMenuRow_C_Setup::CallFunc_BreakTimespan2_Seconds' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, CallFunc_BreakTimespan2_FractionNano) == 0x0000B0, "Member 'BP_UMG_ReplayMenuRow_C_Setup::CallFunc_BreakTimespan2_FractionNano' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0000B8, "Member 'BP_UMG_ReplayMenuRow_C_Setup::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000C0, "Member 'BP_UMG_ReplayMenuRow_C_Setup::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, K2Node_MakeStruct_FormatArgumentData) == 0x0000C8, "Member 'BP_UMG_ReplayMenuRow_C_Setup::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, CallFunc_Conv_IntToString_ReturnValue) == 0x000110, "Member 'BP_UMG_ReplayMenuRow_C_Setup::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, K2Node_MakeArray_Array) == 0x000120, "Member 'BP_UMG_ReplayMenuRow_C_Setup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, CallFunc_Concat_StrStr_ReturnValue) == 0x000130, "Member 'BP_UMG_ReplayMenuRow_C_Setup::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, CallFunc_Format_ReturnValue) == 0x000140, "Member 'BP_UMG_ReplayMenuRow_C_Setup::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000150, "Member 'BP_UMG_ReplayMenuRow_C_Setup::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, CallFunc_Divide_IntInt_ReturnValue) == 0x000160, "Member 'BP_UMG_ReplayMenuRow_C_Setup::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, CallFunc_Conv_StringToText_ReturnValue) == 0x000168, "Member 'BP_UMG_ReplayMenuRow_C_Setup::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, CallFunc_Conv_IntToInt64_ReturnValue_1) == 0x000178, "Member 'BP_UMG_ReplayMenuRow_C_Setup::CallFunc_Conv_IntToInt64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, K2Node_MakeStruct_FormatArgumentData_1) == 0x000180, "Member 'BP_UMG_ReplayMenuRow_C_Setup::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0001C8, "Member 'BP_UMG_ReplayMenuRow_C_Setup::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, K2Node_MakeArray_Array_1) == 0x0001D0, "Member 'BP_UMG_ReplayMenuRow_C_Setup::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, CallFunc_Format_ReturnValue_1) == 0x0001E0, "Member 'BP_UMG_ReplayMenuRow_C_Setup::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001F0, "Member 'BP_UMG_ReplayMenuRow_C_Setup::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000200, "Member 'BP_UMG_ReplayMenuRow_C_Setup::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, K2Node_MakeStruct_FormatArgumentData_2) == 0x000210, "Member 'BP_UMG_ReplayMenuRow_C_Setup::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, K2Node_MakeStruct_FormatArgumentData_3) == 0x000258, "Member 'BP_UMG_ReplayMenuRow_C_Setup::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, K2Node_MakeArray_Array_2) == 0x0002A0, "Member 'BP_UMG_ReplayMenuRow_C_Setup::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, K2Node_MakeArray_Array_3) == 0x0002B0, "Member 'BP_UMG_ReplayMenuRow_C_Setup::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, CallFunc_Format_ReturnValue_2) == 0x0002C0, "Member 'BP_UMG_ReplayMenuRow_C_Setup::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, CallFunc_Format_ReturnValue_3) == 0x0002D0, "Member 'BP_UMG_ReplayMenuRow_C_Setup::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Setup, CallFunc_Conv_StringToText_ReturnValue_3) == 0x0002E0, "Member 'BP_UMG_ReplayMenuRow_C_Setup::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");

// Function BP_UMG_ReplayMenuRow.BP_UMG_ReplayMenuRow_C.TextUpdate
// 0x0A20 (0x0A20 - 0x0000)
struct BP_UMG_ReplayMenuRow_C_TextUpdate final
{
public:
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0000(0x00D0)()
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue_1;       // 0x00D0(0x00D0)()
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle;                     // 0x01A0(0x03F0)()
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle_1;                   // 0x0590(0x03F0)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0980(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCooldownExpired_ReturnValue;           // 0x0981(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_982[0x6];                                      // 0x0982(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetTimeSince_ReturnValue;                 // 0x0988(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan2_Days;                      // 0x0990(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan2_Hours;                     // 0x0994(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan2_Minutes;                   // 0x0998(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan2_Seconds;                   // 0x099C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakTimespan2_FractionNano;              // 0x09A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_bIsEditor_ReturnValue;                    // 0x09A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A5[0x3];                                      // 0x09A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x09A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9AC[0x4];                                      // 0x09AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x09B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x09C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x09D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x09E0(0x0010)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x09F0(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0A04(0x0014)()
};
static_assert(alignof(BP_UMG_ReplayMenuRow_C_TextUpdate) == 0x000010, "Wrong alignment on BP_UMG_ReplayMenuRow_C_TextUpdate");
static_assert(sizeof(BP_UMG_ReplayMenuRow_C_TextUpdate) == 0x000A20, "Wrong size on BP_UMG_ReplayMenuRow_C_TextUpdate");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_TextUpdate, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000000, "Member 'BP_UMG_ReplayMenuRow_C_TextUpdate::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_TextUpdate, CallFunc_MakeBrushFromTexture_ReturnValue_1) == 0x0000D0, "Member 'BP_UMG_ReplayMenuRow_C_TextUpdate::CallFunc_MakeBrushFromTexture_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_TextUpdate, K2Node_MakeStruct_ButtonStyle) == 0x0001A0, "Member 'BP_UMG_ReplayMenuRow_C_TextUpdate::K2Node_MakeStruct_ButtonStyle' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_TextUpdate, K2Node_MakeStruct_ButtonStyle_1) == 0x000590, "Member 'BP_UMG_ReplayMenuRow_C_TextUpdate::K2Node_MakeStruct_ButtonStyle_1' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_TextUpdate, CallFunc_Not_PreBool_ReturnValue) == 0x000980, "Member 'BP_UMG_ReplayMenuRow_C_TextUpdate::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_TextUpdate, CallFunc_HasCooldownExpired_ReturnValue) == 0x000981, "Member 'BP_UMG_ReplayMenuRow_C_TextUpdate::CallFunc_HasCooldownExpired_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_TextUpdate, CallFunc_GetTimeSince_ReturnValue) == 0x000988, "Member 'BP_UMG_ReplayMenuRow_C_TextUpdate::CallFunc_GetTimeSince_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_TextUpdate, CallFunc_BreakTimespan2_Days) == 0x000990, "Member 'BP_UMG_ReplayMenuRow_C_TextUpdate::CallFunc_BreakTimespan2_Days' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_TextUpdate, CallFunc_BreakTimespan2_Hours) == 0x000994, "Member 'BP_UMG_ReplayMenuRow_C_TextUpdate::CallFunc_BreakTimespan2_Hours' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_TextUpdate, CallFunc_BreakTimespan2_Minutes) == 0x000998, "Member 'BP_UMG_ReplayMenuRow_C_TextUpdate::CallFunc_BreakTimespan2_Minutes' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_TextUpdate, CallFunc_BreakTimespan2_Seconds) == 0x00099C, "Member 'BP_UMG_ReplayMenuRow_C_TextUpdate::CallFunc_BreakTimespan2_Seconds' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_TextUpdate, CallFunc_BreakTimespan2_FractionNano) == 0x0009A0, "Member 'BP_UMG_ReplayMenuRow_C_TextUpdate::CallFunc_BreakTimespan2_FractionNano' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_TextUpdate, CallFunc_bIsEditor_ReturnValue) == 0x0009A4, "Member 'BP_UMG_ReplayMenuRow_C_TextUpdate::CallFunc_bIsEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_TextUpdate, CallFunc_Subtract_IntInt_ReturnValue) == 0x0009A8, "Member 'BP_UMG_ReplayMenuRow_C_TextUpdate::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_TextUpdate, CallFunc_Conv_IntToString_ReturnValue) == 0x0009B0, "Member 'BP_UMG_ReplayMenuRow_C_TextUpdate::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_TextUpdate, CallFunc_Concat_StrStr_ReturnValue) == 0x0009C0, "Member 'BP_UMG_ReplayMenuRow_C_TextUpdate::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_TextUpdate, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0009D0, "Member 'BP_UMG_ReplayMenuRow_C_TextUpdate::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_TextUpdate, CallFunc_Conv_StringToText_ReturnValue) == 0x0009E0, "Member 'BP_UMG_ReplayMenuRow_C_TextUpdate::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_TextUpdate, K2Node_MakeStruct_SlateColor) == 0x0009F0, "Member 'BP_UMG_ReplayMenuRow_C_TextUpdate::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_TextUpdate, K2Node_MakeStruct_SlateColor_1) == 0x000A04, "Member 'BP_UMG_ReplayMenuRow_C_TextUpdate::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function BP_UMG_ReplayMenuRow.BP_UMG_ReplayMenuRow_C.Tick
// 0x003C (0x003C - 0x0000)
struct BP_UMG_ReplayMenuRow_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UMG_ReplayMenuRow_C_Tick) == 0x000004, "Wrong alignment on BP_UMG_ReplayMenuRow_C_Tick");
static_assert(sizeof(BP_UMG_ReplayMenuRow_C_Tick) == 0x00003C, "Wrong size on BP_UMG_ReplayMenuRow_C_Tick");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Tick, MyGeometry) == 0x000000, "Member 'BP_UMG_ReplayMenuRow_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenuRow_C_Tick, InDeltaTime) == 0x000038, "Member 'BP_UMG_ReplayMenuRow_C_Tick::InDeltaTime' has a wrong offset!");

}

