#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UnderwaterForagingSpot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_UnderwaterForagingSpot.BP_UnderwaterForagingSpot_C
// 0x0020 (0x02B0 - 0x0290)
class ABP_UnderwaterForagingSpot_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Bubbles;                                           // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_UnderwaterForagingSpot(int32 EntryPoint);
	struct FVector GetScentLocation();
	void HideScentEffects(class ATIDinosaurBase* Scenter, bool bScentFinished);
	bool IsCorpse();
	bool IsScentableFootprint();
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void ShowScentEffects(class ATIDinosaurBase* Scenter, bool bScentStarted);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UnderwaterForagingSpot_C">();
	}
	static class ABP_UnderwaterForagingSpot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_UnderwaterForagingSpot_C>();
	}
};
static_assert(alignof(ABP_UnderwaterForagingSpot_C) == 0x000008, "Wrong alignment on ABP_UnderwaterForagingSpot_C");
static_assert(sizeof(ABP_UnderwaterForagingSpot_C) == 0x0002B0, "Wrong size on ABP_UnderwaterForagingSpot_C");
static_assert(offsetof(ABP_UnderwaterForagingSpot_C, UberGraphFrame) == 0x000290, "Member 'ABP_UnderwaterForagingSpot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_UnderwaterForagingSpot_C, Sphere) == 0x000298, "Member 'ABP_UnderwaterForagingSpot_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_UnderwaterForagingSpot_C, DefaultSceneRoot) == 0x0002A0, "Member 'ABP_UnderwaterForagingSpot_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_UnderwaterForagingSpot_C, Bubbles) == 0x0002A8, "Member 'ABP_UnderwaterForagingSpot_C::Bubbles' has a wrong offset!");

}

