#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UMG_ReplayMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UMG_ReplayMenu.BP_UMG_ReplayMenu_C
// 0x00E0 (0x0408 - 0x0328)
class UBP_UMG_ReplayMenu_C final : public UTIReplayMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BGicon;                                            // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Blackground;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Back;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Delete;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Play;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Rename;                                     // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CursorBlinkTop;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dusty;                                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ForegroundIvy;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Screen;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LittleBottomFlicker;                               // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LowerFade;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Overlay;                                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Replays;                                 // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollTextTopR;                                    // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Underline;                                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UpperFade;                                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UpperLightGreen;                                   // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UpperLightGreenGlow;                               // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox_Replays;                                   // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_UMG_ReplayMenuRow_C*                SelectedRow;                                       // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MorningVibe;                                       // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NighttimeVibe;                                     // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Button_Back_K2Node_ComponentBoundEvent_133_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_Delete_K2Node_ComponentBoundEvent_649_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_Play_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_Rename_K2Node_ComponentBoundEvent_670_OnButtonClickedEvent__DelegateSignature();
	void ButtonUpdate();
	void Construct();
	void ExecuteUbergraph_BP_UMG_ReplayMenu(int32 EntryPoint);
	void OnInitialized();
	void Refresh();
	void ReplayDeleted(const bool bDeleteSucceeded);
	void ReplayListUpdated();
	void ReplaySelected(class UBP_UMG_ReplayMenuRow_C* Replay_Row);
	void Update();
	void UpdateMenuTheme();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UMG_ReplayMenu_C">();
	}
	static class UBP_UMG_ReplayMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UMG_ReplayMenu_C>();
	}
};
static_assert(alignof(UBP_UMG_ReplayMenu_C) == 0x000008, "Wrong alignment on UBP_UMG_ReplayMenu_C");
static_assert(sizeof(UBP_UMG_ReplayMenu_C) == 0x000408, "Wrong size on UBP_UMG_ReplayMenu_C");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, UberGraphFrame) == 0x000328, "Member 'UBP_UMG_ReplayMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, Background) == 0x000330, "Member 'UBP_UMG_ReplayMenu_C::Background' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, BGicon) == 0x000338, "Member 'UBP_UMG_ReplayMenu_C::BGicon' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, Blackground) == 0x000340, "Member 'UBP_UMG_ReplayMenu_C::Blackground' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, Button_Back) == 0x000348, "Member 'UBP_UMG_ReplayMenu_C::Button_Back' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, Button_Delete) == 0x000350, "Member 'UBP_UMG_ReplayMenu_C::Button_Delete' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, Button_Play) == 0x000358, "Member 'UBP_UMG_ReplayMenu_C::Button_Play' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, Button_Rename) == 0x000360, "Member 'UBP_UMG_ReplayMenu_C::Button_Rename' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, CursorBlinkTop) == 0x000368, "Member 'UBP_UMG_ReplayMenu_C::CursorBlinkTop' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, Dusty) == 0x000370, "Member 'UBP_UMG_ReplayMenu_C::Dusty' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, ForegroundIvy) == 0x000378, "Member 'UBP_UMG_ReplayMenu_C::ForegroundIvy' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, Glow) == 0x000380, "Member 'UBP_UMG_ReplayMenu_C::Glow' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, Image_Screen) == 0x000388, "Member 'UBP_UMG_ReplayMenu_C::Image_Screen' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, LittleBottomFlicker) == 0x000390, "Member 'UBP_UMG_ReplayMenu_C::LittleBottomFlicker' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, LowerFade) == 0x000398, "Member 'UBP_UMG_ReplayMenu_C::LowerFade' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, Overlay) == 0x0003A0, "Member 'UBP_UMG_ReplayMenu_C::Overlay' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, ScrollBox_Replays) == 0x0003A8, "Member 'UBP_UMG_ReplayMenu_C::ScrollBox_Replays' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, ScrollTextTopR) == 0x0003B0, "Member 'UBP_UMG_ReplayMenu_C::ScrollTextTopR' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, Underline) == 0x0003B8, "Member 'UBP_UMG_ReplayMenu_C::Underline' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, UpperFade) == 0x0003C0, "Member 'UBP_UMG_ReplayMenu_C::UpperFade' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, UpperLightGreen) == 0x0003C8, "Member 'UBP_UMG_ReplayMenu_C::UpperLightGreen' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, UpperLightGreenGlow) == 0x0003D0, "Member 'UBP_UMG_ReplayMenu_C::UpperLightGreenGlow' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, WrapBox_Replays) == 0x0003D8, "Member 'UBP_UMG_ReplayMenu_C::WrapBox_Replays' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, SelectedRow) == 0x0003E0, "Member 'UBP_UMG_ReplayMenu_C::SelectedRow' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, MorningVibe) == 0x0003E8, "Member 'UBP_UMG_ReplayMenu_C::MorningVibe' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenu_C, NighttimeVibe) == 0x0003F8, "Member 'UBP_UMG_ReplayMenu_C::NighttimeVibe' has a wrong offset!");

}

