#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UMG_MsgBoxSteamFail

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UMG_MsgBoxSteamFail.BP_UMG_MsgBoxSteamFail_C
// 0x0048 (0x0328 - 0x02E0)
class UBP_UMG_MsgBoxSteamFail_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Black;                                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_CloseGame;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Ignore;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_159;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableTextBox*              Message;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Overlay;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 STEAM;                                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title;                                             // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__Button_3_K2Node_ComponentBoundEvent_92_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_Close_K2Node_ComponentBoundEvent_78_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_BP_UMG_MsgBoxSteamFail(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UMG_MsgBoxSteamFail_C">();
	}
	static class UBP_UMG_MsgBoxSteamFail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UMG_MsgBoxSteamFail_C>();
	}
};
static_assert(alignof(UBP_UMG_MsgBoxSteamFail_C) == 0x000008, "Wrong alignment on UBP_UMG_MsgBoxSteamFail_C");
static_assert(sizeof(UBP_UMG_MsgBoxSteamFail_C) == 0x000328, "Wrong size on UBP_UMG_MsgBoxSteamFail_C");
static_assert(offsetof(UBP_UMG_MsgBoxSteamFail_C, UberGraphFrame) == 0x0002E0, "Member 'UBP_UMG_MsgBoxSteamFail_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UMG_MsgBoxSteamFail_C, Black) == 0x0002E8, "Member 'UBP_UMG_MsgBoxSteamFail_C::Black' has a wrong offset!");
static_assert(offsetof(UBP_UMG_MsgBoxSteamFail_C, Button_CloseGame) == 0x0002F0, "Member 'UBP_UMG_MsgBoxSteamFail_C::Button_CloseGame' has a wrong offset!");
static_assert(offsetof(UBP_UMG_MsgBoxSteamFail_C, Button_Ignore) == 0x0002F8, "Member 'UBP_UMG_MsgBoxSteamFail_C::Button_Ignore' has a wrong offset!");
static_assert(offsetof(UBP_UMG_MsgBoxSteamFail_C, Image_159) == 0x000300, "Member 'UBP_UMG_MsgBoxSteamFail_C::Image_159' has a wrong offset!");
static_assert(offsetof(UBP_UMG_MsgBoxSteamFail_C, Message) == 0x000308, "Member 'UBP_UMG_MsgBoxSteamFail_C::Message' has a wrong offset!");
static_assert(offsetof(UBP_UMG_MsgBoxSteamFail_C, Overlay) == 0x000310, "Member 'UBP_UMG_MsgBoxSteamFail_C::Overlay' has a wrong offset!");
static_assert(offsetof(UBP_UMG_MsgBoxSteamFail_C, STEAM) == 0x000318, "Member 'UBP_UMG_MsgBoxSteamFail_C::STEAM' has a wrong offset!");
static_assert(offsetof(UBP_UMG_MsgBoxSteamFail_C, Title) == 0x000320, "Member 'UBP_UMG_MsgBoxSteamFail_C::Title' has a wrong offset!");

}

