#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UMG_Dossier

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UMG_Dossier.BP_UMG_Dossier_C
// 0x0090 (0x0370 - 0x02E0)
class UBP_UMG_Dossier_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Fade;                                              // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ApolloLogo;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Black;                                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Black2TheSequelToBlack;                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Close;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dinosaur;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DNA;                                               // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GridBackground;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Overlay;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Panel_Information;                                 // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_BiteForce;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Diet;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Name;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Speed;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_WeightMass;                                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Vignette;                                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          TonneCheck;                                        // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Button_Close_K2Node_ComponentBoundEvent_15_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_BP_UMG_Dossier(int32 EntryPoint);
	void Reset();
	void Setup(class UTexture2D* Dossier_Img, const class FText& Dinosaur_Name, const class FText& Diet, double Bite_Force, double Weight_Mass, double Speed);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UMG_Dossier_C">();
	}
	static class UBP_UMG_Dossier_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UMG_Dossier_C>();
	}
};
static_assert(alignof(UBP_UMG_Dossier_C) == 0x000008, "Wrong alignment on UBP_UMG_Dossier_C");
static_assert(sizeof(UBP_UMG_Dossier_C) == 0x000370, "Wrong size on UBP_UMG_Dossier_C");
static_assert(offsetof(UBP_UMG_Dossier_C, UberGraphFrame) == 0x0002E0, "Member 'UBP_UMG_Dossier_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UMG_Dossier_C, Fade) == 0x0002E8, "Member 'UBP_UMG_Dossier_C::Fade' has a wrong offset!");
static_assert(offsetof(UBP_UMG_Dossier_C, ApolloLogo) == 0x0002F0, "Member 'UBP_UMG_Dossier_C::ApolloLogo' has a wrong offset!");
static_assert(offsetof(UBP_UMG_Dossier_C, Black) == 0x0002F8, "Member 'UBP_UMG_Dossier_C::Black' has a wrong offset!");
static_assert(offsetof(UBP_UMG_Dossier_C, Black2TheSequelToBlack) == 0x000300, "Member 'UBP_UMG_Dossier_C::Black2TheSequelToBlack' has a wrong offset!");
static_assert(offsetof(UBP_UMG_Dossier_C, Button_Close) == 0x000308, "Member 'UBP_UMG_Dossier_C::Button_Close' has a wrong offset!");
static_assert(offsetof(UBP_UMG_Dossier_C, Dinosaur) == 0x000310, "Member 'UBP_UMG_Dossier_C::Dinosaur' has a wrong offset!");
static_assert(offsetof(UBP_UMG_Dossier_C, DNA) == 0x000318, "Member 'UBP_UMG_Dossier_C::DNA' has a wrong offset!");
static_assert(offsetof(UBP_UMG_Dossier_C, GridBackground) == 0x000320, "Member 'UBP_UMG_Dossier_C::GridBackground' has a wrong offset!");
static_assert(offsetof(UBP_UMG_Dossier_C, Overlay) == 0x000328, "Member 'UBP_UMG_Dossier_C::Overlay' has a wrong offset!");
static_assert(offsetof(UBP_UMG_Dossier_C, Panel_Information) == 0x000330, "Member 'UBP_UMG_Dossier_C::Panel_Information' has a wrong offset!");
static_assert(offsetof(UBP_UMG_Dossier_C, Text_BiteForce) == 0x000338, "Member 'UBP_UMG_Dossier_C::Text_BiteForce' has a wrong offset!");
static_assert(offsetof(UBP_UMG_Dossier_C, Text_Diet) == 0x000340, "Member 'UBP_UMG_Dossier_C::Text_Diet' has a wrong offset!");
static_assert(offsetof(UBP_UMG_Dossier_C, Text_Name) == 0x000348, "Member 'UBP_UMG_Dossier_C::Text_Name' has a wrong offset!");
static_assert(offsetof(UBP_UMG_Dossier_C, Text_Speed) == 0x000350, "Member 'UBP_UMG_Dossier_C::Text_Speed' has a wrong offset!");
static_assert(offsetof(UBP_UMG_Dossier_C, Text_WeightMass) == 0x000358, "Member 'UBP_UMG_Dossier_C::Text_WeightMass' has a wrong offset!");
static_assert(offsetof(UBP_UMG_Dossier_C, Vignette) == 0x000360, "Member 'UBP_UMG_Dossier_C::Vignette' has a wrong offset!");
static_assert(offsetof(UBP_UMG_Dossier_C, TonneCheck) == 0x000368, "Member 'UBP_UMG_Dossier_C::TonneCheck' has a wrong offset!");

}

