#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UMG_Dossier

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_UMG_Dossier.BP_UMG_Dossier_C.ExecuteUbergraph_BP_UMG_Dossier
// 0x0010 (0x0010 - 0x0000)
struct BP_UMG_Dossier_C_ExecuteUbergraph_BP_UMG_Dossier final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UMG_Dossier_C_ExecuteUbergraph_BP_UMG_Dossier) == 0x000008, "Wrong alignment on BP_UMG_Dossier_C_ExecuteUbergraph_BP_UMG_Dossier");
static_assert(sizeof(BP_UMG_Dossier_C_ExecuteUbergraph_BP_UMG_Dossier) == 0x000010, "Wrong size on BP_UMG_Dossier_C_ExecuteUbergraph_BP_UMG_Dossier");
static_assert(offsetof(BP_UMG_Dossier_C_ExecuteUbergraph_BP_UMG_Dossier, EntryPoint) == 0x000000, "Member 'BP_UMG_Dossier_C_ExecuteUbergraph_BP_UMG_Dossier::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_ExecuteUbergraph_BP_UMG_Dossier, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BP_UMG_Dossier_C_ExecuteUbergraph_BP_UMG_Dossier::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BP_UMG_Dossier.BP_UMG_Dossier_C.Setup
// 0x02A0 (0x02A0 - 0x0000)
struct BP_UMG_Dossier_C_Setup final
{
public:
	class UTexture2D*                             Dossier_Img;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Dinosaur_Name;                                     // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Diet;                                              // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	double                                        Bite_Force;                                        // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Weight_Mass;                                       // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Speed;                                             // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0048(0x0010)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x0058(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0068(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0108(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0118(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0128(0x0010)()
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_2;          // 0x0148(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0158(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_3;          // 0x01A0(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x01B0(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01C0(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0208(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0218(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0228(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0270(0x0010)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x0280(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x0290(0x0010)()
};
static_assert(alignof(BP_UMG_Dossier_C_Setup) == 0x000008, "Wrong alignment on BP_UMG_Dossier_C_Setup");
static_assert(sizeof(BP_UMG_Dossier_C_Setup) == 0x0002A0, "Wrong size on BP_UMG_Dossier_C_Setup");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, Dossier_Img) == 0x000000, "Member 'BP_UMG_Dossier_C_Setup::Dossier_Img' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, Dinosaur_Name) == 0x000008, "Member 'BP_UMG_Dossier_C_Setup::Dinosaur_Name' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, Diet) == 0x000018, "Member 'BP_UMG_Dossier_C_Setup::Diet' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, Bite_Force) == 0x000028, "Member 'BP_UMG_Dossier_C_Setup::Bite_Force' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, Weight_Mass) == 0x000030, "Member 'BP_UMG_Dossier_C_Setup::Weight_Mass' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, Speed) == 0x000038, "Member 'BP_UMG_Dossier_C_Setup::Speed' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_UMG_Dossier_C_Setup::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000048, "Member 'BP_UMG_Dossier_C_Setup::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, CallFunc_Conv_DoubleToText_ReturnValue_1) == 0x000058, "Member 'BP_UMG_Dossier_C_Setup::CallFunc_Conv_DoubleToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, K2Node_MakeStruct_FormatArgumentData) == 0x000068, "Member 'BP_UMG_Dossier_C_Setup::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000B0, "Member 'BP_UMG_Dossier_C_Setup::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, K2Node_MakeArray_Array) == 0x0000F8, "Member 'BP_UMG_Dossier_C_Setup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, K2Node_MakeArray_Array_1) == 0x000108, "Member 'BP_UMG_Dossier_C_Setup::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, CallFunc_Format_ReturnValue) == 0x000118, "Member 'BP_UMG_Dossier_C_Setup::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, CallFunc_Format_ReturnValue_1) == 0x000128, "Member 'BP_UMG_Dossier_C_Setup::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000138, "Member 'BP_UMG_Dossier_C_Setup::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000140, "Member 'BP_UMG_Dossier_C_Setup::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, CallFunc_Conv_DoubleToText_ReturnValue_2) == 0x000148, "Member 'BP_UMG_Dossier_C_Setup::CallFunc_Conv_DoubleToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, K2Node_MakeStruct_FormatArgumentData_2) == 0x000158, "Member 'BP_UMG_Dossier_C_Setup::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, CallFunc_Conv_DoubleToText_ReturnValue_3) == 0x0001A0, "Member 'BP_UMG_Dossier_C_Setup::CallFunc_Conv_DoubleToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, K2Node_MakeArray_Array_2) == 0x0001B0, "Member 'BP_UMG_Dossier_C_Setup::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, K2Node_MakeStruct_FormatArgumentData_3) == 0x0001C0, "Member 'BP_UMG_Dossier_C_Setup::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, CallFunc_Format_ReturnValue_2) == 0x000208, "Member 'BP_UMG_Dossier_C_Setup::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, K2Node_MakeArray_Array_3) == 0x000218, "Member 'BP_UMG_Dossier_C_Setup::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, K2Node_MakeStruct_FormatArgumentData_4) == 0x000228, "Member 'BP_UMG_Dossier_C_Setup::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, CallFunc_Format_ReturnValue_3) == 0x000270, "Member 'BP_UMG_Dossier_C_Setup::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, K2Node_MakeArray_Array_4) == 0x000280, "Member 'BP_UMG_Dossier_C_Setup::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(BP_UMG_Dossier_C_Setup, CallFunc_Format_ReturnValue_4) == 0x000290, "Member 'BP_UMG_Dossier_C_Setup::CallFunc_Format_ReturnValue_4' has a wrong offset!");

}

