#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UMG_ReplayMenuRow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TheIsle_structs.hpp"
#include "TheIsle_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UMG_ReplayMenuRow.BP_UMG_ReplayMenuRow_C
// 0x00D8 (0x0400 - 0x0328)
class UBP_UMG_ReplayMenuRow_C final : public UTIReplayMenuWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             AvailableIn;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Select;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NameUnselected;                                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       ReplayNameSelected;                                // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Date;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Length;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_SizeOnDisk;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_UMG_ReplayMenu_C*                   Parent;                                            // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         ReplayIndex;                                       // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDemoEntry                             Replay_Data;                                       // 0x0378(0x0080)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsSelected;                                        // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_UMG_ReplayMenuRow_ReplayName_K2Node_ComponentBoundEvent_1_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__Button_Select_K2Node_ComponentBoundEvent_75_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_BP_UMG_ReplayMenuRow(int32 EntryPoint);
	void SetRenameFocus();
	void SetSelected(bool Selected);
	void Setup(int32 Replay_Index, const struct FDemoEntry& Replay_Data_0, class UBP_UMG_ReplayMenu_C* Parent_0);
	void TextUpdate();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UMG_ReplayMenuRow_C">();
	}
	static class UBP_UMG_ReplayMenuRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UMG_ReplayMenuRow_C>();
	}
};
static_assert(alignof(UBP_UMG_ReplayMenuRow_C) == 0x000008, "Wrong alignment on UBP_UMG_ReplayMenuRow_C");
static_assert(sizeof(UBP_UMG_ReplayMenuRow_C) == 0x000400, "Wrong size on UBP_UMG_ReplayMenuRow_C");
static_assert(offsetof(UBP_UMG_ReplayMenuRow_C, UberGraphFrame) == 0x000328, "Member 'UBP_UMG_ReplayMenuRow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenuRow_C, AvailableIn) == 0x000330, "Member 'UBP_UMG_ReplayMenuRow_C::AvailableIn' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenuRow_C, Button_Select) == 0x000338, "Member 'UBP_UMG_ReplayMenuRow_C::Button_Select' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenuRow_C, NameUnselected) == 0x000340, "Member 'UBP_UMG_ReplayMenuRow_C::NameUnselected' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenuRow_C, ReplayNameSelected) == 0x000348, "Member 'UBP_UMG_ReplayMenuRow_C::ReplayNameSelected' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenuRow_C, Text_Date) == 0x000350, "Member 'UBP_UMG_ReplayMenuRow_C::Text_Date' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenuRow_C, Text_Length) == 0x000358, "Member 'UBP_UMG_ReplayMenuRow_C::Text_Length' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenuRow_C, Text_SizeOnDisk) == 0x000360, "Member 'UBP_UMG_ReplayMenuRow_C::Text_SizeOnDisk' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenuRow_C, Parent) == 0x000368, "Member 'UBP_UMG_ReplayMenuRow_C::Parent' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenuRow_C, ReplayIndex) == 0x000370, "Member 'UBP_UMG_ReplayMenuRow_C::ReplayIndex' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenuRow_C, Replay_Data) == 0x000378, "Member 'UBP_UMG_ReplayMenuRow_C::Replay_Data' has a wrong offset!");
static_assert(offsetof(UBP_UMG_ReplayMenuRow_C, IsSelected) == 0x0003F8, "Member 'UBP_UMG_ReplayMenuRow_C::IsSelected' has a wrong offset!");

}

