#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UMG_ReplayMenu

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "TheIsle_structs.hpp"


namespace SDK::Params
{

// Function BP_UMG_ReplayMenu.BP_UMG_ReplayMenu_C.ButtonUpdate
// 0x0001 (0x0001 - 0x0000)
struct BP_UMG_ReplayMenu_C_ButtonUpdate final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UMG_ReplayMenu_C_ButtonUpdate) == 0x000001, "Wrong alignment on BP_UMG_ReplayMenu_C_ButtonUpdate");
static_assert(sizeof(BP_UMG_ReplayMenu_C_ButtonUpdate) == 0x000001, "Wrong size on BP_UMG_ReplayMenu_C_ButtonUpdate");
static_assert(offsetof(BP_UMG_ReplayMenu_C_ButtonUpdate, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_UMG_ReplayMenu_C_ButtonUpdate::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_UMG_ReplayMenu.BP_UMG_ReplayMenu_C.ExecuteUbergraph_BP_UMG_ReplayMenu
// 0x0030 (0x0030 - 0x0000)
struct BP_UMG_ReplayMenu_C_ExecuteUbergraph_BP_UMG_ReplayMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDeleteSucceeded;                     // 0x0018(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UMG_ReplayMenu_C_ExecuteUbergraph_BP_UMG_ReplayMenu) == 0x000008, "Wrong alignment on BP_UMG_ReplayMenu_C_ExecuteUbergraph_BP_UMG_ReplayMenu");
static_assert(sizeof(BP_UMG_ReplayMenu_C_ExecuteUbergraph_BP_UMG_ReplayMenu) == 0x000030, "Wrong size on BP_UMG_ReplayMenu_C_ExecuteUbergraph_BP_UMG_ReplayMenu");
static_assert(offsetof(BP_UMG_ReplayMenu_C_ExecuteUbergraph_BP_UMG_ReplayMenu, EntryPoint) == 0x000000, "Member 'BP_UMG_ReplayMenu_C_ExecuteUbergraph_BP_UMG_ReplayMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenu_C_ExecuteUbergraph_BP_UMG_ReplayMenu, CallFunc_MakeLiteralBool_ReturnValue) == 0x000004, "Member 'BP_UMG_ReplayMenu_C_ExecuteUbergraph_BP_UMG_ReplayMenu::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenu_C_ExecuteUbergraph_BP_UMG_ReplayMenu, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'BP_UMG_ReplayMenu_C_ExecuteUbergraph_BP_UMG_ReplayMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenu_C_ExecuteUbergraph_BP_UMG_ReplayMenu, CallFunc_IsValid_ReturnValue_1) == 0x000006, "Member 'BP_UMG_ReplayMenu_C_ExecuteUbergraph_BP_UMG_ReplayMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenu_C_ExecuteUbergraph_BP_UMG_ReplayMenu, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BP_UMG_ReplayMenu_C_ExecuteUbergraph_BP_UMG_ReplayMenu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenu_C_ExecuteUbergraph_BP_UMG_ReplayMenu, CallFunc_GetGameInstance_ReturnValue) == 0x000010, "Member 'BP_UMG_ReplayMenu_C_ExecuteUbergraph_BP_UMG_ReplayMenu::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenu_C_ExecuteUbergraph_BP_UMG_ReplayMenu, K2Node_Event_bDeleteSucceeded) == 0x000018, "Member 'BP_UMG_ReplayMenu_C_ExecuteUbergraph_BP_UMG_ReplayMenu::K2Node_Event_bDeleteSucceeded' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenu_C_ExecuteUbergraph_BP_UMG_ReplayMenu, K2Node_DynamicCast_AsBP_Game_Instance) == 0x000020, "Member 'BP_UMG_ReplayMenu_C_ExecuteUbergraph_BP_UMG_ReplayMenu::K2Node_DynamicCast_AsBP_Game_Instance' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenu_C_ExecuteUbergraph_BP_UMG_ReplayMenu, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_UMG_ReplayMenu_C_ExecuteUbergraph_BP_UMG_ReplayMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_UMG_ReplayMenu.BP_UMG_ReplayMenu_C.Refresh
// 0x00B0 (0x00B0 - 0x0000)
struct BP_UMG_ReplayMenu_C_Refresh final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDemoEntry                             CallFunc_Array_Get_Item;                           // 0x0010(0x0080)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UMG_ReplayMenuRow_C*                CallFunc_Create_ReturnValue;                       // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UMG_ReplayMenu_C_Refresh) == 0x000008, "Wrong alignment on BP_UMG_ReplayMenu_C_Refresh");
static_assert(sizeof(BP_UMG_ReplayMenu_C_Refresh) == 0x0000B0, "Wrong size on BP_UMG_ReplayMenu_C_Refresh");
static_assert(offsetof(BP_UMG_ReplayMenu_C_Refresh, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_UMG_ReplayMenu_C_Refresh::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenu_C_Refresh, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_UMG_ReplayMenu_C_Refresh::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenu_C_Refresh, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_UMG_ReplayMenu_C_Refresh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenu_C_Refresh, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_UMG_ReplayMenu_C_Refresh::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenu_C_Refresh, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'BP_UMG_ReplayMenu_C_Refresh::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenu_C_Refresh, CallFunc_Less_IntInt_ReturnValue) == 0x000094, "Member 'BP_UMG_ReplayMenu_C_Refresh::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenu_C_Refresh, CallFunc_GetOwningPlayer_ReturnValue) == 0x000098, "Member 'BP_UMG_ReplayMenu_C_Refresh::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenu_C_Refresh, CallFunc_Create_ReturnValue) == 0x0000A0, "Member 'BP_UMG_ReplayMenu_C_Refresh::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenu_C_Refresh, CallFunc_AddChild_ReturnValue) == 0x0000A8, "Member 'BP_UMG_ReplayMenu_C_Refresh::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function BP_UMG_ReplayMenu.BP_UMG_ReplayMenu_C.ReplayDeleted
// 0x0001 (0x0001 - 0x0000)
struct BP_UMG_ReplayMenu_C_ReplayDeleted final
{
public:
	bool                                          bDeleteSucceeded;                                  // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UMG_ReplayMenu_C_ReplayDeleted) == 0x000001, "Wrong alignment on BP_UMG_ReplayMenu_C_ReplayDeleted");
static_assert(sizeof(BP_UMG_ReplayMenu_C_ReplayDeleted) == 0x000001, "Wrong size on BP_UMG_ReplayMenu_C_ReplayDeleted");
static_assert(offsetof(BP_UMG_ReplayMenu_C_ReplayDeleted, bDeleteSucceeded) == 0x000000, "Member 'BP_UMG_ReplayMenu_C_ReplayDeleted::bDeleteSucceeded' has a wrong offset!");

// Function BP_UMG_ReplayMenu.BP_UMG_ReplayMenu_C.ReplaySelected
// 0x0010 (0x0010 - 0x0000)
struct BP_UMG_ReplayMenu_C_ReplaySelected final
{
public:
	class UBP_UMG_ReplayMenuRow_C*                Replay_Row;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UMG_ReplayMenu_C_ReplaySelected) == 0x000008, "Wrong alignment on BP_UMG_ReplayMenu_C_ReplaySelected");
static_assert(sizeof(BP_UMG_ReplayMenu_C_ReplaySelected) == 0x000010, "Wrong size on BP_UMG_ReplayMenu_C_ReplaySelected");
static_assert(offsetof(BP_UMG_ReplayMenu_C_ReplaySelected, Replay_Row) == 0x000000, "Member 'BP_UMG_ReplayMenu_C_ReplaySelected::Replay_Row' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenu_C_ReplaySelected, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_UMG_ReplayMenu_C_ReplaySelected::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_UMG_ReplayMenu.BP_UMG_ReplayMenu_C.UpdateMenuTheme
// 0x0010 (0x0010 - 0x0000)
struct BP_UMG_ReplayMenu_C_UpdateMenuTheme final
{
public:
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetHour_ReturnValue;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue_1;             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue_2;             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UMG_ReplayMenu_C_UpdateMenuTheme) == 0x000008, "Wrong alignment on BP_UMG_ReplayMenu_C_UpdateMenuTheme");
static_assert(sizeof(BP_UMG_ReplayMenu_C_UpdateMenuTheme) == 0x000010, "Wrong size on BP_UMG_ReplayMenu_C_UpdateMenuTheme");
static_assert(offsetof(BP_UMG_ReplayMenu_C_UpdateMenuTheme, CallFunc_Now_ReturnValue) == 0x000000, "Member 'BP_UMG_ReplayMenu_C_UpdateMenuTheme::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenu_C_UpdateMenuTheme, CallFunc_GetHour_ReturnValue) == 0x000008, "Member 'BP_UMG_ReplayMenu_C_UpdateMenuTheme::CallFunc_GetHour_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenu_C_UpdateMenuTheme, CallFunc_InRange_IntInt_ReturnValue) == 0x00000C, "Member 'BP_UMG_ReplayMenu_C_UpdateMenuTheme::CallFunc_InRange_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenu_C_UpdateMenuTheme, CallFunc_InRange_IntInt_ReturnValue_1) == 0x00000D, "Member 'BP_UMG_ReplayMenu_C_UpdateMenuTheme::CallFunc_InRange_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenu_C_UpdateMenuTheme, CallFunc_InRange_IntInt_ReturnValue_2) == 0x00000E, "Member 'BP_UMG_ReplayMenu_C_UpdateMenuTheme::CallFunc_InRange_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UMG_ReplayMenu_C_UpdateMenuTheme, CallFunc_BooleanOR_ReturnValue) == 0x00000F, "Member 'BP_UMG_ReplayMenu_C_UpdateMenuTheme::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

