#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WorldAISpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WorldAISpawner.BP_WorldAISpawner_C
// 0x0060 (0x0670 - 0x0610)
class ABP_WorldAISpawner_C final : public ATIAIWorldSpawner
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    TreeFilter;                                        // 0x0620(0x0010)(Edit, BlueprintVisible)
	TArray<class UStaticMesh*>                    BushFilter;                                        // 0x0630(0x0010)(Edit, BlueprintVisible)
	TArray<class UStaticMesh*>                    GeneralFilter;                                     // 0x0640(0x0010)(Edit, BlueprintVisible)
	bool                                          bSpawnJump;                                        // 0x0650(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSpawnSound;                                       // 0x0651(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_652[0x6];                                      // 0x0652(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TotalMemory;                                       // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalPoints;                                       // 0x0660(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_WorldAISpawner(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WorldAISpawner_C">();
	}
	static class ABP_WorldAISpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WorldAISpawner_C>();
	}
};
static_assert(alignof(ABP_WorldAISpawner_C) == 0x000010, "Wrong alignment on ABP_WorldAISpawner_C");
static_assert(sizeof(ABP_WorldAISpawner_C) == 0x000670, "Wrong size on ABP_WorldAISpawner_C");
static_assert(offsetof(ABP_WorldAISpawner_C, UberGraphFrame) == 0x000610, "Member 'ABP_WorldAISpawner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_WorldAISpawner_C, DefaultSceneRoot) == 0x000618, "Member 'ABP_WorldAISpawner_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_WorldAISpawner_C, TreeFilter) == 0x000620, "Member 'ABP_WorldAISpawner_C::TreeFilter' has a wrong offset!");
static_assert(offsetof(ABP_WorldAISpawner_C, BushFilter) == 0x000630, "Member 'ABP_WorldAISpawner_C::BushFilter' has a wrong offset!");
static_assert(offsetof(ABP_WorldAISpawner_C, GeneralFilter) == 0x000640, "Member 'ABP_WorldAISpawner_C::GeneralFilter' has a wrong offset!");
static_assert(offsetof(ABP_WorldAISpawner_C, bSpawnJump) == 0x000650, "Member 'ABP_WorldAISpawner_C::bSpawnJump' has a wrong offset!");
static_assert(offsetof(ABP_WorldAISpawner_C, bSpawnSound) == 0x000651, "Member 'ABP_WorldAISpawner_C::bSpawnSound' has a wrong offset!");
static_assert(offsetof(ABP_WorldAISpawner_C, TotalMemory) == 0x000658, "Member 'ABP_WorldAISpawner_C::TotalMemory' has a wrong offset!");
static_assert(offsetof(ABP_WorldAISpawner_C, TotalPoints) == 0x000660, "Member 'ABP_WorldAISpawner_C::TotalPoints' has a wrong offset!");

}

