#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WildPotatoVine

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_WildPotatoVine.BP_WildPotatoVine_C.ExecuteUbergraph_BP_WildPotatoVine
// 0x0058 (0x0058 - 0x0000)
struct BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine) == 0x000008, "Wrong alignment on BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine");
static_assert(sizeof(BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine) == 0x000058, "Wrong size on BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine");
static_assert(offsetof(BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine, EntryPoint) == 0x000000, "Member 'BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000020, "Member 'BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine, CallFunc_SpawnEmitterAtLocation_ReturnValue_1) == 0x000028, "Member 'BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine::CallFunc_SpawnEmitterAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine, Temp_bool_IsClosed_Variable) == 0x000030, "Member 'BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000038, "Member 'BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine, CallFunc_GetDistanceTo_ReturnValue) == 0x000044, "Member 'BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000050, "Member 'BP_WildPotatoVine_C_ExecuteUbergraph_BP_WildPotatoVine::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

