#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAN_Generic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPAN_Generic.BPAN_Generic_C.GetNotifyName
// 0x0028 (0x0028 - 0x0000)
struct BPAN_Generic_C_GetNotifyName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FName                                   CallFunc_GetTagName_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BPAN_Generic_C_GetNotifyName) == 0x000008, "Wrong alignment on BPAN_Generic_C_GetNotifyName");
static_assert(sizeof(BPAN_Generic_C_GetNotifyName) == 0x000028, "Wrong size on BPAN_Generic_C_GetNotifyName");
static_assert(offsetof(BPAN_Generic_C_GetNotifyName, ReturnValue) == 0x000000, "Member 'BPAN_Generic_C_GetNotifyName::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_Generic_C_GetNotifyName, CallFunc_GetTagName_ReturnValue) == 0x000010, "Member 'BPAN_Generic_C_GetNotifyName::CallFunc_GetTagName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_Generic_C_GetNotifyName, CallFunc_Conv_NameToString_ReturnValue) == 0x000018, "Member 'BPAN_Generic_C_GetNotifyName::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");

// Function BPAN_Generic.BPAN_Generic_C.Received_Notify
// 0x0088 (0x0088 - 0x0000)
struct BPAN_Generic_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATICharacterBase*                       K2Node_DynamicCast_AsThe_Isle_Character_Base;      // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPAN_Generic_C_Received_Notify) == 0x000008, "Wrong alignment on BPAN_Generic_C_Received_Notify");
static_assert(sizeof(BPAN_Generic_C_Received_Notify) == 0x000088, "Wrong size on BPAN_Generic_C_Received_Notify");
static_assert(offsetof(BPAN_Generic_C_Received_Notify, MeshComp) == 0x000000, "Member 'BPAN_Generic_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(BPAN_Generic_C_Received_Notify, Animation) == 0x000008, "Member 'BPAN_Generic_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(BPAN_Generic_C_Received_Notify, EventReference) == 0x000010, "Member 'BPAN_Generic_C_Received_Notify::EventReference' has a wrong offset!");
static_assert(offsetof(BPAN_Generic_C_Received_Notify, ReturnValue) == 0x000040, "Member 'BPAN_Generic_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_Generic_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'BPAN_Generic_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_Generic_C_Received_Notify, K2Node_DynamicCast_AsThe_Isle_Character_Base) == 0x000050, "Member 'BPAN_Generic_C_Received_Notify::K2Node_DynamicCast_AsThe_Isle_Character_Base' has a wrong offset!");
static_assert(offsetof(BPAN_Generic_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BPAN_Generic_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPAN_Generic_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'BPAN_Generic_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_Generic_C_Received_Notify, CallFunc_GetVelocity_ReturnValue) == 0x000060, "Member 'BPAN_Generic_C_Received_Notify::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_Generic_C_Received_Notify, CallFunc_VSize_ReturnValue) == 0x000078, "Member 'BPAN_Generic_C_Received_Notify::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_Generic_C_Received_Notify, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000080, "Member 'BPAN_Generic_C_Received_Notify::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");

}

