#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAN_VocalAbilities

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "TheIsle_structs.hpp"


namespace SDK::Params
{

// Function BPAN_VocalAbilities.BPAN_VocalAbilities_C.Received_Notify
// 0x02C0 (0x02C0 - 0x0000)
struct BPAN_VocalAbilities_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FinalVolume;                                       // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RawMagnitude;                                      // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CalculatedValue;                                   // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FinalResult;                                       // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     WeightAttribute;                                   // 0x0068(0x0038)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FGameplayAttribute                     MaxHealth;                                         // 0x00A0(0x0038)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FGameplayAttribute                     Health;                                            // 0x00D8(0x0038)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FGameplayAttribute                     StaminaMax;                                        // 0x0110(0x0038)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FGameplayAttribute                     Stamina;                                           // 0x0148(0x0038)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UCurveFloat*                            VocalCurveToUse;                                   // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATIDinosaurBase*                        TheOwner;                                          // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATICharacterBase*                       K2Node_DynamicCast_AsThe_Isle_Character_Base;      // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATIDinosaurBase*                        K2Node_DynamicCast_AsThe_Isle_Dinosaur_Base;       // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIReplayPlayerController*              K2Node_DynamicCast_AsTIReplay_Player_Controller;   // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D3[0x1];                                      // 0x01D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_IsLifecycleMutationEquipped_ReturnValue;  // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGrowthFromJuvenileToAdult_ReturnValue; // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTIGameHUDWidget*                       CallFunc_GetGameHUD_ReturnValue;                   // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1; // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue_1;          // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_2; // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue_2;          // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_3; // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue_3;          // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22A[0x2];                                      // 0x022A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRoarFrequencyValue_ReturnValue;        // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVocals                                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0248(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0270(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27B[0x1];                                      // 0x027B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast; // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_InFloat_ImplicitCast;   // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_UpdateVocalRoarProgressBar_InPercent_ImplicitCast; // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_InFloat_ImplicitCast_1; // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast_1;     // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast_1;     // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1;   // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPAN_VocalAbilities_C_Received_Notify) == 0x000008, "Wrong alignment on BPAN_VocalAbilities_C_Received_Notify");
static_assert(sizeof(BPAN_VocalAbilities_C_Received_Notify) == 0x0002C0, "Wrong size on BPAN_VocalAbilities_C_Received_Notify");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, MeshComp) == 0x000000, "Member 'BPAN_VocalAbilities_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, Animation) == 0x000008, "Member 'BPAN_VocalAbilities_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, EventReference) == 0x000010, "Member 'BPAN_VocalAbilities_C_Received_Notify::EventReference' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, ReturnValue) == 0x000040, "Member 'BPAN_VocalAbilities_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, FinalVolume) == 0x000048, "Member 'BPAN_VocalAbilities_C_Received_Notify::FinalVolume' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, RawMagnitude) == 0x000050, "Member 'BPAN_VocalAbilities_C_Received_Notify::RawMagnitude' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CalculatedValue) == 0x000058, "Member 'BPAN_VocalAbilities_C_Received_Notify::CalculatedValue' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, FinalResult) == 0x000060, "Member 'BPAN_VocalAbilities_C_Received_Notify::FinalResult' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, WeightAttribute) == 0x000068, "Member 'BPAN_VocalAbilities_C_Received_Notify::WeightAttribute' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, MaxHealth) == 0x0000A0, "Member 'BPAN_VocalAbilities_C_Received_Notify::MaxHealth' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, Health) == 0x0000D8, "Member 'BPAN_VocalAbilities_C_Received_Notify::Health' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, StaminaMax) == 0x000110, "Member 'BPAN_VocalAbilities_C_Received_Notify::StaminaMax' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, Stamina) == 0x000148, "Member 'BPAN_VocalAbilities_C_Received_Notify::Stamina' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, VocalCurveToUse) == 0x000180, "Member 'BPAN_VocalAbilities_C_Received_Notify::VocalCurveToUse' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, TheOwner) == 0x000188, "Member 'BPAN_VocalAbilities_C_Received_Notify::TheOwner' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_IsDedicatedServer_ReturnValue) == 0x000190, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000198, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, K2Node_DynamicCast_AsThe_Isle_Character_Base) == 0x0001A0, "Member 'BPAN_VocalAbilities_C_Received_Notify::K2Node_DynamicCast_AsThe_Isle_Character_Base' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x0001A8, "Member 'BPAN_VocalAbilities_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_GetPlayerController_ReturnValue) == 0x0001B0, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, K2Node_DynamicCast_AsThe_Isle_Dinosaur_Base) == 0x0001B8, "Member 'BPAN_VocalAbilities_C_Received_Notify::K2Node_DynamicCast_AsThe_Isle_Dinosaur_Base' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, K2Node_DynamicCast_bSuccess_1) == 0x0001C0, "Member 'BPAN_VocalAbilities_C_Received_Notify::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, K2Node_DynamicCast_AsTIReplay_Player_Controller) == 0x0001C8, "Member 'BPAN_VocalAbilities_C_Received_Notify::K2Node_DynamicCast_AsTIReplay_Player_Controller' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, K2Node_DynamicCast_bSuccess_2) == 0x0001D0, "Member 'BPAN_VocalAbilities_C_Received_Notify::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0001D1, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x0001D2, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_IsLifecycleMutationEquipped_ReturnValue) == 0x0001D4, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_IsLifecycleMutationEquipped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0001D8, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x0001E0, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_GetGrowthFromJuvenileToAdult_ReturnValue) == 0x0001E4, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_GetGrowthFromJuvenileToAdult_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_IsValid_ReturnValue_1) == 0x0001E8, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_GetGameHUD_ReturnValue) == 0x0001F0, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_GetGameHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x0001F8, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_GetFloatAttribute_ReturnValue) == 0x0001FC, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1) == 0x000200, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_GetFloatAttribute_ReturnValue_1) == 0x000204, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_GetFloatAttribute_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_2) == 0x000208, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_2' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_GetFloatAttribute_ReturnValue_2) == 0x00020C, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_GetFloatAttribute_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_3) == 0x000210, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_3' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_GetFloatAttribute_ReturnValue_3) == 0x000214, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_GetFloatAttribute_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000218, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000220, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000228, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000229, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_GetRoarFrequencyValue_ReturnValue) == 0x00022C, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_GetRoarFrequencyValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000230, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_FClamp_ReturnValue) == 0x000238, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x000240, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_IsValid_ReturnValue_2) == 0x000241, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_GetDataTableRowFromName_OutRow) == 0x000248, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000268, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000270, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_IsValid_ReturnValue_3) == 0x000278, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000279, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_BooleanAND_ReturnValue) == 0x00027A, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast) == 0x00027C, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x000280, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_SetFloatParameter_InFloat_ImplicitCast) == 0x000288, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_SetFloatParameter_InFloat_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_UpdateVocalRoarProgressBar_InPercent_ImplicitCast) == 0x00028C, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_UpdateVocalRoarProgressBar_InPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_SetFloatParameter_InFloat_ImplicitCast_1) == 0x000290, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_SetFloatParameter_InFloat_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000298, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_Divide_DoubleDouble_B_ImplicitCast_1) == 0x0002A0, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_Divide_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x0002A8, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_Divide_DoubleDouble_A_ImplicitCast_1) == 0x0002B0, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_Divide_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BPAN_VocalAbilities_C_Received_Notify, CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1) == 0x0002B8, "Member 'BPAN_VocalAbilities_C_Received_Notify::CallFunc_Subtract_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");

}

