#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAN_BreathAnimNotify

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPAN_BreathAnimNotify.BPAN_BreathAnimNotify_C.Received_Notify
// 0x00A0 (0x00A0 - 0x0000)
struct BPAN_BreathAnimNotify_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATICharacterBase*                       K2Node_DynamicCast_AsThe_Isle_Character_Base;      // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGrowthFromJuvenileToAdult_ReturnValue; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxStamina_ReturnValue;                // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStamina_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPAN_BreathAnimNotify_C_Received_Notify) == 0x000008, "Wrong alignment on BPAN_BreathAnimNotify_C_Received_Notify");
static_assert(sizeof(BPAN_BreathAnimNotify_C_Received_Notify) == 0x0000A0, "Wrong size on BPAN_BreathAnimNotify_C_Received_Notify");
static_assert(offsetof(BPAN_BreathAnimNotify_C_Received_Notify, MeshComp) == 0x000000, "Member 'BPAN_BreathAnimNotify_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(BPAN_BreathAnimNotify_C_Received_Notify, Animation) == 0x000008, "Member 'BPAN_BreathAnimNotify_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(BPAN_BreathAnimNotify_C_Received_Notify, EventReference) == 0x000010, "Member 'BPAN_BreathAnimNotify_C_Received_Notify::EventReference' has a wrong offset!");
static_assert(offsetof(BPAN_BreathAnimNotify_C_Received_Notify, ReturnValue) == 0x000040, "Member 'BPAN_BreathAnimNotify_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_BreathAnimNotify_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'BPAN_BreathAnimNotify_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_BreathAnimNotify_C_Received_Notify, K2Node_DynamicCast_AsThe_Isle_Character_Base) == 0x000050, "Member 'BPAN_BreathAnimNotify_C_Received_Notify::K2Node_DynamicCast_AsThe_Isle_Character_Base' has a wrong offset!");
static_assert(offsetof(BPAN_BreathAnimNotify_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BPAN_BreathAnimNotify_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPAN_BreathAnimNotify_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'BPAN_BreathAnimNotify_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_BreathAnimNotify_C_Received_Notify, CallFunc_GetGrowthFromJuvenileToAdult_ReturnValue) == 0x00005C, "Member 'BPAN_BreathAnimNotify_C_Received_Notify::CallFunc_GetGrowthFromJuvenileToAdult_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_BreathAnimNotify_C_Received_Notify, CallFunc_GetMaxStamina_ReturnValue) == 0x000060, "Member 'BPAN_BreathAnimNotify_C_Received_Notify::CallFunc_GetMaxStamina_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_BreathAnimNotify_C_Received_Notify, CallFunc_GetStamina_ReturnValue) == 0x000064, "Member 'BPAN_BreathAnimNotify_C_Received_Notify::CallFunc_GetStamina_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_BreathAnimNotify_C_Received_Notify, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000068, "Member 'BPAN_BreathAnimNotify_C_Received_Notify::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_BreathAnimNotify_C_Received_Notify, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000070, "Member 'BPAN_BreathAnimNotify_C_Received_Notify::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_BreathAnimNotify_C_Received_Notify, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000078, "Member 'BPAN_BreathAnimNotify_C_Received_Notify::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_BreathAnimNotify_C_Received_Notify, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000080, "Member 'BPAN_BreathAnimNotify_C_Received_Notify::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAN_BreathAnimNotify_C_Received_Notify, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000088, "Member 'BPAN_BreathAnimNotify_C_Received_Notify::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPAN_BreathAnimNotify_C_Received_Notify, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000090, "Member 'BPAN_BreathAnimNotify_C_Received_Notify::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BPAN_BreathAnimNotify_C_Received_Notify, CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast) == 0x000098, "Member 'BPAN_BreathAnimNotify_C_Received_Notify::CallFunc_SpawnSoundAttached_VolumeMultiplier_ImplicitCast' has a wrong offset!");

}

