#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAN_BreathAnimNotify

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPAN_BreathAnimNotify.BPAN_BreathAnimNotify_C
// 0x0080 (0x00B8 - 0x0038)
class UBPAN_BreathAnimNotify_C final : public UAnimNotify
{
public:
	struct FGameplayAttribute                     MainAttribute;                                     // 0x0038(0x0038)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FGameplayAttribute                     MaxAttribute;                                      // 0x0070(0x0038)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class USoundBase*                             SoundCue;                                          // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        PercentageOfActualAttribute;                       // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPAN_BreathAnimNotify_C">();
	}
	static class UBPAN_BreathAnimNotify_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPAN_BreathAnimNotify_C>();
	}
};
static_assert(alignof(UBPAN_BreathAnimNotify_C) == 0x000008, "Wrong alignment on UBPAN_BreathAnimNotify_C");
static_assert(sizeof(UBPAN_BreathAnimNotify_C) == 0x0000B8, "Wrong size on UBPAN_BreathAnimNotify_C");
static_assert(offsetof(UBPAN_BreathAnimNotify_C, MainAttribute) == 0x000038, "Member 'UBPAN_BreathAnimNotify_C::MainAttribute' has a wrong offset!");
static_assert(offsetof(UBPAN_BreathAnimNotify_C, MaxAttribute) == 0x000070, "Member 'UBPAN_BreathAnimNotify_C::MaxAttribute' has a wrong offset!");
static_assert(offsetof(UBPAN_BreathAnimNotify_C, SoundCue) == 0x0000A8, "Member 'UBPAN_BreathAnimNotify_C::SoundCue' has a wrong offset!");
static_assert(offsetof(UBPAN_BreathAnimNotify_C, PercentageOfActualAttribute) == 0x0000B0, "Member 'UBPAN_BreathAnimNotify_C::PercentageOfActualAttribute' has a wrong offset!");

}

