#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_Utilities

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPFL_Utilities.BPFL_Utilities_C.DistanceTo
// 0x0060 (0x0060 - 0x0000)
struct BPFL_Utilities_C_DistanceTo final
{
public:
	struct FVector                                A;                                                 // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                B;                                                 // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Utilities_C_DistanceTo) == 0x000008, "Wrong alignment on BPFL_Utilities_C_DistanceTo");
static_assert(sizeof(BPFL_Utilities_C_DistanceTo) == 0x000060, "Wrong size on BPFL_Utilities_C_DistanceTo");
static_assert(offsetof(BPFL_Utilities_C_DistanceTo, A) == 0x000000, "Member 'BPFL_Utilities_C_DistanceTo::A' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_DistanceTo, B) == 0x000018, "Member 'BPFL_Utilities_C_DistanceTo::B' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_DistanceTo, __WorldContext) == 0x000030, "Member 'BPFL_Utilities_C_DistanceTo::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_DistanceTo, ReturnValue) == 0x000038, "Member 'BPFL_Utilities_C_DistanceTo::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_DistanceTo, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000040, "Member 'BPFL_Utilities_C_DistanceTo::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_DistanceTo, CallFunc_VSize_ReturnValue) == 0x000058, "Member 'BPFL_Utilities_C_DistanceTo::CallFunc_VSize_ReturnValue' has a wrong offset!");

// Function BPFL_Utilities.BPFL_Utilities_C.GetActorOfClass
// 0x0058 (0x0058 - 0x0000)
struct BPFL_Utilities_C_GetActorOfClass final
{
public:
	class UClass*                                 ActorClass;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0028(0x0010)(ReferenceParm)
	class AActor*                                 Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Select_Default;                             // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Utilities_C_GetActorOfClass) == 0x000008, "Wrong alignment on BPFL_Utilities_C_GetActorOfClass");
static_assert(sizeof(BPFL_Utilities_C_GetActorOfClass) == 0x000058, "Wrong size on BPFL_Utilities_C_GetActorOfClass");
static_assert(offsetof(BPFL_Utilities_C_GetActorOfClass, ActorClass) == 0x000000, "Member 'BPFL_Utilities_C_GetActorOfClass::ActorClass' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_GetActorOfClass, __WorldContext) == 0x000008, "Member 'BPFL_Utilities_C_GetActorOfClass::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_GetActorOfClass, Success) == 0x000010, "Member 'BPFL_Utilities_C_GetActorOfClass::Success' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_GetActorOfClass, ReturnValue) == 0x000018, "Member 'BPFL_Utilities_C_GetActorOfClass::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_GetActorOfClass, Temp_bool_Variable) == 0x000020, "Member 'BPFL_Utilities_C_GetActorOfClass::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_GetActorOfClass, CallFunc_GetAllActorsOfClass_OutActors) == 0x000028, "Member 'BPFL_Utilities_C_GetActorOfClass::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_GetActorOfClass, Temp_object_Variable) == 0x000038, "Member 'BPFL_Utilities_C_GetActorOfClass::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_GetActorOfClass, CallFunc_Array_Get_Item) == 0x000040, "Member 'BPFL_Utilities_C_GetActorOfClass::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_GetActorOfClass, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BPFL_Utilities_C_GetActorOfClass::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_GetActorOfClass, CallFunc_Greater_IntInt_ReturnValue) == 0x00004C, "Member 'BPFL_Utilities_C_GetActorOfClass::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_GetActorOfClass, K2Node_Select_Default) == 0x000050, "Member 'BPFL_Utilities_C_GetActorOfClass::K2Node_Select_Default' has a wrong offset!");

// Function BPFL_Utilities.BPFL_Utilities_C.GetGameState
// 0x0028 (0x0028 - 0x0000)
struct BPFL_Utilities_C_GetGameState final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATIGameStateBase*                       Return_Value;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATIGameStateBase*                       K2Node_DynamicCast_AsThe_Isle_Game_State_Base;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Utilities_C_GetGameState) == 0x000008, "Wrong alignment on BPFL_Utilities_C_GetGameState");
static_assert(sizeof(BPFL_Utilities_C_GetGameState) == 0x000028, "Wrong size on BPFL_Utilities_C_GetGameState");
static_assert(offsetof(BPFL_Utilities_C_GetGameState, __WorldContext) == 0x000000, "Member 'BPFL_Utilities_C_GetGameState::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_GetGameState, Return_Value) == 0x000008, "Member 'BPFL_Utilities_C_GetGameState::Return_Value' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_GetGameState, CallFunc_GetGameState_ReturnValue) == 0x000010, "Member 'BPFL_Utilities_C_GetGameState::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_GetGameState, K2Node_DynamicCast_AsThe_Isle_Game_State_Base) == 0x000018, "Member 'BPFL_Utilities_C_GetGameState::K2Node_DynamicCast_AsThe_Isle_Game_State_Base' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_GetGameState, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BPFL_Utilities_C_GetGameState::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BPFL_Utilities.BPFL_Utilities_C.IsClassInArray
// 0x0070 (0x0070 - 0x0000)
struct BPFL_Utilities_C_IsClassInArray final
{
public:
	TArray<class UClass*>                         ClassArray;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UClass*                                 Class_0;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         InClassArray;                                      // 0x0028(0x0010)(Edit, BlueprintVisible)
	bool                                          OutBool;                                           // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 InClass;                                           // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F[0x1];                                       // 0x005F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Utilities_C_IsClassInArray) == 0x000008, "Wrong alignment on BPFL_Utilities_C_IsClassInArray");
static_assert(sizeof(BPFL_Utilities_C_IsClassInArray) == 0x000070, "Wrong size on BPFL_Utilities_C_IsClassInArray");
static_assert(offsetof(BPFL_Utilities_C_IsClassInArray, ClassArray) == 0x000000, "Member 'BPFL_Utilities_C_IsClassInArray::ClassArray' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsClassInArray, Class_0) == 0x000010, "Member 'BPFL_Utilities_C_IsClassInArray::Class_0' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsClassInArray, __WorldContext) == 0x000018, "Member 'BPFL_Utilities_C_IsClassInArray::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsClassInArray, ReturnValue) == 0x000020, "Member 'BPFL_Utilities_C_IsClassInArray::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsClassInArray, InClassArray) == 0x000028, "Member 'BPFL_Utilities_C_IsClassInArray::InClassArray' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsClassInArray, OutBool) == 0x000038, "Member 'BPFL_Utilities_C_IsClassInArray::OutBool' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsClassInArray, InClass) == 0x000040, "Member 'BPFL_Utilities_C_IsClassInArray::InClass' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsClassInArray, Temp_bool_True_if_break_was_hit_Variable) == 0x000048, "Member 'BPFL_Utilities_C_IsClassInArray::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsClassInArray, CallFunc_Not_PreBool_ReturnValue) == 0x000049, "Member 'BPFL_Utilities_C_IsClassInArray::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsClassInArray, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'BPFL_Utilities_C_IsClassInArray::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsClassInArray, CallFunc_Array_Get_Item) == 0x000050, "Member 'BPFL_Utilities_C_IsClassInArray::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsClassInArray, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'BPFL_Utilities_C_IsClassInArray::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsClassInArray, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x00005C, "Member 'BPFL_Utilities_C_IsClassInArray::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsClassInArray, CallFunc_ClassIsChildOf_ReturnValue) == 0x00005D, "Member 'BPFL_Utilities_C_IsClassInArray::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsClassInArray, CallFunc_BooleanOR_ReturnValue) == 0x00005E, "Member 'BPFL_Utilities_C_IsClassInArray::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsClassInArray, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'BPFL_Utilities_C_IsClassInArray::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsClassInArray, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'BPFL_Utilities_C_IsClassInArray::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsClassInArray, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'BPFL_Utilities_C_IsClassInArray::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsClassInArray, CallFunc_BooleanAND_ReturnValue) == 0x00006C, "Member 'BPFL_Utilities_C_IsClassInArray::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BPFL_Utilities.BPFL_Utilities_C.IsDinosaurType
// 0x0018 (0x0018 - 0x0000)
struct BPFL_Utilities_C_IsDinosaurType final
{
public:
	uint8                                         CharacterType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Utilities_C_IsDinosaurType) == 0x000008, "Wrong alignment on BPFL_Utilities_C_IsDinosaurType");
static_assert(sizeof(BPFL_Utilities_C_IsDinosaurType) == 0x000018, "Wrong size on BPFL_Utilities_C_IsDinosaurType");
static_assert(offsetof(BPFL_Utilities_C_IsDinosaurType, CharacterType) == 0x000000, "Member 'BPFL_Utilities_C_IsDinosaurType::CharacterType' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsDinosaurType, __WorldContext) == 0x000008, "Member 'BPFL_Utilities_C_IsDinosaurType::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsDinosaurType, ReturnValue) == 0x000010, "Member 'BPFL_Utilities_C_IsDinosaurType::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsDinosaurType, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'BPFL_Utilities_C_IsDinosaurType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BPFL_Utilities.BPFL_Utilities_C.IsFurtherThan
// 0x0058 (0x0058 - 0x0000)
struct BPFL_Utilities_C_IsFurtherThan final
{
public:
	struct FVector                                A;                                                 // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                B;                                                 // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Distance;                                          // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_DistanceTo_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Utilities_C_IsFurtherThan) == 0x000008, "Wrong alignment on BPFL_Utilities_C_IsFurtherThan");
static_assert(sizeof(BPFL_Utilities_C_IsFurtherThan) == 0x000058, "Wrong size on BPFL_Utilities_C_IsFurtherThan");
static_assert(offsetof(BPFL_Utilities_C_IsFurtherThan, A) == 0x000000, "Member 'BPFL_Utilities_C_IsFurtherThan::A' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsFurtherThan, B) == 0x000018, "Member 'BPFL_Utilities_C_IsFurtherThan::B' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsFurtherThan, Distance) == 0x000030, "Member 'BPFL_Utilities_C_IsFurtherThan::Distance' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsFurtherThan, __WorldContext) == 0x000038, "Member 'BPFL_Utilities_C_IsFurtherThan::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsFurtherThan, ReturnValue) == 0x000040, "Member 'BPFL_Utilities_C_IsFurtherThan::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsFurtherThan, CallFunc_DistanceTo_ReturnValue) == 0x000048, "Member 'BPFL_Utilities_C_IsFurtherThan::CallFunc_DistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsFurtherThan, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000050, "Member 'BPFL_Utilities_C_IsFurtherThan::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");

// Function BPFL_Utilities.BPFL_Utilities_C.IsHumanType
// 0x0018 (0x0018 - 0x0000)
struct BPFL_Utilities_C_IsHumanType final
{
public:
	uint8                                         CharacterType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Utilities_C_IsHumanType) == 0x000008, "Wrong alignment on BPFL_Utilities_C_IsHumanType");
static_assert(sizeof(BPFL_Utilities_C_IsHumanType) == 0x000018, "Wrong size on BPFL_Utilities_C_IsHumanType");
static_assert(offsetof(BPFL_Utilities_C_IsHumanType, CharacterType) == 0x000000, "Member 'BPFL_Utilities_C_IsHumanType::CharacterType' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsHumanType, __WorldContext) == 0x000008, "Member 'BPFL_Utilities_C_IsHumanType::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsHumanType, ReturnValue) == 0x000010, "Member 'BPFL_Utilities_C_IsHumanType::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsHumanType, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'BPFL_Utilities_C_IsHumanType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BPFL_Utilities.BPFL_Utilities_C.IsInMenu
// 0x0018 (0x0018 - 0x0000)
struct BPFL_Utilities_C_IsInMenu final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Utilities_C_IsInMenu) == 0x000008, "Wrong alignment on BPFL_Utilities_C_IsInMenu");
static_assert(sizeof(BPFL_Utilities_C_IsInMenu) == 0x000018, "Wrong size on BPFL_Utilities_C_IsInMenu");
static_assert(offsetof(BPFL_Utilities_C_IsInMenu, Widget) == 0x000000, "Member 'BPFL_Utilities_C_IsInMenu::Widget' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsInMenu, __WorldContext) == 0x000008, "Member 'BPFL_Utilities_C_IsInMenu::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsInMenu, ReturnValue) == 0x000010, "Member 'BPFL_Utilities_C_IsInMenu::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_IsInMenu, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'BPFL_Utilities_C_IsInMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BPFL_Utilities.BPFL_Utilities_C.Len
// 0x0038 (0x0038 - 0x0000)
struct BPFL_Utilities_C_Len final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Utilities_C_Len) == 0x000008, "Wrong alignment on BPFL_Utilities_C_Len");
static_assert(sizeof(BPFL_Utilities_C_Len) == 0x000038, "Wrong size on BPFL_Utilities_C_Len");
static_assert(offsetof(BPFL_Utilities_C_Len, Text) == 0x000000, "Member 'BPFL_Utilities_C_Len::Text' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_Len, __WorldContext) == 0x000010, "Member 'BPFL_Utilities_C_Len::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_Len, ReturnValue) == 0x000018, "Member 'BPFL_Utilities_C_Len::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_Len, CallFunc_Conv_TextToString_ReturnValue) == 0x000020, "Member 'BPFL_Utilities_C_Len::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_Len, CallFunc_Len_ReturnValue) == 0x000030, "Member 'BPFL_Utilities_C_Len::CallFunc_Len_ReturnValue' has a wrong offset!");

// Function BPFL_Utilities.BPFL_Utilities_C.SafeSetActive
// 0x0020 (0x0020 - 0x0000)
struct BPFL_Utilities_C_SafeSetActive final
{
public:
	class USceneComponent*                        Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          NewActive;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Reset;                                             // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Utilities_C_SafeSetActive) == 0x000008, "Wrong alignment on BPFL_Utilities_C_SafeSetActive");
static_assert(sizeof(BPFL_Utilities_C_SafeSetActive) == 0x000020, "Wrong size on BPFL_Utilities_C_SafeSetActive");
static_assert(offsetof(BPFL_Utilities_C_SafeSetActive, Component) == 0x000000, "Member 'BPFL_Utilities_C_SafeSetActive::Component' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_SafeSetActive, NewActive) == 0x000008, "Member 'BPFL_Utilities_C_SafeSetActive::NewActive' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_SafeSetActive, Reset) == 0x000009, "Member 'BPFL_Utilities_C_SafeSetActive::Reset' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_SafeSetActive, __WorldContext) == 0x000010, "Member 'BPFL_Utilities_C_SafeSetActive::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_SafeSetActive, CallFunc_IsActive_ReturnValue) == 0x000018, "Member 'BPFL_Utilities_C_SafeSetActive::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_SafeSetActive, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000019, "Member 'BPFL_Utilities_C_SafeSetActive::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function BPFL_Utilities.BPFL_Utilities_C.SafeSetVisibility
// 0x0020 (0x0020 - 0x0000)
struct BPFL_Utilities_C_SafeSetVisibility final
{
public:
	class USceneComponent*                        Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVisibility;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PropagateToChildren;                               // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPFL_Utilities_C_SafeSetVisibility) == 0x000008, "Wrong alignment on BPFL_Utilities_C_SafeSetVisibility");
static_assert(sizeof(BPFL_Utilities_C_SafeSetVisibility) == 0x000020, "Wrong size on BPFL_Utilities_C_SafeSetVisibility");
static_assert(offsetof(BPFL_Utilities_C_SafeSetVisibility, Component) == 0x000000, "Member 'BPFL_Utilities_C_SafeSetVisibility::Component' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_SafeSetVisibility, NewVisibility) == 0x000008, "Member 'BPFL_Utilities_C_SafeSetVisibility::NewVisibility' has a wrong offset!");
static_assert(offsetof(BPFL_Utilities_C_SafeSetVisibility, PropagateToChildren) == 0x000009, "Member 'BPFL_Utilities_C_SafeSetVisibility::PropagateToChildren' has a wrong offset!");
