#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BS_AquaticInteractionData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct BS_AquaticInteractionData.BS_AquaticInteractionData
// 0x0028 (0x0028 - 0x0000)
struct FBS_AquaticInteractionData final
{
public:
	float                                         Force_10_2F4FD72F49BCBB81FA9729A268993C4D;         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Torque_26_BFFA81594F81A9D829E82083436A0590;        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomOffset_35_2B37AF5E4D20E2DF8559718620844133;  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius_12_E1550A634ADBB4EA56E2B1AE4AEDF60B;        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Importance_14_B5BEDFB9418E67A384EBA79581DA1AA7;    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxForce_34_6499E59046192D125441009588B75BF6;      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxDistance_29_6BEF08A8488CE3949B1C5C8AEB936920;   // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SplashEmiter_53_9482201B42685C048A4C0D9D95A8BD4D;  // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SplashOffsetZ_44_5B2896334632B17A889BCC8B2D45A465; // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SplashEmiterScale_68_B58ED4F243C46D959CA73D81C8FC7485; // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FBS_AquaticInteractionData) == 0x000004, "Wrong alignment on FBS_AquaticInteractionData");
static_assert(sizeof(FBS_AquaticInteractionData) == 0x000028, "Wrong size on FBS_AquaticInteractionData");
static_assert(offsetof(FBS_AquaticInteractionData, Force_10_2F4FD72F49BCBB81FA9729A268993C4D) == 0x000000, "Member 'FBS_AquaticInteractionData::Force_10_2F4FD72F49BCBB81FA9729A268993C4D' has a wrong offset!");
static_assert(offsetof(FBS_AquaticInteractionData, Torque_26_BFFA81594F81A9D829E82083436A0590) == 0x000004, "Member 'FBS_AquaticInteractionData::Torque_26_BFFA81594F81A9D829E82083436A0590' has a wrong offset!");
static_assert(offsetof(FBS_AquaticInteractionData, RandomOffset_35_2B37AF5E4D20E2DF8559718620844133) == 0x000008, "Member 'FBS_AquaticInteractionData::RandomOffset_35_2B37AF5E4D20E2DF8559718620844133' has a wrong offset!");
static_assert(offsetof(FBS_AquaticInteractionData, Radius_12_E1550A634ADBB4EA56E2B1AE4AEDF60B) == 0x00000C, "Member 'FBS_AquaticInteractionData::Radius_12_E1550A634ADBB4EA56E2B1AE4AEDF60B' has a wrong offset!");
static_assert(offsetof(FBS_AquaticInteractionData, Importance_14_B5BEDFB9418E67A384EBA79581DA1AA7) == 0x000010, "Member 'FBS_AquaticInteractionData::Importance_14_B5BEDFB9418E67A384EBA79581DA1AA7' has a wrong offset!");
static_assert(offsetof(FBS_AquaticInteractionData, MaxForce_34_6499E59046192D125441009588B75BF6) == 0x000014, "Member 'FBS_AquaticInteractionData::MaxForce_34_6499E59046192D125441009588B75BF6' has a wrong offset!");
static_assert(offsetof(FBS_AquaticInteractionData, MaxDistance_29_6BEF08A8488CE3949B1C5C8AEB936920) == 0x000018, "Member 'FBS_AquaticInteractionData::MaxDistance_29_6BEF08A8488CE3949B1C5C8AEB936920' has a wrong offset!");
static_assert(offsetof(FBS_AquaticInteractionData, SplashEmiter_53_9482201B42685C048A4C0D9D95A8BD4D) == 0x00001C, "Member 'FBS_AquaticInteractionData::SplashEmiter_53_9482201B42685C048A4C0D9D95A8BD4D' has a wrong offset!");
static_assert(offsetof(FBS_AquaticInteractionData, SplashOffsetZ_44_5B2896334632B17A889BCC8B2D45A465) == 0x000020, "Member 'FBS_AquaticInteractionData::SplashOffsetZ_44_5B2896334632B17A889BCC8B2D45A465' has a wrong offset!");
static_assert(offsetof(FBS_AquaticInteractionData, SplashEmiterScale_68_B58ED4F243C46D959CA73D81C8FC7485) == 0x000024, "Member 'FBS_AquaticInteractionData::SplashEmiterScale_68_B58ED4F243C46D959CA73D81C8FC7485' has a wrong offset!");

}

