#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BS_AquaticInteraction

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BS_AquaticInteractionData_structs.hpp"


namespace SDK
{

// UserDefinedStruct BS_AquaticInteraction.BS_AquaticInteraction
// 0x0070 (0x0070 - 0x0000)
struct FBS_AquaticInteraction final
{
public:
	class UBP_AquaticInteraction_C*               Owner_25_3A6C815B42EBA54B541ACB86F6EEFB72;         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location_3_71138D054985852AB5FB0FB5A877456B;       // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation_32_8ECAA5CB4DEA3542181A9E8834A54D71;      // 0x0020(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         MaxSurfaceDistance_52_A442A3D24A828819A5737489D1942C23; // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeToEnd_22_BB29A2AD4316564D628DDF8B4A4F7B82;     // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AquaticSurface_C*                   Surface_41_47A741AB49BD9C26C2B535A8C3CCC99C;       // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FBS_AquaticInteractionData             Data_21_A16BE8584186AE436372DA9C1708BC4C;          // 0x0048(0x0028)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FBS_AquaticInteraction) == 0x000008, "Wrong alignment on FBS_AquaticInteraction");
static_assert(sizeof(FBS_AquaticInteraction) == 0x000070, "Wrong size on FBS_AquaticInteraction");
static_assert(offsetof(FBS_AquaticInteraction, Owner_25_3A6C815B42EBA54B541ACB86F6EEFB72) == 0x000000, "Member 'FBS_AquaticInteraction::Owner_25_3A6C815B42EBA54B541ACB86F6EEFB72' has a wrong offset!");
static_assert(offsetof(FBS_AquaticInteraction, Location_3_71138D054985852AB5FB0FB5A877456B) == 0x000008, "Member 'FBS_AquaticInteraction::Location_3_71138D054985852AB5FB0FB5A877456B' has a wrong offset!");
static_assert(offsetof(FBS_AquaticInteraction, Rotation_32_8ECAA5CB4DEA3542181A9E8834A54D71) == 0x000020, "Member 'FBS_AquaticInteraction::Rotation_32_8ECAA5CB4DEA3542181A9E8834A54D71' has a wrong offset!");
static_assert(offsetof(FBS_AquaticInteraction, MaxSurfaceDistance_52_A442A3D24A828819A5737489D1942C23) == 0x000038, "Member 'FBS_AquaticInteraction::MaxSurfaceDistance_52_A442A3D24A828819A5737489D1942C23' has a wrong offset!");
static_assert(offsetof(FBS_AquaticInteraction, TimeToEnd_22_BB29A2AD4316564D628DDF8B4A4F7B82) == 0x00003C, "Member 'FBS_AquaticInteraction::TimeToEnd_22_BB29A2AD4316564D628DDF8B4A4F7B82' has a wrong offset!");
static_assert(offsetof(FBS_AquaticInteraction, Surface_41_47A741AB49BD9C26C2B535A8C3CCC99C) == 0x000040, "Member 'FBS_AquaticInteraction::Surface_41_47A741AB49BD9C26C2B535A8C3CCC99C' has a wrong offset!");
static_assert(offsetof(FBS_AquaticInteraction, Data_21_A16BE8584186AE436372DA9C1708BC4C) == 0x000048, "Member 'FBS_AquaticInteraction::Data_21_A16BE8584186AE436372DA9C1708BC4C' has a wrong offset!");

}

