#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BS_AquaticSplash

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct BS_AquaticSplash.BS_AquaticSplash
// 0x0020 (0x0020 - 0x0000)
struct FBS_AquaticSplash final
{
public:
	float                                         VelocityMin_69_2F4FD72F49BCBB81FA9729A268993C4D;   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VelocityMax_70_BFFA81594F81A9D829E82083436A0590;   // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScaleMin_71_2B37AF5E4D20E2DF8559718620844133;      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScaleMax_74_4066453D4091EE781C3F5B837AADA58F;      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        SplashEffect_81_F337123A4FC29A0A7A8D348B0A40CDC4;  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              SplashSound_82_67AECE484557324346A8ABB042603C86;   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FBS_AquaticSplash) == 0x000008, "Wrong alignment on FBS_AquaticSplash");
static_assert(sizeof(FBS_AquaticSplash) == 0x000020, "Wrong size on FBS_AquaticSplash");
static_assert(offsetof(FBS_AquaticSplash, VelocityMin_69_2F4FD72F49BCBB81FA9729A268993C4D) == 0x000000, "Member 'FBS_AquaticSplash::VelocityMin_69_2F4FD72F49BCBB81FA9729A268993C4D' has a wrong offset!");
static_assert(offsetof(FBS_AquaticSplash, VelocityMax_70_BFFA81594F81A9D829E82083436A0590) == 0x000004, "Member 'FBS_AquaticSplash::VelocityMax_70_BFFA81594F81A9D829E82083436A0590' has a wrong offset!");
static_assert(offsetof(FBS_AquaticSplash, ScaleMin_71_2B37AF5E4D20E2DF8559718620844133) == 0x000008, "Member 'FBS_AquaticSplash::ScaleMin_71_2B37AF5E4D20E2DF8559718620844133' has a wrong offset!");
static_assert(offsetof(FBS_AquaticSplash, ScaleMax_74_4066453D4091EE781C3F5B837AADA58F) == 0x00000C, "Member 'FBS_AquaticSplash::ScaleMax_74_4066453D4091EE781C3F5B837AADA58F' has a wrong offset!");
static_assert(offsetof(FBS_AquaticSplash, SplashEffect_81_F337123A4FC29A0A7A8D348B0A40CDC4) == 0x000010, "Member 'FBS_AquaticSplash::SplashEffect_81_F337123A4FC29A0A7A8D348B0A40CDC4' has a wrong offset!");
static_assert(offsetof(FBS_AquaticSplash, SplashSound_82_67AECE484557324346A8ABB042603C86) == 0x000018, "Member 'FBS_AquaticSplash::SplashSound_82_67AECE484557324346A8ABB042603C86' has a wrong offset!");

}

