#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CalendarDayWidgetBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function CalendarDayWidgetBase.CalendarDayWidgetBase_C.ExecuteUbergraph_CalendarDayWidgetBase
// 0x0148 (0x0148 - 0x0000)
struct CalendarDayWidgetBase_C_ExecuteUbergraph_CalendarDayWidgetBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0008(0x0078)(ConstParm)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0080(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x00B8(0x0078)(ConstParm)
	int32                                         CallFunc_GetDay_ReturnValue;                       // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0138(0x0010)()
};
static_assert(alignof(CalendarDayWidgetBase_C_ExecuteUbergraph_CalendarDayWidgetBase) == 0x000008, "Wrong alignment on CalendarDayWidgetBase_C_ExecuteUbergraph_CalendarDayWidgetBase");
static_assert(sizeof(CalendarDayWidgetBase_C_ExecuteUbergraph_CalendarDayWidgetBase) == 0x000148, "Wrong size on CalendarDayWidgetBase_C_ExecuteUbergraph_CalendarDayWidgetBase");
static_assert(offsetof(CalendarDayWidgetBase_C_ExecuteUbergraph_CalendarDayWidgetBase, EntryPoint) == 0x000000, "Member 'CalendarDayWidgetBase_C_ExecuteUbergraph_CalendarDayWidgetBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(CalendarDayWidgetBase_C_ExecuteUbergraph_CalendarDayWidgetBase, K2Node_Event_MouseEvent) == 0x000008, "Member 'CalendarDayWidgetBase_C_ExecuteUbergraph_CalendarDayWidgetBase::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(CalendarDayWidgetBase_C_ExecuteUbergraph_CalendarDayWidgetBase, K2Node_Event_MyGeometry) == 0x000080, "Member 'CalendarDayWidgetBase_C_ExecuteUbergraph_CalendarDayWidgetBase::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(CalendarDayWidgetBase_C_ExecuteUbergraph_CalendarDayWidgetBase, K2Node_Event_MouseEvent_1) == 0x0000B8, "Member 'CalendarDayWidgetBase_C_ExecuteUbergraph_CalendarDayWidgetBase::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(CalendarDayWidgetBase_C_ExecuteUbergraph_CalendarDayWidgetBase, CallFunc_GetDay_ReturnValue) == 0x000130, "Member 'CalendarDayWidgetBase_C_ExecuteUbergraph_CalendarDayWidgetBase::CallFunc_GetDay_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarDayWidgetBase_C_ExecuteUbergraph_CalendarDayWidgetBase, CallFunc_Conv_IntToText_ReturnValue) == 0x000138, "Member 'CalendarDayWidgetBase_C_ExecuteUbergraph_CalendarDayWidgetBase::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function CalendarDayWidgetBase.CalendarDayWidgetBase_C.GetDefaultVisibility
// 0x0001 (0x0001 - 0x0000)
struct CalendarDayWidgetBase_C_GetDefaultVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarDayWidgetBase_C_GetDefaultVisibility) == 0x000001, "Wrong alignment on CalendarDayWidgetBase_C_GetDefaultVisibility");
static_assert(sizeof(CalendarDayWidgetBase_C_GetDefaultVisibility) == 0x000001, "Wrong size on CalendarDayWidgetBase_C_GetDefaultVisibility");
static_assert(offsetof(CalendarDayWidgetBase_C_GetDefaultVisibility, ReturnValue) == 0x000000, "Member 'CalendarDayWidgetBase_C_GetDefaultVisibility::ReturnValue' has a wrong offset!");

// Function CalendarDayWidgetBase.CalendarDayWidgetBase_C.GetSelectedVisibility
// 0x0001 (0x0001 - 0x0000)
struct CalendarDayWidgetBase_C_GetSelectedVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarDayWidgetBase_C_GetSelectedVisibility) == 0x000001, "Wrong alignment on CalendarDayWidgetBase_C_GetSelectedVisibility");
static_assert(sizeof(CalendarDayWidgetBase_C_GetSelectedVisibility) == 0x000001, "Wrong size on CalendarDayWidgetBase_C_GetSelectedVisibility");
static_assert(offsetof(CalendarDayWidgetBase_C_GetSelectedVisibility, ReturnValue) == 0x000000, "Member 'CalendarDayWidgetBase_C_GetSelectedVisibility::ReturnValue' has a wrong offset!");

// Function CalendarDayWidgetBase.CalendarDayWidgetBase_C.IsSelected?
// 0x0001 (0x0001 - 0x0000)
struct CalendarDayWidgetBase_C_IsSelected_ final
{
public:
	bool                                          IsSelected_0;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarDayWidgetBase_C_IsSelected_) == 0x000001, "Wrong alignment on CalendarDayWidgetBase_C_IsSelected_");
static_assert(sizeof(CalendarDayWidgetBase_C_IsSelected_) == 0x000001, "Wrong size on CalendarDayWidgetBase_C_IsSelected_");
static_assert(offsetof(CalendarDayWidgetBase_C_IsSelected_, IsSelected_0) == 0x000000, "Member 'CalendarDayWidgetBase_C_IsSelected_::IsSelected_0' has a wrong offset!");

// Function CalendarDayWidgetBase.CalendarDayWidgetBase_C.IsToday?
// 0x0040 (0x0040 - 0x0000)
struct CalendarDayWidgetBase_C_IsToday_ final
{
public:
	bool                                          IsToday;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Today_ReturnValue;                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month;                      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_MakeDateTime_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DateTimeDateTime_ReturnValue;  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarDayWidgetBase_C_IsToday_) == 0x000008, "Wrong alignment on CalendarDayWidgetBase_C_IsToday_");
static_assert(sizeof(CalendarDayWidgetBase_C_IsToday_) == 0x000040, "Wrong size on CalendarDayWidgetBase_C_IsToday_");
static_assert(offsetof(CalendarDayWidgetBase_C_IsToday_, IsToday) == 0x000000, "Member 'CalendarDayWidgetBase_C_IsToday_::IsToday' has a wrong offset!");
static_assert(offsetof(CalendarDayWidgetBase_C_IsToday_, CallFunc_Today_ReturnValue) == 0x000008, "Member 'CalendarDayWidgetBase_C_IsToday_::CallFunc_Today_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarDayWidgetBase_C_IsToday_, CallFunc_BreakDateTime_Year) == 0x000010, "Member 'CalendarDayWidgetBase_C_IsToday_::CallFunc_BreakDateTime_Year' has a wrong offset!");
static_assert(offsetof(CalendarDayWidgetBase_C_IsToday_, CallFunc_BreakDateTime_Month) == 0x000014, "Member 'CalendarDayWidgetBase_C_IsToday_::CallFunc_BreakDateTime_Month' has a wrong offset!");
static_assert(offsetof(CalendarDayWidgetBase_C_IsToday_, CallFunc_BreakDateTime_Day) == 0x000018, "Member 'CalendarDayWidgetBase_C_IsToday_::CallFunc_BreakDateTime_Day' has a wrong offset!");
static_assert(offsetof(CalendarDayWidgetBase_C_IsToday_, CallFunc_BreakDateTime_Hour) == 0x00001C, "Member 'CalendarDayWidgetBase_C_IsToday_::CallFunc_BreakDateTime_Hour' has a wrong offset!");
static_assert(offsetof(CalendarDayWidgetBase_C_IsToday_, CallFunc_BreakDateTime_Minute) == 0x000020, "Member 'CalendarDayWidgetBase_C_IsToday_::CallFunc_BreakDateTime_Minute' has a wrong offset!");
static_assert(offsetof(CalendarDayWidgetBase_C_IsToday_, CallFunc_BreakDateTime_Second) == 0x000024, "Member 'CalendarDayWidgetBase_C_IsToday_::CallFunc_BreakDateTime_Second' has a wrong offset!");
static_assert(offsetof(CalendarDayWidgetBase_C_IsToday_, CallFunc_BreakDateTime_Millisecond) == 0x000028, "Member 'CalendarDayWidgetBase_C_IsToday_::CallFunc_BreakDateTime_Millisecond' has a wrong offset!");
static_assert(offsetof(CalendarDayWidgetBase_C_IsToday_, CallFunc_MakeDateTime_ReturnValue) == 0x000030, "Member 'CalendarDayWidgetBase_C_IsToday_::CallFunc_MakeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarDayWidgetBase_C_IsToday_, CallFunc_EqualEqual_DateTimeDateTime_ReturnValue) == 0x000038, "Member 'CalendarDayWidgetBase_C_IsToday_::CallFunc_EqualEqual_DateTimeDateTime_ReturnValue' has a wrong offset!");

// Function CalendarDayWidgetBase.CalendarDayWidgetBase_C.OnMouseButtonUp
// 0x0240 (0x0240 - 0x0000)
struct CalendarDayWidgetBase_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0168(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0188(0x00B8)()
};
static_assert(alignof(CalendarDayWidgetBase_C_OnMouseButtonUp) == 0x000008, "Wrong alignment on CalendarDayWidgetBase_C_OnMouseButtonUp");
static_assert(sizeof(CalendarDayWidgetBase_C_OnMouseButtonUp) == 0x000240, "Wrong size on CalendarDayWidgetBase_C_OnMouseButtonUp");
static_assert(offsetof(CalendarDayWidgetBase_C_OnMouseButtonUp, MyGeometry) == 0x000000, "Member 'CalendarDayWidgetBase_C_OnMouseButtonUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(CalendarDayWidgetBase_C_OnMouseButtonUp, MouseEvent) == 0x000038, "Member 'CalendarDayWidgetBase_C_OnMouseButtonUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(CalendarDayWidgetBase_C_OnMouseButtonUp, ReturnValue) == 0x0000B0, "Member 'CalendarDayWidgetBase_C_OnMouseButtonUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarDayWidgetBase_C_OnMouseButtonUp, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000168, "Member 'CalendarDayWidgetBase_C_OnMouseButtonUp::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarDayWidgetBase_C_OnMouseButtonUp, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000180, "Member 'CalendarDayWidgetBase_C_OnMouseButtonUp::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarDayWidgetBase_C_OnMouseButtonUp, K2Node_MakeStruct_EventReply) == 0x000188, "Member 'CalendarDayWidgetBase_C_OnMouseButtonUp::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function CalendarDayWidgetBase.CalendarDayWidgetBase_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct CalendarDayWidgetBase_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CalendarDayWidgetBase_C_OnMouseEnter) == 0x000008, "Wrong alignment on CalendarDayWidgetBase_C_OnMouseEnter");
static_assert(sizeof(CalendarDayWidgetBase_C_OnMouseEnter) == 0x0000B0, "Wrong size on CalendarDayWidgetBase_C_OnMouseEnter");
static_assert(offsetof(CalendarDayWidgetBase_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'CalendarDayWidgetBase_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(CalendarDayWidgetBase_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'CalendarDayWidgetBase_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function CalendarDayWidgetBase.CalendarDayWidgetBase_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct CalendarDayWidgetBase_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CalendarDayWidgetBase_C_OnMouseLeave) == 0x000008, "Wrong alignment on CalendarDayWidgetBase_C_OnMouseLeave");
static_assert(sizeof(CalendarDayWidgetBase_C_OnMouseLeave) == 0x000078, "Wrong size on CalendarDayWidgetBase_C_OnMouseLeave");
static_assert(offsetof(CalendarDayWidgetBase_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'CalendarDayWidgetBase_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function CalendarDayWidgetBase.CalendarDayWidgetBase_C.SetSelected
// 0x0001 (0x0001 - 0x0000)
struct CalendarDayWidgetBase_C_SetSelected final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarDayWidgetBase_C_SetSelected) == 0x000001, "Wrong alignment on CalendarDayWidgetBase_C_SetSelected");
static_assert(sizeof(CalendarDayWidgetBase_C_SetSelected) == 0x000001, "Wrong size on CalendarDayWidgetBase_C_SetSelected");
static_assert(offsetof(CalendarDayWidgetBase_C_SetSelected, Selected) == 0x000000, "Member 'CalendarDayWidgetBase_C_SetSelected::Selected' has a wrong offset!");

// Function CalendarDayWidgetBase.CalendarDayWidgetBase_C.SetWithinRange
// 0x0001 (0x0001 - 0x0000)
struct CalendarDayWidgetBase_C_SetWithinRange final
{
public:
	bool                                          IsWithinRange_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarDayWidgetBase_C_SetWithinRange) == 0x000001, "Wrong alignment on CalendarDayWidgetBase_C_SetWithinRange");
static_assert(sizeof(CalendarDayWidgetBase_C_SetWithinRange) == 0x000001, "Wrong size on CalendarDayWidgetBase_C_SetWithinRange");
static_assert(offsetof(CalendarDayWidgetBase_C_SetWithinRange, IsWithinRange_0) == 0x000000, "Member 'CalendarDayWidgetBase_C_SetWithinRange::IsWithinRange_0' has a wrong offset!");

// Function CalendarDayWidgetBase.CalendarDayWidgetBase_C.UpdateStyle
// 0x0005 (0x0005 - 0x0000)
struct CalendarDayWidgetBase_C_UpdateStyle final
{
public:
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsToday__IsToday;                         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelected__IsSelected;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarDayWidgetBase_C_UpdateStyle) == 0x000001, "Wrong alignment on CalendarDayWidgetBase_C_UpdateStyle");
static_assert(sizeof(CalendarDayWidgetBase_C_UpdateStyle) == 0x000005, "Wrong size on CalendarDayWidgetBase_C_UpdateStyle");
static_assert(offsetof(CalendarDayWidgetBase_C_UpdateStyle, CallFunc_BooleanAND_ReturnValue) == 0x000000, "Member 'CalendarDayWidgetBase_C_UpdateStyle::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarDayWidgetBase_C_UpdateStyle, CallFunc_IsToday__IsToday) == 0x000001, "Member 'CalendarDayWidgetBase_C_UpdateStyle::CallFunc_IsToday__IsToday' has a wrong offset!");
static_assert(offsetof(CalendarDayWidgetBase_C_UpdateStyle, CallFunc_BooleanAND_ReturnValue_1) == 0x000002, "Member 'CalendarDayWidgetBase_C_UpdateStyle::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalendarDayWidgetBase_C_UpdateStyle, CallFunc_IsSelected__IsSelected) == 0x000003, "Member 'CalendarDayWidgetBase_C_UpdateStyle::CallFunc_IsSelected__IsSelected' has a wrong offset!");
static_assert(offsetof(CalendarDayWidgetBase_C_UpdateStyle, CallFunc_BooleanAND_ReturnValue_2) == 0x000004, "Member 'CalendarDayWidgetBase_C_UpdateStyle::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

}

