#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CalendarBody

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CalendarBody.CalendarBody_C.CreateCalendarBody
// 0x0008 (0x0008 - 0x0000)
struct CalendarBody_C_CreateCalendarBody final
{
public:
	int32                                         Year;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Month;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarBody_C_CreateCalendarBody) == 0x000004, "Wrong alignment on CalendarBody_C_CreateCalendarBody");
static_assert(sizeof(CalendarBody_C_CreateCalendarBody) == 0x000008, "Wrong size on CalendarBody_C_CreateCalendarBody");
static_assert(offsetof(CalendarBody_C_CreateCalendarBody, Year) == 0x000000, "Member 'CalendarBody_C_CreateCalendarBody::Year' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarBody, Month) == 0x000004, "Member 'CalendarBody_C_CreateCalendarBody::Month' has a wrong offset!");

// Function CalendarBody.CalendarBody_C.CreateCalendarDayGrid
// 0x0078 (0x0078 - 0x0000)
struct CalendarBody_C_CreateCalendarDayGrid final
{
public:
	int32                                         Year;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Month;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentColumnTest;                                 // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CurrentDay;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentMonth;                                      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentYear;                                       // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentRow;                                        // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DateTimeDateTime_ReturnValue;     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DateTimeDateTime_ReturnValue;        // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DateTimeDateTime_ReturnValue;  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DateTimeDateTime_ReturnValue_1; // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UCalendarDayWidgetBase_C*               CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Day, class UCalendarDayWidgetBase_C* DayWidget)> K2Node_CreateDelegate_OutputDelegate; // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_DaysInMonth_ReturnValue;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDayOfWeek_DayOfWeekIndex;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_MakeDateTime_ReturnValue;                 // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarBody_C_CreateCalendarDayGrid) == 0x000008, "Wrong alignment on CalendarBody_C_CreateCalendarDayGrid");
static_assert(sizeof(CalendarBody_C_CreateCalendarDayGrid) == 0x000078, "Wrong size on CalendarBody_C_CreateCalendarDayGrid");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, Year) == 0x000000, "Member 'CalendarBody_C_CreateCalendarDayGrid::Year' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, Month) == 0x000004, "Member 'CalendarBody_C_CreateCalendarDayGrid::Month' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, CurrentColumnTest) == 0x000008, "Member 'CalendarBody_C_CreateCalendarDayGrid::CurrentColumnTest' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, CurrentDay) == 0x000010, "Member 'CalendarBody_C_CreateCalendarDayGrid::CurrentDay' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, CurrentMonth) == 0x000018, "Member 'CalendarBody_C_CreateCalendarDayGrid::CurrentMonth' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, CurrentYear) == 0x00001C, "Member 'CalendarBody_C_CreateCalendarDayGrid::CurrentYear' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, CurrentRow) == 0x000020, "Member 'CalendarBody_C_CreateCalendarDayGrid::CurrentRow' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, Temp_int_Variable) == 0x000024, "Member 'CalendarBody_C_CreateCalendarDayGrid::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'CalendarBody_C_CreateCalendarDayGrid::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, Temp_int_Variable_1) == 0x00002C, "Member 'CalendarBody_C_CreateCalendarDayGrid::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'CalendarBody_C_CreateCalendarDayGrid::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, CallFunc_Greater_DateTimeDateTime_ReturnValue) == 0x000031, "Member 'CalendarBody_C_CreateCalendarDayGrid::CallFunc_Greater_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, CallFunc_Less_DateTimeDateTime_ReturnValue) == 0x000032, "Member 'CalendarBody_C_CreateCalendarDayGrid::CallFunc_Less_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, CallFunc_BooleanAND_ReturnValue) == 0x000033, "Member 'CalendarBody_C_CreateCalendarDayGrid::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, CallFunc_EqualEqual_DateTimeDateTime_ReturnValue) == 0x000034, "Member 'CalendarBody_C_CreateCalendarDayGrid::CallFunc_EqualEqual_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, CallFunc_IsValid_ReturnValue_1) == 0x000035, "Member 'CalendarBody_C_CreateCalendarDayGrid::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, CallFunc_EqualEqual_DateTimeDateTime_ReturnValue_1) == 0x000036, "Member 'CalendarBody_C_CreateCalendarDayGrid::CallFunc_EqualEqual_DateTimeDateTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, CallFunc_Create_ReturnValue) == 0x000038, "Member 'CalendarBody_C_CreateCalendarDayGrid::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'CalendarBody_C_CreateCalendarDayGrid::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000050, "Member 'CalendarBody_C_CreateCalendarDayGrid::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, CallFunc_DaysInMonth_ReturnValue) == 0x000058, "Member 'CalendarBody_C_CreateCalendarDayGrid::CallFunc_DaysInMonth_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00005C, "Member 'CalendarBody_C_CreateCalendarDayGrid::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, CallFunc_Add_IntInt_ReturnValue_1) == 0x000060, "Member 'CalendarBody_C_CreateCalendarDayGrid::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, CallFunc_GetDayOfWeek_DayOfWeekIndex) == 0x000064, "Member 'CalendarBody_C_CreateCalendarDayGrid::CallFunc_GetDayOfWeek_DayOfWeekIndex' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, CallFunc_MakeDateTime_ReturnValue) == 0x000068, "Member 'CalendarBody_C_CreateCalendarDayGrid::CallFunc_MakeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateCalendarDayGrid, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000070, "Member 'CalendarBody_C_CreateCalendarDayGrid::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function CalendarBody.CalendarBody_C.CreateWeekDaysHeader
// 0x0068 (0x0068 - 0x0000)
struct CalendarBody_C_CreateWeekDaysHeader final
{
public:
	int32                                         StartIndex;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0008(0x0010)()
	class UWeekDayWidgetBase_C*                   CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWeekDayWidgetBase_C*                   CallFunc_Create_ReturnValue_1;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUniformGridSlot*                       CallFunc_AddChildToUniformGrid_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item_1;                         // 0x0040(0x0010)()
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarBody_C_CreateWeekDaysHeader) == 0x000008, "Wrong alignment on CalendarBody_C_CreateWeekDaysHeader");
static_assert(sizeof(CalendarBody_C_CreateWeekDaysHeader) == 0x000068, "Wrong size on CalendarBody_C_CreateWeekDaysHeader");
static_assert(offsetof(CalendarBody_C_CreateWeekDaysHeader, StartIndex) == 0x000000, "Member 'CalendarBody_C_CreateWeekDaysHeader::StartIndex' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateWeekDaysHeader, CallFunc_Array_Get_Item) == 0x000008, "Member 'CalendarBody_C_CreateWeekDaysHeader::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateWeekDaysHeader, CallFunc_Create_ReturnValue) == 0x000018, "Member 'CalendarBody_C_CreateWeekDaysHeader::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateWeekDaysHeader, CallFunc_AddChildToUniformGrid_ReturnValue) == 0x000020, "Member 'CalendarBody_C_CreateWeekDaysHeader::CallFunc_AddChildToUniformGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateWeekDaysHeader, CallFunc_Create_ReturnValue_1) == 0x000028, "Member 'CalendarBody_C_CreateWeekDaysHeader::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateWeekDaysHeader, CallFunc_AddChildToUniformGrid_ReturnValue_1) == 0x000030, "Member 'CalendarBody_C_CreateWeekDaysHeader::CallFunc_AddChildToUniformGrid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateWeekDaysHeader, Temp_int_Variable) == 0x000038, "Member 'CalendarBody_C_CreateWeekDaysHeader::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateWeekDaysHeader, CallFunc_Array_Get_Item_1) == 0x000040, "Member 'CalendarBody_C_CreateWeekDaysHeader::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateWeekDaysHeader, CallFunc_Subtract_IntInt_ReturnValue) == 0x000050, "Member 'CalendarBody_C_CreateWeekDaysHeader::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateWeekDaysHeader, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000054, "Member 'CalendarBody_C_CreateWeekDaysHeader::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateWeekDaysHeader, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'CalendarBody_C_CreateWeekDaysHeader::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateWeekDaysHeader, Temp_bool_Variable) == 0x00005C, "Member 'CalendarBody_C_CreateWeekDaysHeader::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_CreateWeekDaysHeader, K2Node_Select_Default) == 0x000060, "Member 'CalendarBody_C_CreateWeekDaysHeader::K2Node_Select_Default' has a wrong offset!");

// Function CalendarBody.CalendarBody_C.DayClicked
// 0x0010 (0x0010 - 0x0000)
struct CalendarBody_C_DayClicked final
{
public:
	int32                                         Day;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCalendarDayWidgetBase_C*               DayWidget;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarBody_C_DayClicked) == 0x000008, "Wrong alignment on CalendarBody_C_DayClicked");
static_assert(sizeof(CalendarBody_C_DayClicked) == 0x000010, "Wrong size on CalendarBody_C_DayClicked");
static_assert(offsetof(CalendarBody_C_DayClicked, Day) == 0x000000, "Member 'CalendarBody_C_DayClicked::Day' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_DayClicked, DayWidget) == 0x000008, "Member 'CalendarBody_C_DayClicked::DayWidget' has a wrong offset!");

// Function CalendarBody.CalendarBody_C.ExecuteUbergraph_CalendarBody
// 0x0018 (0x0018 - 0x0000)
struct CalendarBody_C_ExecuteUbergraph_CalendarBody final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Day;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCalendarDayWidgetBase_C*               K2Node_CustomEvent_DayWidget;                      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarBody_C_ExecuteUbergraph_CalendarBody) == 0x000008, "Wrong alignment on CalendarBody_C_ExecuteUbergraph_CalendarBody");
static_assert(sizeof(CalendarBody_C_ExecuteUbergraph_CalendarBody) == 0x000018, "Wrong size on CalendarBody_C_ExecuteUbergraph_CalendarBody");
static_assert(offsetof(CalendarBody_C_ExecuteUbergraph_CalendarBody, EntryPoint) == 0x000000, "Member 'CalendarBody_C_ExecuteUbergraph_CalendarBody::EntryPoint' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_ExecuteUbergraph_CalendarBody, K2Node_Event_IsDesignTime) == 0x000004, "Member 'CalendarBody_C_ExecuteUbergraph_CalendarBody::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_ExecuteUbergraph_CalendarBody, K2Node_CustomEvent_Day) == 0x000008, "Member 'CalendarBody_C_ExecuteUbergraph_CalendarBody::K2Node_CustomEvent_Day' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_ExecuteUbergraph_CalendarBody, K2Node_CustomEvent_DayWidget) == 0x000010, "Member 'CalendarBody_C_ExecuteUbergraph_CalendarBody::K2Node_CustomEvent_DayWidget' has a wrong offset!");

// Function CalendarBody.CalendarBody_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CalendarBody_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarBody_C_PreConstruct) == 0x000001, "Wrong alignment on CalendarBody_C_PreConstruct");
static_assert(sizeof(CalendarBody_C_PreConstruct) == 0x000001, "Wrong size on CalendarBody_C_PreConstruct");
static_assert(offsetof(CalendarBody_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CalendarBody_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CalendarBody.CalendarBody_C.UpdateWithinRange
// 0x0088 (0x0088 - 0x0000)
struct CalendarBody_C_UpdateWithinRange final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCalendarDayWidgetBase_C*               K2Node_DynamicCast_AsCalendar_Day_Widget_Base;     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasRangeSelected_HasRangeSelected_;       // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCalendarDayWidgetBase_C*               K2Node_DynamicCast_AsCalendar_Day_Widget_Base_1;   // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DateTimeDateTime_ReturnValue;     // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DateTimeDateTime_ReturnValue;        // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarBody_C_UpdateWithinRange) == 0x000008, "Wrong alignment on CalendarBody_C_UpdateWithinRange");
static_assert(sizeof(CalendarBody_C_UpdateWithinRange) == 0x000088, "Wrong size on CalendarBody_C_UpdateWithinRange");
static_assert(offsetof(CalendarBody_C_UpdateWithinRange, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'CalendarBody_C_UpdateWithinRange::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_UpdateWithinRange, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'CalendarBody_C_UpdateWithinRange::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarBody_C_UpdateWithinRange, Temp_int_Array_Index_Variable) == 0x000008, "Member 'CalendarBody_C_UpdateWithinRange::Temp_int_Array_Index_Variable' has a wrong offset!");
