#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CalendarHeaderWidget_Default

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CalendarHeaderWidget_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CalendarHeaderWidget_Default.CalendarHeaderWidget_Default_C
// 0x0028 (0x03B0 - 0x0388)
class UCalendarHeaderWidget_Default_C final : public UCalendarHeaderWidget_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CalendarHeaderWidget_Default_C;     // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCalendarMenu_Default_C*                CalendarMenu_Default;                              // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HeaderTextTB;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                N_Button;                                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                P_Button;                                          // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_CalendarHeaderWidget_Default(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CalendarHeaderWidget_Default_C">();
	}
	static class UCalendarHeaderWidget_Default_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCalendarHeaderWidget_Default_C>();
	}
};
static_assert(alignof(UCalendarHeaderWidget_Default_C) == 0x000008, "Wrong alignment on UCalendarHeaderWidget_Default_C");
static_assert(sizeof(UCalendarHeaderWidget_Default_C) == 0x0003B0, "Wrong size on UCalendarHeaderWidget_Default_C");
static_assert(offsetof(UCalendarHeaderWidget_Default_C, UberGraphFrame_CalendarHeaderWidget_Default_C) == 0x000388, "Member 'UCalendarHeaderWidget_Default_C::UberGraphFrame_CalendarHeaderWidget_Default_C' has a wrong offset!");
static_assert(offsetof(UCalendarHeaderWidget_Default_C, CalendarMenu_Default) == 0x000390, "Member 'UCalendarHeaderWidget_Default_C::CalendarMenu_Default' has a wrong offset!");
static_assert(offsetof(UCalendarHeaderWidget_Default_C, HeaderTextTB) == 0x000398, "Member 'UCalendarHeaderWidget_Default_C::HeaderTextTB' has a wrong offset!");
static_assert(offsetof(UCalendarHeaderWidget_Default_C, N_Button) == 0x0003A0, "Member 'UCalendarHeaderWidget_Default_C::N_Button' has a wrong offset!");
static_assert(offsetof(UCalendarHeaderWidget_Default_C, P_Button) == 0x0003A8, "Member 'UCalendarHeaderWidget_Default_C::P_Button' has a wrong offset!");

}

