#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CalendarBody

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CalendarBody.CalendarBody_C
// 0x0070 (0x0350 - 0x02E0)
class UCalendarBody_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_62;                                         // 0x02E8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      CalendarGrid;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCalendar_WidgetBase_C*                 CalendarWidget;                                    // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 Day, class UCalendarDayWidgetBase_C* DayWidget)> OnDayClicked; // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          WeekStartsOnMonday;                                // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShouldHighlightToday;                              // 0x0311(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShouldHighlightSelected;                           // 0x0312(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShouldHighlightWithinRange;                        // 0x0313(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 DayClass;                                          // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                 WeekDayClass;                                      // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class FText>                           WeekDays;                                          // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	EHorizontalAlignment                          HorizontalAlign;                                   // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            VerticalAlign;                                     // 0x0339(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A[0x2];                                      // 0x033A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           BackgroundColor;                                   // 0x033C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void CreateCalendarBody(int32 Year, int32 Month);
	void CreateCalendarDayGrid(int32 Year, int32 Month);
	void CreateWeekDaysHeader();
	void DayClicked(int32 Day, class UCalendarDayWidgetBase_C* DayWidget);
	void ExecuteUbergraph_CalendarBody(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void UpdateWithinRange();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CalendarBody_C">();
	}
	static class UCalendarBody_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCalendarBody_C>();
	}
};
static_assert(alignof(UCalendarBody_C) == 0x000008, "Wrong alignment on UCalendarBody_C");
static_assert(sizeof(UCalendarBody_C) == 0x000350, "Wrong size on UCalendarBody_C");
static_assert(offsetof(UCalendarBody_C, UberGraphFrame) == 0x0002E0, "Member 'UCalendarBody_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCalendarBody_C, Border_62) == 0x0002E8, "Member 'UCalendarBody_C::Border_62' has a wrong offset!");
static_assert(offsetof(UCalendarBody_C, CalendarGrid) == 0x0002F0, "Member 'UCalendarBody_C::CalendarGrid' has a wrong offset!");
static_assert(offsetof(UCalendarBody_C, CalendarWidget) == 0x0002F8, "Member 'UCalendarBody_C::CalendarWidget' has a wrong offset!");
static_assert(offsetof(UCalendarBody_C, OnDayClicked) == 0x000300, "Member 'UCalendarBody_C::OnDayClicked' has a wrong offset!");
static_assert(offsetof(UCalendarBody_C, WeekStartsOnMonday) == 0x000310, "Member 'UCalendarBody_C::WeekStartsOnMonday' has a wrong offset!");
static_assert(offsetof(UCalendarBody_C, ShouldHighlightToday) == 0x000311, "Member 'UCalendarBody_C::ShouldHighlightToday' has a wrong offset!");
static_assert(offsetof(UCalendarBody_C, ShouldHighlightSelected) == 0x000312, "Member 'UCalendarBody_C::ShouldHighlightSelected' has a wrong offset!");
static_assert(offsetof(UCalendarBody_C, ShouldHighlightWithinRange) == 0x000313, "Member 'UCalendarBody_C::ShouldHighlightWithinRange' has a wrong offset!");
static_assert(offsetof(UCalendarBody_C, DayClass) == 0x000318, "Member 'UCalendarBody_C::DayClass' has a wrong offset!");
static_assert(offsetof(UCalendarBody_C, WeekDayClass) == 0x000320, "Member 'UCalendarBody_C::WeekDayClass' has a wrong offset!");
static_assert(offsetof(UCalendarBody_C, WeekDays) == 0x000328, "Member 'UCalendarBody_C::WeekDays' has a wrong offset!");
static_assert(offsetof(UCalendarBody_C, HorizontalAlign) == 0x000338, "Member 'UCalendarBody_C::HorizontalAlign' has a wrong offset!");
static_assert(offsetof(UCalendarBody_C, VerticalAlign) == 0x000339, "Member 'UCalendarBody_C::VerticalAlign' has a wrong offset!");
static_assert(offsetof(UCalendarBody_C, BackgroundColor) == 0x00033C, "Member 'UCalendarBody_C::BackgroundColor' has a wrong offset!");

}

