#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CalendarUtils

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CalendarDateRange_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CalendarUtils.CalendarUtils_C.GetDayOfWeek
// 0x0050 (0x0050 - 0x0000)
struct CalendarUtils_C_GetDayOfWeek final
{
public:
	struct FDateTime                              CurrentDay;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          WeekStartsOnMonday;                                // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         DayOfWeekIndex;                                    // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ZellerCongruence_DayInt;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarUtils_C_GetDayOfWeek) == 0x000008, "Wrong alignment on CalendarUtils_C_GetDayOfWeek");
static_assert(sizeof(CalendarUtils_C_GetDayOfWeek) == 0x000050, "Wrong size on CalendarUtils_C_GetDayOfWeek");
static_assert(offsetof(CalendarUtils_C_GetDayOfWeek, CurrentDay) == 0x000000, "Member 'CalendarUtils_C_GetDayOfWeek::CurrentDay' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetDayOfWeek, WeekStartsOnMonday) == 0x000008, "Member 'CalendarUtils_C_GetDayOfWeek::WeekStartsOnMonday' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetDayOfWeek, __WorldContext) == 0x000010, "Member 'CalendarUtils_C_GetDayOfWeek::__WorldContext' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetDayOfWeek, DayOfWeekIndex) == 0x000018, "Member 'CalendarUtils_C_GetDayOfWeek::DayOfWeekIndex' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetDayOfWeek, Temp_bool_Variable) == 0x00001C, "Member 'CalendarUtils_C_GetDayOfWeek::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetDayOfWeek, Temp_int_Variable) == 0x000020, "Member 'CalendarUtils_C_GetDayOfWeek::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetDayOfWeek, Temp_bool_Variable_1) == 0x000024, "Member 'CalendarUtils_C_GetDayOfWeek::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetDayOfWeek, Temp_bool_Variable_2) == 0x000025, "Member 'CalendarUtils_C_GetDayOfWeek::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetDayOfWeek, Temp_int_Variable_1) == 0x000028, "Member 'CalendarUtils_C_GetDayOfWeek::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetDayOfWeek, CallFunc_ZellerCongruence_DayInt) == 0x00002C, "Member 'CalendarUtils_C_GetDayOfWeek::CallFunc_ZellerCongruence_DayInt' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetDayOfWeek, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000030, "Member 'CalendarUtils_C_GetDayOfWeek::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetDayOfWeek, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'CalendarUtils_C_GetDayOfWeek::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetDayOfWeek, K2Node_Select_Default) == 0x000038, "Member 'CalendarUtils_C_GetDayOfWeek::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetDayOfWeek, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00003C, "Member 'CalendarUtils_C_GetDayOfWeek::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetDayOfWeek, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000040, "Member 'CalendarUtils_C_GetDayOfWeek::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetDayOfWeek, K2Node_Select_Default_1) == 0x000044, "Member 'CalendarUtils_C_GetDayOfWeek::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetDayOfWeek, K2Node_Select_Default_2) == 0x000048, "Member 'CalendarUtils_C_GetDayOfWeek::K2Node_Select_Default_2' has a wrong offset!");

// Function CalendarUtils.CalendarUtils_C.GetNextMonth
// 0x0040 (0x0040 - 0x0000)
struct CalendarUtils_C_GetNextMonth final
{
public:
	struct FDateTime                              CurrentMonth;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              NextMonth;                                         // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         NextMonthYear;                                     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NextMonthIndex;                                    // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetYear_ReturnValue;                      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMonth_ReturnValue;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_MakeDateTime_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarUtils_C_GetNextMonth) == 0x000008, "Wrong alignment on CalendarUtils_C_GetNextMonth");
static_assert(sizeof(CalendarUtils_C_GetNextMonth) == 0x000040, "Wrong size on CalendarUtils_C_GetNextMonth");
static_assert(offsetof(CalendarUtils_C_GetNextMonth, CurrentMonth) == 0x000000, "Member 'CalendarUtils_C_GetNextMonth::CurrentMonth' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetNextMonth, __WorldContext) == 0x000008, "Member 'CalendarUtils_C_GetNextMonth::__WorldContext' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetNextMonth, NextMonth) == 0x000010, "Member 'CalendarUtils_C_GetNextMonth::NextMonth' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetNextMonth, NextMonthYear) == 0x000018, "Member 'CalendarUtils_C_GetNextMonth::NextMonthYear' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetNextMonth, NextMonthIndex) == 0x00001C, "Member 'CalendarUtils_C_GetNextMonth::NextMonthIndex' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetNextMonth, CallFunc_GetYear_ReturnValue) == 0x000020, "Member 'CalendarUtils_C_GetNextMonth::CallFunc_GetYear_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetNextMonth, CallFunc_GetMonth_ReturnValue) == 0x000024, "Member 'CalendarUtils_C_GetNextMonth::CallFunc_GetMonth_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetNextMonth, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'CalendarUtils_C_GetNextMonth::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetNextMonth, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00002C, "Member 'CalendarUtils_C_GetNextMonth::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetNextMonth, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'CalendarUtils_C_GetNextMonth::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetNextMonth, CallFunc_MakeDateTime_ReturnValue) == 0x000038, "Member 'CalendarUtils_C_GetNextMonth::CallFunc_MakeDateTime_ReturnValue' has a wrong offset!");

// Function CalendarUtils.CalendarUtils_C.GetPreviousMonth
// 0x0040 (0x0040 - 0x0000)
struct CalendarUtils_C_GetPreviousMonth final
{
public:
	struct FDateTime                              CurrentMonth;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              PreviousMonth;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousMonthYear;                                 // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousMonthIndex;                                // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetYear_ReturnValue;                      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMonth_ReturnValue;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_MakeDateTime_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarUtils_C_GetPreviousMonth) == 0x000008, "Wrong alignment on CalendarUtils_C_GetPreviousMonth");
static_assert(sizeof(CalendarUtils_C_GetPreviousMonth) == 0x000040, "Wrong size on CalendarUtils_C_GetPreviousMonth");
static_assert(offsetof(CalendarUtils_C_GetPreviousMonth, CurrentMonth) == 0x000000, "Member 'CalendarUtils_C_GetPreviousMonth::CurrentMonth' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetPreviousMonth, __WorldContext) == 0x000008, "Member 'CalendarUtils_C_GetPreviousMonth::__WorldContext' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetPreviousMonth, PreviousMonth) == 0x000010, "Member 'CalendarUtils_C_GetPreviousMonth::PreviousMonth' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetPreviousMonth, PreviousMonthYear) == 0x000018, "Member 'CalendarUtils_C_GetPreviousMonth::PreviousMonthYear' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetPreviousMonth, PreviousMonthIndex) == 0x00001C, "Member 'CalendarUtils_C_GetPreviousMonth::PreviousMonthIndex' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetPreviousMonth, CallFunc_GetYear_ReturnValue) == 0x000020, "Member 'CalendarUtils_C_GetPreviousMonth::CallFunc_GetYear_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetPreviousMonth, CallFunc_GetMonth_ReturnValue) == 0x000024, "Member 'CalendarUtils_C_GetPreviousMonth::CallFunc_GetMonth_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetPreviousMonth, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'CalendarUtils_C_GetPreviousMonth::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetPreviousMonth, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00002C, "Member 'CalendarUtils_C_GetPreviousMonth::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetPreviousMonth, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000030, "Member 'CalendarUtils_C_GetPreviousMonth::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_GetPreviousMonth, CallFunc_MakeDateTime_ReturnValue) == 0x000038, "Member 'CalendarUtils_C_GetPreviousMonth::CallFunc_MakeDateTime_ReturnValue' has a wrong offset!");

// Function CalendarUtils.CalendarUtils_C.IsCalendarDateRangeValid
// 0x0018 (0x0018 - 0x0000)
struct CalendarUtils_C_IsCalendarDateRangeValid final
{
public:
	struct FCalendarDateRange                     Input;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsValid;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCalendarDateValid_IsValid;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCalendarDateValid_IsValid_1;            // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarUtils_C_IsCalendarDateRangeValid) == 0x000008, "Wrong alignment on CalendarUtils_C_IsCalendarDateRangeValid");
static_assert(sizeof(CalendarUtils_C_IsCalendarDateRangeValid) == 0x000018, "Wrong size on CalendarUtils_C_IsCalendarDateRangeValid");
static_assert(offsetof(CalendarUtils_C_IsCalendarDateRangeValid, Input) == 0x000000, "Member 'CalendarUtils_C_IsCalendarDateRangeValid::Input' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_IsCalendarDateRangeValid, __WorldContext) == 0x000008, "Member 'CalendarUtils_C_IsCalendarDateRangeValid::__WorldContext' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_IsCalendarDateRangeValid, IsValid) == 0x000010, "Member 'CalendarUtils_C_IsCalendarDateRangeValid::IsValid' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_IsCalendarDateRangeValid, CallFunc_IsCalendarDateValid_IsValid) == 0x000011, "Member 'CalendarUtils_C_IsCalendarDateRangeValid::CallFunc_IsCalendarDateValid_IsValid' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_IsCalendarDateRangeValid, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000012, "Member 'CalendarUtils_C_IsCalendarDateRangeValid::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_IsCalendarDateRangeValid, CallFunc_IsCalendarDateValid_IsValid_1) == 0x000013, "Member 'CalendarUtils_C_IsCalendarDateRangeValid::CallFunc_IsCalendarDateValid_IsValid_1' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_IsCalendarDateRangeValid, CallFunc_BooleanAND_ReturnValue) == 0x000014, "Member 'CalendarUtils_C_IsCalendarDateRangeValid::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_IsCalendarDateRangeValid, CallFunc_BooleanAND_ReturnValue_1) == 0x000015, "Member 'CalendarUtils_C_IsCalendarDateRangeValid::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function CalendarUtils.CalendarUtils_C.IsCalendarDateValid
// 0x0018 (0x0018 - 0x0000)
struct CalendarUtils_C_IsCalendarDateValid final
{
public:
	int32                                         Month;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Year;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsValid;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarUtils_C_IsCalendarDateValid) == 0x000008, "Wrong alignment on CalendarUtils_C_IsCalendarDateValid");
static_assert(sizeof(CalendarUtils_C_IsCalendarDateValid) == 0x000018, "Wrong size on CalendarUtils_C_IsCalendarDateValid");
static_assert(offsetof(CalendarUtils_C_IsCalendarDateValid, Month) == 0x000000, "Member 'CalendarUtils_C_IsCalendarDateValid::Month' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_IsCalendarDateValid, Year) == 0x000004, "Member 'CalendarUtils_C_IsCalendarDateValid::Year' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_IsCalendarDateValid, __WorldContext) == 0x000008, "Member 'CalendarUtils_C_IsCalendarDateValid::__WorldContext' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_IsCalendarDateValid, IsValid) == 0x000010, "Member 'CalendarUtils_C_IsCalendarDateValid::IsValid' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_IsCalendarDateValid, CallFunc_InRange_IntInt_ReturnValue) == 0x000011, "Member 'CalendarUtils_C_IsCalendarDateValid::CallFunc_InRange_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_IsCalendarDateValid, CallFunc_Greater_IntInt_ReturnValue) == 0x000012, "Member 'CalendarUtils_C_IsCalendarDateValid::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_IsCalendarDateValid, CallFunc_BooleanAND_ReturnValue) == 0x000013, "Member 'CalendarUtils_C_IsCalendarDateValid::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function CalendarUtils.CalendarUtils_C.IsDateWithinCalendarRange
// 0x0048 (0x0048 - 0x0000)
struct CalendarUtils_C_IsDateWithinCalendarRange final
{
public:
	struct FDateTime                              DateToTest;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FCalendarDateRange                     RangeToTest;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Within;                                            // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_MakeDateTime_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_MakeDateTime_ReturnValue_1;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DateTimeDateTime_ReturnValue; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_GetNextMonth_NextMonth;                   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DateTimeDateTime_ReturnValue;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarUtils_C_IsDateWithinCalendarRange) == 0x000008, "Wrong alignment on CalendarUtils_C_IsDateWithinCalendarRange");
static_assert(sizeof(CalendarUtils_C_IsDateWithinCalendarRange) == 0x000048, "Wrong size on CalendarUtils_C_IsDateWithinCalendarRange");
static_assert(offsetof(CalendarUtils_C_IsDateWithinCalendarRange, DateToTest) == 0x000000, "Member 'CalendarUtils_C_IsDateWithinCalendarRange::DateToTest' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_IsDateWithinCalendarRange, RangeToTest) == 0x000008, "Member 'CalendarUtils_C_IsDateWithinCalendarRange::RangeToTest' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_IsDateWithinCalendarRange, __WorldContext) == 0x000010, "Member 'CalendarUtils_C_IsDateWithinCalendarRange::__WorldContext' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_IsDateWithinCalendarRange, Within) == 0x000018, "Member 'CalendarUtils_C_IsDateWithinCalendarRange::Within' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_IsDateWithinCalendarRange, CallFunc_MakeDateTime_ReturnValue) == 0x000020, "Member 'CalendarUtils_C_IsDateWithinCalendarRange::CallFunc_MakeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_IsDateWithinCalendarRange, CallFunc_MakeDateTime_ReturnValue_1) == 0x000028, "Member 'CalendarUtils_C_IsDateWithinCalendarRange::CallFunc_MakeDateTime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_IsDateWithinCalendarRange, CallFunc_GreaterEqual_DateTimeDateTime_ReturnValue) == 0x000030, "Member 'CalendarUtils_C_IsDateWithinCalendarRange::CallFunc_GreaterEqual_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_IsDateWithinCalendarRange, CallFunc_GetNextMonth_NextMonth) == 0x000038, "Member 'CalendarUtils_C_IsDateWithinCalendarRange::CallFunc_GetNextMonth_NextMonth' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_IsDateWithinCalendarRange, CallFunc_Less_DateTimeDateTime_ReturnValue) == 0x000040, "Member 'CalendarUtils_C_IsDateWithinCalendarRange::CallFunc_Less_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_IsDateWithinCalendarRange, CallFunc_BooleanAND_ReturnValue) == 0x000041, "Member 'CalendarUtils_C_IsDateWithinCalendarRange::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function CalendarUtils.CalendarUtils_C.SetTextBlockStyle
// 0x0370 (0x0370 - 0x0000)
struct CalendarUtils_C_SetTextBlockStyle final
{
public:
	class UTextBlock*                             TB;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTextBlockStyle                        TBStyle;                                           // 0x0010(0x0340)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_SetShadowOffset_InShadowOffset_ImplicitCast; // 0x0358(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarUtils_C_SetTextBlockStyle) == 0x000010, "Wrong alignment on CalendarUtils_C_SetTextBlockStyle");
static_assert(sizeof(CalendarUtils_C_SetTextBlockStyle) == 0x000370, "Wrong size on CalendarUtils_C_SetTextBlockStyle");
static_assert(offsetof(CalendarUtils_C_SetTextBlockStyle, TB) == 0x000000, "Member 'CalendarUtils_C_SetTextBlockStyle::TB' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_SetTextBlockStyle, TBStyle) == 0x000010, "Member 'CalendarUtils_C_SetTextBlockStyle::TBStyle' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_SetTextBlockStyle, __WorldContext) == 0x000350, "Member 'CalendarUtils_C_SetTextBlockStyle::__WorldContext' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_SetTextBlockStyle, CallFunc_SetShadowOffset_InShadowOffset_ImplicitCast) == 0x000358, "Member 'CalendarUtils_C_SetTextBlockStyle::CallFunc_SetShadowOffset_InShadowOffset_ImplicitCast' has a wrong offset!");

// Function CalendarUtils.CalendarUtils_C.ZellerCongruence
// 0x0080 (0x0080 - 0x0000)
struct CalendarUtils_C_ZellerCongruence final
{
public:
	struct FDateTime                              CurrentTime;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         DayInt;                                            // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Century;                                           // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Decade;                                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Month;                                             // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Day;                                               // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShiftedYear;                                       // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShiftedMonth;                                      // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetYear_ReturnValue;                      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMonth_ReturnValue;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDay_ReturnValue;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue_1;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_2;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_3;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarUtils_C_ZellerCongruence) == 0x000008, "Wrong alignment on CalendarUtils_C_ZellerCongruence");
static_assert(sizeof(CalendarUtils_C_ZellerCongruence) == 0x000080, "Wrong size on CalendarUtils_C_ZellerCongruence");
static_assert(offsetof(CalendarUtils_C_ZellerCongruence, CurrentTime) == 0x000000, "Member 'CalendarUtils_C_ZellerCongruence::CurrentTime' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_ZellerCongruence, __WorldContext) == 0x000008, "Member 'CalendarUtils_C_ZellerCongruence::__WorldContext' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_ZellerCongruence, DayInt) == 0x000010, "Member 'CalendarUtils_C_ZellerCongruence::DayInt' has a wrong offset!");
static_assert(offsetof(CalendarUtils_C_ZellerCongruence, Century) == 0x000014, "Member 'CalendarUtils_C_ZellerCongruence::Century' has a wrong offset!");
