#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CalendarFooterWidgetBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function CalendarFooterWidgetBase.CalendarFooterWidgetBase_C.ExecuteUbergraph_CalendarFooterWidgetBase
// 0x0088 (0x0088 - 0x0000)
struct CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_Today_ReturnValue;                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month;                      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_MakeDateTime_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              K2Node_CustomEvent_NewDate;                        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDateTime& NewDate)> K2Node_CreateDelegate_OutputDelegate_2;         // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase) == 0x000008, "Wrong alignment on CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase");
static_assert(sizeof(CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase) == 0x000088, "Wrong size on CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase");
static_assert(offsetof(CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase, EntryPoint) == 0x000000, "Member 'CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase, Temp_byte_Variable) == 0x000004, "Member 'CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase, Temp_byte_Variable_1) == 0x000005, "Member 'CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase, Temp_bool_Variable) == 0x000006, "Member 'CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase, CallFunc_IsValid_ReturnValue) == 0x000007, "Member 'CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase, CallFunc_Today_ReturnValue) == 0x000008, "Member 'CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase::CallFunc_Today_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase, CallFunc_BreakDateTime_Year) == 0x000010, "Member 'CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase::CallFunc_BreakDateTime_Year' has a wrong offset!");
static_assert(offsetof(CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase, CallFunc_BreakDateTime_Month) == 0x000014, "Member 'CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase::CallFunc_BreakDateTime_Month' has a wrong offset!");
static_assert(offsetof(CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase, CallFunc_BreakDateTime_Day) == 0x000018, "Member 'CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase::CallFunc_BreakDateTime_Day' has a wrong offset!");
static_assert(offsetof(CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase, CallFunc_BreakDateTime_Hour) == 0x00001C, "Member 'CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase::CallFunc_BreakDateTime_Hour' has a wrong offset!");
static_assert(offsetof(CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase, CallFunc_BreakDateTime_Minute) == 0x000020, "Member 'CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase::CallFunc_BreakDateTime_Minute' has a wrong offset!");
static_assert(offsetof(CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase, CallFunc_BreakDateTime_Second) == 0x000024, "Member 'CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase::CallFunc_BreakDateTime_Second' has a wrong offset!");
static_assert(offsetof(CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase, CallFunc_BreakDateTime_Millisecond) == 0x000028, "Member 'CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase::CallFunc_BreakDateTime_Millisecond' has a wrong offset!");
static_assert(offsetof(CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase, CallFunc_MakeDateTime_ReturnValue) == 0x000030, "Member 'CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase::CallFunc_MakeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase, K2Node_CustomEvent_NewDate) == 0x000038, "Member 'CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase::K2Node_CustomEvent_NewDate' has a wrong offset!");
static_assert(offsetof(CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase, K2Node_CreateDelegate_OutputDelegate_1) == 0x000050, "Member 'CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase, K2Node_CreateDelegate_OutputDelegate_2) == 0x000060, "Member 'CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase, K2Node_CreateDelegate_OutputDelegate_3) == 0x000070, "Member 'CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase, K2Node_Select_Default) == 0x000080, "Member 'CalendarFooterWidgetBase_C_ExecuteUbergraph_CalendarFooterWidgetBase::K2Node_Select_Default' has a wrong offset!");

// Function CalendarFooterWidgetBase.CalendarFooterWidgetBase_C.OnDateSelected
// 0x0008 (0x0008 - 0x0000)
struct CalendarFooterWidgetBase_C_OnDateSelected final
{
public:
	struct FDateTime                              NewDate;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarFooterWidgetBase_C_OnDateSelected) == 0x000008, "Wrong alignment on CalendarFooterWidgetBase_C_OnDateSelected");
static_assert(sizeof(CalendarFooterWidgetBase_C_OnDateSelected) == 0x000008, "Wrong size on CalendarFooterWidgetBase_C_OnDateSelected");
static_assert(offsetof(CalendarFooterWidgetBase_C_OnDateSelected, NewDate) == 0x000000, "Member 'CalendarFooterWidgetBase_C_OnDateSelected::NewDate' has a wrong offset!");

// Function CalendarFooterWidgetBase.CalendarFooterWidgetBase_C.ShowTodayButton
// 0x0010 (0x0010 - 0x0000)
struct CalendarFooterWidgetBase_C_ShowTodayButton final
{
public:
	struct FDateTime                              CallFunc_Today_ReturnValue;                        // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCalendarDateRangeValid_IsValid;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDateWithinCalendarRange_Within;         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarFooterWidgetBase_C_ShowTodayButton) == 0x000008, "Wrong alignment on CalendarFooterWidgetBase_C_ShowTodayButton");
static_assert(sizeof(CalendarFooterWidgetBase_C_ShowTodayButton) == 0x000010, "Wrong size on CalendarFooterWidgetBase_C_ShowTodayButton");
static_assert(offsetof(CalendarFooterWidgetBase_C_ShowTodayButton, CallFunc_Today_ReturnValue) == 0x000000, "Member 'CalendarFooterWidgetBase_C_ShowTodayButton::CallFunc_Today_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarFooterWidgetBase_C_ShowTodayButton, CallFunc_IsCalendarDateRangeValid_IsValid) == 0x000008, "Member 'CalendarFooterWidgetBase_C_ShowTodayButton::CallFunc_IsCalendarDateRangeValid_IsValid' has a wrong offset!");
static_assert(offsetof(CalendarFooterWidgetBase_C_ShowTodayButton, CallFunc_IsDateWithinCalendarRange_Within) == 0x000009, "Member 'CalendarFooterWidgetBase_C_ShowTodayButton::CallFunc_IsDateWithinCalendarRange_Within' has a wrong offset!");
static_assert(offsetof(CalendarFooterWidgetBase_C_ShowTodayButton, CallFunc_Not_PreBool_ReturnValue) == 0x00000A, "Member 'CalendarFooterWidgetBase_C_ShowTodayButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarFooterWidgetBase_C_ShowTodayButton, CallFunc_BooleanAND_ReturnValue) == 0x00000B, "Member 'CalendarFooterWidgetBase_C_ShowTodayButton::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarFooterWidgetBase_C_ShowTodayButton, CallFunc_BooleanOR_ReturnValue) == 0x00000C, "Member 'CalendarFooterWidgetBase_C_ShowTodayButton::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

