#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CalendarMenu_Default

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CalendarMenuBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CalendarMenu_Default.CalendarMenu_Default_C
// 0x0018 (0x0340 - 0x0328)
class UCalendarMenu_Default_C final : public UCalendarMenuBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CalendarMenu_Default_C;             // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UComboBoxString*                        MonthCombo;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UComboBoxString*                        YearCombo;                                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_CalendarMenu_Default(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CalendarMenu_Default_C">();
	}
	static class UCalendarMenu_Default_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCalendarMenu_Default_C>();
	}
};
static_assert(alignof(UCalendarMenu_Default_C) == 0x000008, "Wrong alignment on UCalendarMenu_Default_C");
static_assert(sizeof(UCalendarMenu_Default_C) == 0x000340, "Wrong size on UCalendarMenu_Default_C");
static_assert(offsetof(UCalendarMenu_Default_C, UberGraphFrame_CalendarMenu_Default_C) == 0x000328, "Member 'UCalendarMenu_Default_C::UberGraphFrame_CalendarMenu_Default_C' has a wrong offset!");
static_assert(offsetof(UCalendarMenu_Default_C, MonthCombo) == 0x000330, "Member 'UCalendarMenu_Default_C::MonthCombo' has a wrong offset!");
static_assert(offsetof(UCalendarMenu_Default_C, YearCombo) == 0x000338, "Member 'UCalendarMenu_Default_C::YearCombo' has a wrong offset!");

}

