#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Calendar_Widget

#include "Basic.hpp"

#include "Calendar_WidgetBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Calendar_Widget.Calendar_Widget_C
// 0x0028 (0x03E0 - 0x03B8)
class UCalendar_Widget_C final : public UCalendar_WidgetBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Calendar_Widget_C;                  // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_1;                                          // 0x03C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             CalendarBodySlot;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             CalendarFooterSlot;                                // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             CalendarHeaderSlot;                                // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_Calendar_Widget(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Calendar_Widget_C">();
	}
	static class UCalendar_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCalendar_Widget_C>();
	}
};
static_assert(alignof(UCalendar_Widget_C) == 0x000008, "Wrong alignment on UCalendar_Widget_C");
static_assert(sizeof(UCalendar_Widget_C) == 0x0003E0, "Wrong size on UCalendar_Widget_C");
static_assert(offsetof(UCalendar_Widget_C, UberGraphFrame_Calendar_Widget_C) == 0x0003B8, "Member 'UCalendar_Widget_C::UberGraphFrame_Calendar_Widget_C' has a wrong offset!");
static_assert(offsetof(UCalendar_Widget_C, Border_1) == 0x0003C0, "Member 'UCalendar_Widget_C::Border_1' has a wrong offset!");
static_assert(offsetof(UCalendar_Widget_C, CalendarBodySlot) == 0x0003C8, "Member 'UCalendar_Widget_C::CalendarBodySlot' has a wrong offset!");
static_assert(offsetof(UCalendar_Widget_C, CalendarFooterSlot) == 0x0003D0, "Member 'UCalendar_Widget_C::CalendarFooterSlot' has a wrong offset!");
static_assert(offsetof(UCalendar_Widget_C, CalendarHeaderSlot) == 0x0003D8, "Member 'UCalendar_Widget_C::CalendarHeaderSlot' has a wrong offset!");

}

