#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CalendarMenuBase

#include "Basic.hpp"

#include "CalendarDateRange_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CalendarMenuBase.CalendarMenuBase_C.ExecuteUbergraph_CalendarMenuBase
// 0x0080 (0x0080 - 0x0000)
struct CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& SelectedItem, ESelectInfo SelectionType)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& SelectedItem, ESelectInfo SelectionType)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_SelectedItem_1;                 // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_CustomEvent_SelectionType_1;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_SelectedItem;                   // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_CustomEvent_SelectionType;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedIndex_ReturnValue;             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase) == 0x000008, "Wrong alignment on CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase");
static_assert(sizeof(CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase) == 0x000080, "Wrong size on CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase");
static_assert(offsetof(CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase, EntryPoint) == 0x000000, "Member 'CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase, K2Node_CreateDelegate_OutputDelegate_3) == 0x000034, "Member 'CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase, K2Node_CustomEvent_SelectedItem_1) == 0x000048, "Member 'CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase::K2Node_CustomEvent_SelectedItem_1' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase, K2Node_CustomEvent_SelectionType_1) == 0x000058, "Member 'CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase::K2Node_CustomEvent_SelectionType_1' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase, K2Node_CustomEvent_SelectedItem) == 0x000060, "Member 'CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase::K2Node_CustomEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase, K2Node_CustomEvent_SelectionType) == 0x000070, "Member 'CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase::K2Node_CustomEvent_SelectionType' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase, CallFunc_Conv_StringToInt_ReturnValue) == 0x000074, "Member 'CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase, CallFunc_GetSelectedIndex_ReturnValue) == 0x000078, "Member 'CalendarMenuBase_C_ExecuteUbergraph_CalendarMenuBase::CallFunc_GetSelectedIndex_ReturnValue' has a wrong offset!");

// Function CalendarMenuBase.CalendarMenuBase_C.UpdateYearComboContent
// 0x0060 (0x0060 - 0x0000)
struct CalendarMenuBase_C_UpdateYearComboContent final
{
public:
	class FString                                 SaveSelectedOption;                                // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSelectedOption_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetYear_ReturnValue;                      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FCalendarDateRange                     K2Node_MakeStruct_CalendarDateRange;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCalendarDateRangeValid_IsValid;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarMenuBase_C_UpdateYearComboContent) == 0x000008, "Wrong alignment on CalendarMenuBase_C_UpdateYearComboContent");
static_assert(sizeof(CalendarMenuBase_C_UpdateYearComboContent) == 0x000060, "Wrong size on CalendarMenuBase_C_UpdateYearComboContent");
static_assert(offsetof(CalendarMenuBase_C_UpdateYearComboContent, SaveSelectedOption) == 0x000000, "Member 'CalendarMenuBase_C_UpdateYearComboContent::SaveSelectedOption' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_UpdateYearComboContent, CallFunc_GetSelectedOption_ReturnValue) == 0x000010, "Member 'CalendarMenuBase_C_UpdateYearComboContent::CallFunc_GetSelectedOption_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_UpdateYearComboContent, CallFunc_GetYear_ReturnValue) == 0x000020, "Member 'CalendarMenuBase_C_UpdateYearComboContent::CallFunc_GetYear_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_UpdateYearComboContent, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'CalendarMenuBase_C_UpdateYearComboContent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_UpdateYearComboContent, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'CalendarMenuBase_C_UpdateYearComboContent::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_UpdateYearComboContent, Temp_int_Variable) == 0x00002C, "Member 'CalendarMenuBase_C_UpdateYearComboContent::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_UpdateYearComboContent, CallFunc_Max_ReturnValue) == 0x000030, "Member 'CalendarMenuBase_C_UpdateYearComboContent::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_UpdateYearComboContent, CallFunc_Conv_IntToString_ReturnValue) == 0x000038, "Member 'CalendarMenuBase_C_UpdateYearComboContent::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_UpdateYearComboContent, K2Node_MakeStruct_CalendarDateRange) == 0x000048, "Member 'CalendarMenuBase_C_UpdateYearComboContent::K2Node_MakeStruct_CalendarDateRange' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_UpdateYearComboContent, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000050, "Member 'CalendarMenuBase_C_UpdateYearComboContent::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_UpdateYearComboContent, CallFunc_Add_IntInt_ReturnValue_1) == 0x000054, "Member 'CalendarMenuBase_C_UpdateYearComboContent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_UpdateYearComboContent, CallFunc_IsCalendarDateRangeValid_IsValid) == 0x000058, "Member 'CalendarMenuBase_C_UpdateYearComboContent::CallFunc_IsCalendarDateRangeValid_IsValid' has a wrong offset!");

// Function CalendarMenuBase.CalendarMenuBase_C.UpdateCalendarMenu
// 0x0058 (0x0058 - 0x0000)
struct CalendarMenuBase_C_UpdateCalendarMenu final
{
public:
	TArray<class FText>                           MonthList;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_GetYear_ReturnValue;                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMonth_ReturnValue;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0030(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FindOptionIndex_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarMenuBase_C_UpdateCalendarMenu) == 0x000008, "Wrong alignment on CalendarMenuBase_C_UpdateCalendarMenu");
static_assert(sizeof(CalendarMenuBase_C_UpdateCalendarMenu) == 0x000058, "Wrong size on CalendarMenuBase_C_UpdateCalendarMenu");
static_assert(offsetof(CalendarMenuBase_C_UpdateCalendarMenu, MonthList) == 0x000000, "Member 'CalendarMenuBase_C_UpdateCalendarMenu::MonthList' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_UpdateCalendarMenu, CallFunc_GetYear_ReturnValue) == 0x000010, "Member 'CalendarMenuBase_C_UpdateCalendarMenu::CallFunc_GetYear_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_UpdateCalendarMenu, CallFunc_GetMonth_ReturnValue) == 0x000014, "Member 'CalendarMenuBase_C_UpdateCalendarMenu::CallFunc_GetMonth_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_UpdateCalendarMenu, CallFunc_Conv_IntToString_ReturnValue) == 0x000018, "Member 'CalendarMenuBase_C_UpdateCalendarMenu::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_UpdateCalendarMenu, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'CalendarMenuBase_C_UpdateCalendarMenu::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_UpdateCalendarMenu, CallFunc_Array_Get_Item) == 0x000030, "Member 'CalendarMenuBase_C_UpdateCalendarMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_UpdateCalendarMenu, CallFunc_Conv_TextToString_ReturnValue) == 0x000040, "Member 'CalendarMenuBase_C_UpdateCalendarMenu::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_UpdateCalendarMenu, CallFunc_FindOptionIndex_ReturnValue) == 0x000050, "Member 'CalendarMenuBase_C_UpdateCalendarMenu::CallFunc_FindOptionIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_UpdateCalendarMenu, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000054, "Member 'CalendarMenuBase_C_UpdateCalendarMenu::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function CalendarMenuBase.CalendarMenuBase_C.InitCalendarMenu
// 0x0068 (0x0068 - 0x0000)
struct CalendarMenuBase_C_InitCalendarMenu final
{
public:
	TArray<class FText>                           MonthNames;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMonth_ReturnValue;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetYear_ReturnValue;                      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarMenuBase_C_InitCalendarMenu) == 0x000008, "Wrong alignment on CalendarMenuBase_C_InitCalendarMenu");
static_assert(sizeof(CalendarMenuBase_C_InitCalendarMenu) == 0x000068, "Wrong size on CalendarMenuBase_C_InitCalendarMenu");
static_assert(offsetof(CalendarMenuBase_C_InitCalendarMenu, MonthNames) == 0x000000, "Member 'CalendarMenuBase_C_InitCalendarMenu::MonthNames' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_InitCalendarMenu, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'CalendarMenuBase_C_InitCalendarMenu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_InitCalendarMenu, Temp_int_Array_Index_Variable) == 0x000014, "Member 'CalendarMenuBase_C_InitCalendarMenu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_InitCalendarMenu, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'CalendarMenuBase_C_InitCalendarMenu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_InitCalendarMenu, CallFunc_Array_Get_Item) == 0x000020, "Member 'CalendarMenuBase_C_InitCalendarMenu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_InitCalendarMenu, CallFunc_Conv_TextToString_ReturnValue) == 0x000030, "Member 'CalendarMenuBase_C_InitCalendarMenu::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_InitCalendarMenu, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'CalendarMenuBase_C_InitCalendarMenu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_InitCalendarMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'CalendarMenuBase_C_InitCalendarMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_InitCalendarMenu, CallFunc_GetMonth_ReturnValue) == 0x000048, "Member 'CalendarMenuBase_C_InitCalendarMenu::CallFunc_GetMonth_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_InitCalendarMenu, CallFunc_Subtract_IntInt_ReturnValue) == 0x00004C, "Member 'CalendarMenuBase_C_InitCalendarMenu::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_InitCalendarMenu, CallFunc_GetYear_ReturnValue) == 0x000050, "Member 'CalendarMenuBase_C_InitCalendarMenu::CallFunc_GetYear_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_InitCalendarMenu, CallFunc_Conv_IntToString_ReturnValue) == 0x000058, "Member 'CalendarMenuBase_C_InitCalendarMenu::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");

// Function CalendarMenuBase.CalendarMenuBase_C.OnSelectedMonthChanged
// 0x0018 (0x0018 - 0x0000)
struct CalendarMenuBase_C_OnSelectedMonthChanged final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarMenuBase_C_OnSelectedMonthChanged) == 0x000008, "Wrong alignment on CalendarMenuBase_C_OnSelectedMonthChanged");
static_assert(sizeof(CalendarMenuBase_C_OnSelectedMonthChanged) == 0x000018, "Wrong size on CalendarMenuBase_C_OnSelectedMonthChanged");
static_assert(offsetof(CalendarMenuBase_C_OnSelectedMonthChanged, SelectedItem) == 0x000000, "Member 'CalendarMenuBase_C_OnSelectedMonthChanged::SelectedItem' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_OnSelectedMonthChanged, SelectionType) == 0x000010, "Member 'CalendarMenuBase_C_OnSelectedMonthChanged::SelectionType' has a wrong offset!");

// Function CalendarMenuBase.CalendarMenuBase_C.OnSelectedYearChanged
// 0x0018 (0x0018 - 0x0000)
struct CalendarMenuBase_C_OnSelectedYearChanged final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarMenuBase_C_OnSelectedYearChanged) == 0x000008, "Wrong alignment on CalendarMenuBase_C_OnSelectedYearChanged");
static_assert(sizeof(CalendarMenuBase_C_OnSelectedYearChanged) == 0x000018, "Wrong size on CalendarMenuBase_C_OnSelectedYearChanged");
static_assert(offsetof(CalendarMenuBase_C_OnSelectedYearChanged, SelectedItem) == 0x000000, "Member 'CalendarMenuBase_C_OnSelectedYearChanged::SelectedItem' has a wrong offset!");
static_assert(offsetof(CalendarMenuBase_C_OnSelectedYearChanged, SelectionType) == 0x000010, "Member 'CalendarMenuBase_C_OnSelectedYearChanged::SelectionType' has a wrong offset!");

}

