#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CalendarDayWidgetBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CalendarDayWidgetBase.CalendarDayWidgetBase_C
// 0x0078 (0x0358 - 0x02E0)
class UCalendarDayWidgetBase_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FDateTime                              DayDate;                                           // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Day;                                               // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 Day, class UCalendarDayWidgetBase_C* DayWidget)> OnClicked;  // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsSelected;                                        // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldHighlightSelected;                           // 0x0309(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_30A[0x6];                                      // 0x030A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DayText;                                           // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ShouldHighlightToday;                              // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                SelectedWidget;                                    // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                TodayWidget;                                       // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                DefaultWidget;                                     // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsWithinRange;                                     // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                WithinRangeWidget;                                 // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldHighlightWithinRange;                        // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_CalendarDayWidgetBase(int32 EntryPoint);
	ESlateVisibility GetDefaultVisibility();
	ESlateVisibility GetSelectedVisibility();
	void IsSelected_(bool* IsSelected_0);
	void IsToday_(bool* IsToday);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void SetSelected(bool Selected);
	void SetWithinRange(bool IsWithinRange_0);
	void UpdateStyle();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CalendarDayWidgetBase_C">();
	}
	static class UCalendarDayWidgetBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCalendarDayWidgetBase_C>();
	}
};
static_assert(alignof(UCalendarDayWidgetBase_C) == 0x000008, "Wrong alignment on UCalendarDayWidgetBase_C");
static_assert(sizeof(UCalendarDayWidgetBase_C) == 0x000358, "Wrong size on UCalendarDayWidgetBase_C");
static_assert(offsetof(UCalendarDayWidgetBase_C, UberGraphFrame) == 0x0002E0, "Member 'UCalendarDayWidgetBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCalendarDayWidgetBase_C, DayDate) == 0x0002E8, "Member 'UCalendarDayWidgetBase_C::DayDate' has a wrong offset!");
static_assert(offsetof(UCalendarDayWidgetBase_C, Day) == 0x0002F0, "Member 'UCalendarDayWidgetBase_C::Day' has a wrong offset!");
static_assert(offsetof(UCalendarDayWidgetBase_C, OnClicked) == 0x0002F8, "Member 'UCalendarDayWidgetBase_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UCalendarDayWidgetBase_C, IsSelected) == 0x000308, "Member 'UCalendarDayWidgetBase_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UCalendarDayWidgetBase_C, ShouldHighlightSelected) == 0x000309, "Member 'UCalendarDayWidgetBase_C::ShouldHighlightSelected' has a wrong offset!");
static_assert(offsetof(UCalendarDayWidgetBase_C, DayText) == 0x000310, "Member 'UCalendarDayWidgetBase_C::DayText' has a wrong offset!");
static_assert(offsetof(UCalendarDayWidgetBase_C, ShouldHighlightToday) == 0x000320, "Member 'UCalendarDayWidgetBase_C::ShouldHighlightToday' has a wrong offset!");
static_assert(offsetof(UCalendarDayWidgetBase_C, SelectedWidget) == 0x000328, "Member 'UCalendarDayWidgetBase_C::SelectedWidget' has a wrong offset!");
static_assert(offsetof(UCalendarDayWidgetBase_C, TodayWidget) == 0x000330, "Member 'UCalendarDayWidgetBase_C::TodayWidget' has a wrong offset!");
static_assert(offsetof(UCalendarDayWidgetBase_C, DefaultWidget) == 0x000338, "Member 'UCalendarDayWidgetBase_C::DefaultWidget' has a wrong offset!");
static_assert(offsetof(UCalendarDayWidgetBase_C, IsWithinRange) == 0x000340, "Member 'UCalendarDayWidgetBase_C::IsWithinRange' has a wrong offset!");
static_assert(offsetof(UCalendarDayWidgetBase_C, WithinRangeWidget) == 0x000348, "Member 'UCalendarDayWidgetBase_C::WithinRangeWidget' has a wrong offset!");
static_assert(offsetof(UCalendarDayWidgetBase_C, ShouldHighlightWithinRange) == 0x000350, "Member 'UCalendarDayWidgetBase_C::ShouldHighlightWithinRange' has a wrong offset!");

}

