#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CalendarHeaderWidget_Base

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CalendarHeaderWidget_Base.CalendarHeaderWidget_Base_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CalendarHeaderWidget_Base_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarHeaderWidget_Base_C_PreConstruct) == 0x000001, "Wrong alignment on CalendarHeaderWidget_Base_C_PreConstruct");
static_assert(sizeof(CalendarHeaderWidget_Base_C_PreConstruct) == 0x000001, "Wrong size on CalendarHeaderWidget_Base_C_PreConstruct");
static_assert(offsetof(CalendarHeaderWidget_Base_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CalendarHeaderWidget_Base_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CalendarHeaderWidget_Base.CalendarHeaderWidget_Base_C.ExecuteUbergraph_CalendarHeaderWidget_Base
// 0x00A0 (0x00A0 - 0x0000)
struct CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 NewYear)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 SelectedMonth)>          K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_GetNextMonth_NextMonth;                   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCalendarDateRangeValid_IsValid;         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDateWithinCalendarRange_Within;         // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_GetPreviousMonth_PreviousMonth;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDateWithinCalendarRange_Within_1;       // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectedMonth;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_NewYear;                        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCalendar_WidgetBase_C*                 K2Node_CustomEvent_ParentWidget;                   // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_77[0x1];                                       // 0x0077(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base) == 0x000008, "Wrong alignment on CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base");
static_assert(sizeof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base) == 0x0000A0, "Wrong size on CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, EntryPoint) == 0x000000, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, Temp_bool_Variable) == 0x000004, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, Temp_byte_Variable) == 0x000018, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, Temp_byte_Variable_1) == 0x000019, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, K2Node_Event_IsDesignTime) == 0x00003C, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, CallFunc_GetNextMonth_NextMonth) == 0x000040, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::CallFunc_GetNextMonth_NextMonth' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, CallFunc_IsCalendarDateRangeValid_IsValid) == 0x000048, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::CallFunc_IsCalendarDateRangeValid_IsValid' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, CallFunc_IsDateWithinCalendarRange_Within) == 0x000049, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::CallFunc_IsDateWithinCalendarRange_Within' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, CallFunc_GetPreviousMonth_PreviousMonth) == 0x000050, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::CallFunc_GetPreviousMonth_PreviousMonth' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, Temp_byte_Variable_2) == 0x000058, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, CallFunc_IsDateWithinCalendarRange_Within_1) == 0x000059, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::CallFunc_IsDateWithinCalendarRange_Within_1' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, CallFunc_IsValid_ReturnValue) == 0x00005A, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, CallFunc_IsValid_ReturnValue_1) == 0x00005B, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, K2Node_CustomEvent_SelectedMonth) == 0x00005C, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::K2Node_CustomEvent_SelectedMonth' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, CallFunc_IsValid_ReturnValue_2) == 0x000060, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, K2Node_CustomEvent_NewYear) == 0x000064, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::K2Node_CustomEvent_NewYear' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, K2Node_CustomEvent_ParentWidget) == 0x000068, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::K2Node_CustomEvent_ParentWidget' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, CallFunc_IsValid_ReturnValue_3) == 0x000070, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, CallFunc_IsValid_ReturnValue_4) == 0x000071, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, CallFunc_IsValid_ReturnValue_5) == 0x000072, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, K2Node_Select_Default) == 0x000073, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, CallFunc_IsValid_ReturnValue_6) == 0x000074, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, Temp_byte_Variable_3) == 0x000075, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, Temp_bool_Variable_1) == 0x000076, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, K2Node_CreateDelegate_OutputDelegate_3) == 0x000078, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, K2Node_Select_Default_1) == 0x000088, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base, K2Node_CreateDelegate_OutputDelegate_4) == 0x00008C, "Member 'CalendarHeaderWidget_Base_C_ExecuteUbergraph_CalendarHeaderWidget_Base::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

// Function CalendarHeaderWidget_Base.CalendarHeaderWidget_Base_C.GetHeaderTextVisibility
// 0x0005 (0x0005 - 0x0000)
struct CalendarHeaderWidget_Base_C_GetHeaderTextVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarHeaderWidget_Base_C_GetHeaderTextVisibility) == 0x000001, "Wrong alignment on CalendarHeaderWidget_Base_C_GetHeaderTextVisibility");
static_assert(sizeof(CalendarHeaderWidget_Base_C_GetHeaderTextVisibility) == 0x000005, "Wrong size on CalendarHeaderWidget_Base_C_GetHeaderTextVisibility");
static_assert(offsetof(CalendarHeaderWidget_Base_C_GetHeaderTextVisibility, ReturnValue) == 0x000000, "Member 'CalendarHeaderWidget_Base_C_GetHeaderTextVisibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_GetHeaderTextVisibility, Temp_bool_Variable) == 0x000001, "Member 'CalendarHeaderWidget_Base_C_GetHeaderTextVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_GetHeaderTextVisibility, Temp_byte_Variable) == 0x000002, "Member 'CalendarHeaderWidget_Base_C_GetHeaderTextVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_GetHeaderTextVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'CalendarHeaderWidget_Base_C_GetHeaderTextVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_GetHeaderTextVisibility, K2Node_Select_Default) == 0x000004, "Member 'CalendarHeaderWidget_Base_C_GetHeaderTextVisibility::K2Node_Select_Default' has a wrong offset!");

// Function CalendarHeaderWidget_Base.CalendarHeaderWidget_Base_C.GetHeaderMenuVisibility
// 0x0005 (0x0005 - 0x0000)
struct CalendarHeaderWidget_Base_C_GetHeaderMenuVisibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarHeaderWidget_Base_C_GetHeaderMenuVisibility) == 0x000001, "Wrong alignment on CalendarHeaderWidget_Base_C_GetHeaderMenuVisibility");
static_assert(sizeof(CalendarHeaderWidget_Base_C_GetHeaderMenuVisibility) == 0x000005, "Wrong size on CalendarHeaderWidget_Base_C_GetHeaderMenuVisibility");
static_assert(offsetof(CalendarHeaderWidget_Base_C_GetHeaderMenuVisibility, ReturnValue) == 0x000000, "Member 'CalendarHeaderWidget_Base_C_GetHeaderMenuVisibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_GetHeaderMenuVisibility, Temp_bool_Variable) == 0x000001, "Member 'CalendarHeaderWidget_Base_C_GetHeaderMenuVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_GetHeaderMenuVisibility, Temp_byte_Variable) == 0x000002, "Member 'CalendarHeaderWidget_Base_C_GetHeaderMenuVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_GetHeaderMenuVisibility, Temp_byte_Variable_1) == 0x000003, "Member 'CalendarHeaderWidget_Base_C_GetHeaderMenuVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_GetHeaderMenuVisibility, K2Node_Select_Default) == 0x000004, "Member 'CalendarHeaderWidget_Base_C_GetHeaderMenuVisibility::K2Node_Select_Default' has a wrong offset!");

// Function CalendarHeaderWidget_Base.CalendarHeaderWidget_Base_C.FormatHeaderText
// 0x00F8 (0x00F8 - 0x0000)
struct CalendarHeaderWidget_Base_C_FormatHeaderText final
{
public:
	int32                                         CallFunc_BreakDateTime_Year;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0010)()
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0080(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0090(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0010)()
};
static_assert(alignof(CalendarHeaderWidget_Base_C_FormatHeaderText) == 0x000008, "Wrong alignment on CalendarHeaderWidget_Base_C_FormatHeaderText");
static_assert(sizeof(CalendarHeaderWidget_Base_C_FormatHeaderText) == 0x0000F8, "Wrong size on CalendarHeaderWidget_Base_C_FormatHeaderText");
static_assert(offsetof(CalendarHeaderWidget_Base_C_FormatHeaderText, CallFunc_BreakDateTime_Year) == 0x000000, "Member 'CalendarHeaderWidget_Base_C_FormatHeaderText::CallFunc_BreakDateTime_Year' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_FormatHeaderText, CallFunc_BreakDateTime_Month) == 0x000004, "Member 'CalendarHeaderWidget_Base_C_FormatHeaderText::CallFunc_BreakDateTime_Month' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_FormatHeaderText, CallFunc_BreakDateTime_Day) == 0x000008, "Member 'CalendarHeaderWidget_Base_C_FormatHeaderText::CallFunc_BreakDateTime_Day' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_FormatHeaderText, CallFunc_BreakDateTime_Hour) == 0x00000C, "Member 'CalendarHeaderWidget_Base_C_FormatHeaderText::CallFunc_BreakDateTime_Hour' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_FormatHeaderText, CallFunc_BreakDateTime_Minute) == 0x000010, "Member 'CalendarHeaderWidget_Base_C_FormatHeaderText::CallFunc_BreakDateTime_Minute' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_FormatHeaderText, CallFunc_BreakDateTime_Second) == 0x000014, "Member 'CalendarHeaderWidget_Base_C_FormatHeaderText::CallFunc_BreakDateTime_Second' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_FormatHeaderText, CallFunc_BreakDateTime_Millisecond) == 0x000018, "Member 'CalendarHeaderWidget_Base_C_FormatHeaderText::CallFunc_BreakDateTime_Millisecond' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_FormatHeaderText, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'CalendarHeaderWidget_Base_C_FormatHeaderText::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_FormatHeaderText, CallFunc_Subtract_IntInt_ReturnValue) == 0x000030, "Member 'CalendarHeaderWidget_Base_C_FormatHeaderText::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_FormatHeaderText, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'CalendarHeaderWidget_Base_C_FormatHeaderText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_FormatHeaderText, CallFunc_Array_Get_Item) == 0x000080, "Member 'CalendarHeaderWidget_Base_C_FormatHeaderText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_FormatHeaderText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000090, "Member 'CalendarHeaderWidget_Base_C_FormatHeaderText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_FormatHeaderText, K2Node_MakeArray_Array) == 0x0000D8, "Member 'CalendarHeaderWidget_Base_C_FormatHeaderText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CalendarHeaderWidget_Base_C_FormatHeaderText, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'CalendarHeaderWidget_Base_C_FormatHeaderText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function CalendarHeaderWidget_Base.CalendarHeaderWidget_Base_C.OnMonthSelected
// 0x0004 (0x0004 - 0x0000)
struct CalendarHeaderWidget_Base_C_OnMonthSelected final
{
public:
	int32                                         SelectedMonth;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarHeaderWidget_Base_C_OnMonthSelected) == 0x000004, "Wrong alignment on CalendarHeaderWidget_Base_C_OnMonthSelected");
static_assert(sizeof(CalendarHeaderWidget_Base_C_OnMonthSelected) == 0x000004, "Wrong size on CalendarHeaderWidget_Base_C_OnMonthSelected");
static_assert(offsetof(CalendarHeaderWidget_Base_C_OnMonthSelected, SelectedMonth) == 0x000000, "Member 'CalendarHeaderWidget_Base_C_OnMonthSelected::SelectedMonth' has a wrong offset!");

// Function CalendarHeaderWidget_Base.CalendarHeaderWidget_Base_C.OnYearSelected
// 0x0004 (0x0004 - 0x0000)
struct CalendarHeaderWidget_Base_C_OnYearSelected final
{
public:
	int32                                         NewYear;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarHeaderWidget_Base_C_OnYearSelected) == 0x000004, "Wrong alignment on CalendarHeaderWidget_Base_C_OnYearSelected");
static_assert(sizeof(CalendarHeaderWidget_Base_C_OnYearSelected) == 0x000004, "Wrong size on CalendarHeaderWidget_Base_C_OnYearSelected");
static_assert(offsetof(CalendarHeaderWidget_Base_C_OnYearSelected, NewYear) == 0x000000, "Member 'CalendarHeaderWidget_Base_C_OnYearSelected::NewYear' has a wrong offset!");

// Function CalendarHeaderWidget_Base.CalendarHeaderWidget_Base_C.SetCalendarWidget
// 0x0008 (0x0008 - 0x0000)
struct CalendarHeaderWidget_Base_C_SetCalendarWidget final
{
public:
	class UCalendar_WidgetBase_C*                 ParentWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CalendarHeaderWidget_Base_C_SetCalendarWidget) == 0x000008, "Wrong alignment on CalendarHeaderWidget_Base_C_SetCalendarWidget");
static_assert(sizeof(CalendarHeaderWidget_Base_C_SetCalendarWidget) == 0x000008, "Wrong size on CalendarHeaderWidget_Base_C_SetCalendarWidget");
static_assert(offsetof(CalendarHeaderWidget_Base_C_SetCalendarWidget, ParentWidget) == 0x000000, "Member 'CalendarHeaderWidget_Base_C_SetCalendarWidget::ParentWidget' has a wrong offset!");

}

