#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DatePicker_Widget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function DatePicker_Widget.DatePicker_Widget_C.DateClicked
// 0x0008 (0x0008 - 0x0000)
struct DatePicker_Widget_C_DateClicked final
{
public:
	struct FDateTime                              NewDate;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DatePicker_Widget_C_DateClicked) == 0x000008, "Wrong alignment on DatePicker_Widget_C_DateClicked");
static_assert(sizeof(DatePicker_Widget_C_DateClicked) == 0x000008, "Wrong size on DatePicker_Widget_C_DateClicked");
static_assert(offsetof(DatePicker_Widget_C_DateClicked, NewDate) == 0x000000, "Member 'DatePicker_Widget_C_DateClicked::NewDate' has a wrong offset!");

// Function DatePicker_Widget.DatePicker_Widget_C.ExecuteUbergraph_DatePicker_Widget
// 0x00A0 (0x00A0 - 0x0000)
struct DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDateTime& NewDate)> K2Node_CreateDelegate_OutputDelegate;           // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCalendar_Widget_C*                     CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              K2Node_CustomEvent_StartDate;                      // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              K2Node_CustomEvent_EndDate;                        // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FDateTime& StartDate, const struct FDateTime& EndDate)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              K2Node_CustomEvent_NewDate;                        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year;                       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month;                      // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day;                        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour;                       // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute;                     // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second;                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond;                // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_MakeDateTime_ReturnValue;                 // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget) == 0x000008, "Wrong alignment on DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget");
static_assert(sizeof(DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget) == 0x0000A0, "Wrong size on DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget");
static_assert(offsetof(DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget, EntryPoint) == 0x000000, "Member 'DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget, CallFunc_Create_ReturnValue) == 0x000028, "Member 'DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget, K2Node_CustomEvent_StartDate) == 0x000040, "Member 'DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget::K2Node_CustomEvent_StartDate' has a wrong offset!");
static_assert(offsetof(DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget, K2Node_CustomEvent_EndDate) == 0x000048, "Member 'DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget::K2Node_CustomEvent_EndDate' has a wrong offset!");
static_assert(offsetof(DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget, K2Node_CreateDelegate_OutputDelegate_3) == 0x000050, "Member 'DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget, CallFunc_AddChild_ReturnValue) == 0x000060, "Member 'DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget, K2Node_CustomEvent_NewDate) == 0x000068, "Member 'DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget::K2Node_CustomEvent_NewDate' has a wrong offset!");
static_assert(offsetof(DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget, CallFunc_BreakDateTime_Year) == 0x000070, "Member 'DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget::CallFunc_BreakDateTime_Year' has a wrong offset!");
static_assert(offsetof(DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget, CallFunc_BreakDateTime_Month) == 0x000074, "Member 'DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget::CallFunc_BreakDateTime_Month' has a wrong offset!");
static_assert(offsetof(DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget, CallFunc_BreakDateTime_Day) == 0x000078, "Member 'DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget::CallFunc_BreakDateTime_Day' has a wrong offset!");
static_assert(offsetof(DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget, CallFunc_BreakDateTime_Hour) == 0x00007C, "Member 'DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget::CallFunc_BreakDateTime_Hour' has a wrong offset!");
static_assert(offsetof(DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget, CallFunc_BreakDateTime_Minute) == 0x000080, "Member 'DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget::CallFunc_BreakDateTime_Minute' has a wrong offset!");
static_assert(offsetof(DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget, CallFunc_BreakDateTime_Second) == 0x000084, "Member 'DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget::CallFunc_BreakDateTime_Second' has a wrong offset!");
static_assert(offsetof(DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget, CallFunc_BreakDateTime_Millisecond) == 0x000088, "Member 'DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget::CallFunc_BreakDateTime_Millisecond' has a wrong offset!");
static_assert(offsetof(DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget, CallFunc_MakeDateTime_ReturnValue) == 0x000090, "Member 'DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget::CallFunc_MakeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget, K2Node_Event_IsDesignTime) == 0x000098, "Member 'DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000099, "Member 'DatePicker_Widget_C_ExecuteUbergraph_DatePicker_Widget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function DatePicker_Widget.DatePicker_Widget_C.On_PickDateBorder_MouseButtonDown_0
// 0x0228 (0x0228 - 0x0000)
struct DatePicker_Widget_C_On_PickDateBorder_MouseButtonDown_0 final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0168(0x00B8)()
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0220(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DatePicker_Widget_C_On_PickDateBorder_MouseButtonDown_0) == 0x000008, "Wrong alignment on DatePicker_Widget_C_On_PickDateBorder_MouseButtonDown_0");
static_assert(sizeof(DatePicker_Widget_C_On_PickDateBorder_MouseButtonDown_0) == 0x000228, "Wrong size on DatePicker_Widget_C_On_PickDateBorder_MouseButtonDown_0");
static_assert(offsetof(DatePicker_Widget_C_On_PickDateBorder_MouseButtonDown_0, MyGeometry) == 0x000000, "Member 'DatePicker_Widget_C_On_PickDateBorder_MouseButtonDown_0::MyGeometry' has a wrong offset!");
static_assert(offsetof(DatePicker_Widget_C_On_PickDateBorder_MouseButtonDown_0, MouseEvent) == 0x000038, "Member 'DatePicker_Widget_C_On_PickDateBorder_MouseButtonDown_0::MouseEvent' has a wrong offset!");
static_assert(offsetof(DatePicker_Widget_C_On_PickDateBorder_MouseButtonDown_0, ReturnValue) == 0x0000B0, "Member 'DatePicker_Widget_C_On_PickDateBorder_MouseButtonDown_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(DatePicker_Widget_C_On_PickDateBorder_MouseButtonDown_0, K2Node_MakeStruct_EventReply) == 0x000168, "Member 'DatePicker_Widget_C_On_PickDateBorder_MouseButtonDown_0::K2Node_MakeStruct_EventReply' has a wrong offset!");
static_assert(offsetof(DatePicker_Widget_C_On_PickDateBorder_MouseButtonDown_0, CallFunc_GetChildAt_ReturnValue) == 0x000220, "Member 'DatePicker_Widget_C_On_PickDateBorder_MouseButtonDown_0::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");

// Function DatePicker_Widget.DatePicker_Widget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct DatePicker_Widget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DatePicker_Widget_C_PreConstruct) == 0x000001, "Wrong alignment on DatePicker_Widget_C_PreConstruct");
static_assert(sizeof(DatePicker_Widget_C_PreConstruct) == 0x000001, "Wrong size on DatePicker_Widget_C_PreConstruct");
static_assert(offsetof(DatePicker_Widget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'DatePicker_Widget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function DatePicker_Widget.DatePicker_Widget_C.RangeSelected
// 0x0010 (0x0010 - 0x0000)
struct DatePicker_Widget_C_RangeSelected final
{
public:
	struct FDateTime                              StartDate;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              EndDate;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DatePicker_Widget_C_RangeSelected) == 0x000008, "Wrong alignment on DatePicker_Widget_C_RangeSelected");
static_assert(sizeof(DatePicker_Widget_C_RangeSelected) == 0x000010, "Wrong size on DatePicker_Widget_C_RangeSelected");
static_assert(offsetof(DatePicker_Widget_C_RangeSelected, StartDate) == 0x000000, "Member 'DatePicker_Widget_C_RangeSelected::StartDate' has a wrong offset!");
static_assert(offsetof(DatePicker_Widget_C_RangeSelected, EndDate) == 0x000008, "Member 'DatePicker_Widget_C_RangeSelected::EndDate' has a wrong offset!");

}

