#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DatePicker_Widget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CalendarPickerMode_structs.hpp"
#include "CalendarDateRange_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DatePicker_Widget.DatePicker_Widget_C
// 0x00B8 (0x0398 - 0x02E0)
class UDatePicker_Widget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNamedSlot*                             CalendarSlot;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                PickDateBorder;                                    // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PickDateTB;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FDateTime& NewDate)> OnDatePicked;                    // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         StartingMonth;                                     // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         StartingYear;                                      // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FCalendarDateRange                     InputDateRange;                                    // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          WeekStartsOnMonday;                                // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShowButtonsBar;                                    // 0x0321(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          HighlightSelected;                                 // 0x0322(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShowMonthAndYearMenus;                             // 0x0323(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          HighlightToday;                                    // 0x0324(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	ECalendarPickerMode                           PickerMode;                                        // 0x0325(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          HighlightWithinRange;                              // 0x0326(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          ShowOkButton;                                      // 0x0327(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   PickADateText;                                     // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UUMGCalendarAssetStyle_C*               CalendarStyle;                                     // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FDateTime& StartDate, const struct FDateTime& EndDate)> OnRangePicked; // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnClearSelectedDate;                               // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnOkClicked;                                       // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   PickARangeText;                                    // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   RangeTextFormat;                                   // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDateTime                              CurrentDate;                                       // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CalendarOkClicked();
	void ClearSelectedDate();
	void Construct();
	void DateClicked(const struct FDateTime& NewDate);
	void ExecuteUbergraph_DatePicker_Widget(int32 EntryPoint);
	void HideCalendar();
	struct FEventReply On_PickDateBorder_MouseButtonDown_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void RangeSelected(const struct FDateTime& StartDate, const struct FDateTime& EndDate);
	void ResetPickText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DatePicker_Widget_C">();
	}
	static class UDatePicker_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDatePicker_Widget_C>();
	}
};
static_assert(alignof(UDatePicker_Widget_C) == 0x000008, "Wrong alignment on UDatePicker_Widget_C");
static_assert(sizeof(UDatePicker_Widget_C) == 0x000398, "Wrong size on UDatePicker_Widget_C");
static_assert(offsetof(UDatePicker_Widget_C, UberGraphFrame) == 0x0002E0, "Member 'UDatePicker_Widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDatePicker_Widget_C, CalendarSlot) == 0x0002E8, "Member 'UDatePicker_Widget_C::CalendarSlot' has a wrong offset!");
static_assert(offsetof(UDatePicker_Widget_C, PickDateBorder) == 0x0002F0, "Member 'UDatePicker_Widget_C::PickDateBorder' has a wrong offset!");
static_assert(offsetof(UDatePicker_Widget_C, PickDateTB) == 0x0002F8, "Member 'UDatePicker_Widget_C::PickDateTB' has a wrong offset!");
static_assert(offsetof(UDatePicker_Widget_C, OnDatePicked) == 0x000300, "Member 'UDatePicker_Widget_C::OnDatePicked' has a wrong offset!");
static_assert(offsetof(UDatePicker_Widget_C, StartingMonth) == 0x000310, "Member 'UDatePicker_Widget_C::StartingMonth' has a wrong offset!");
static_assert(offsetof(UDatePicker_Widget_C, StartingYear) == 0x000314, "Member 'UDatePicker_Widget_C::StartingYear' has a wrong offset!");
static_assert(offsetof(UDatePicker_Widget_C, InputDateRange) == 0x000318, "Member 'UDatePicker_Widget_C::InputDateRange' has a wrong offset!");
static_assert(offsetof(UDatePicker_Widget_C, WeekStartsOnMonday) == 0x000320, "Member 'UDatePicker_Widget_C::WeekStartsOnMonday' has a wrong offset!");
static_assert(offsetof(UDatePicker_Widget_C, ShowButtonsBar) == 0x000321, "Member 'UDatePicker_Widget_C::ShowButtonsBar' has a wrong offset!");
static_assert(offsetof(UDatePicker_Widget_C, HighlightSelected) == 0x000322, "Member 'UDatePicker_Widget_C::HighlightSelected' has a wrong offset!");
static_assert(offsetof(UDatePicker_Widget_C, ShowMonthAndYearMenus) == 0x000323, "Member 'UDatePicker_Widget_C::ShowMonthAndYearMenus' has a wrong offset!");
static_assert(offsetof(UDatePicker_Widget_C, HighlightToday) == 0x000324, "Member 'UDatePicker_Widget_C::HighlightToday' has a wrong offset!");
static_assert(offsetof(UDatePicker_Widget_C, PickerMode) == 0x000325, "Member 'UDatePicker_Widget_C::PickerMode' has a wrong offset!");
static_assert(offsetof(UDatePicker_Widget_C, HighlightWithinRange) == 0x000326, "Member 'UDatePicker_Widget_C::HighlightWithinRange' has a wrong offset!");
static_assert(offsetof(UDatePicker_Widget_C, ShowOkButton) == 0x000327, "Member 'UDatePicker_Widget_C::ShowOkButton' has a wrong offset!");
static_assert(offsetof(UDatePicker_Widget_C, PickADateText) == 0x000328, "Member 'UDatePicker_Widget_C::PickADateText' has a wrong offset!");
static_assert(offsetof(UDatePicker_Widget_C, CalendarStyle) == 0x000338, "Member 'UDatePicker_Widget_C::CalendarStyle' has a wrong offset!");
static_assert(offsetof(UDatePicker_Widget_C, OnRangePicked) == 0x000340, "Member 'UDatePicker_Widget_C::OnRangePicked' has a wrong offset!");
static_assert(offsetof(UDatePicker_Widget_C, OnClearSelectedDate) == 0x000350, "Member 'UDatePicker_Widget_C::OnClearSelectedDate' has a wrong offset!");
static_assert(offsetof(UDatePicker_Widget_C, OnOkClicked) == 0x000360, "Member 'UDatePicker_Widget_C::OnOkClicked' has a wrong offset!");
static_assert(offsetof(UDatePicker_Widget_C, PickARangeText) == 0x000370, "Member 'UDatePicker_Widget_C::PickARangeText' has a wrong offset!");
static_assert(offsetof(UDatePicker_Widget_C, RangeTextFormat) == 0x000380, "Member 'UDatePicker_Widget_C::RangeTextFormat' has a wrong offset!");
static_assert(offsetof(UDatePicker_Widget_C, CurrentDate) == 0x000390, "Member 'UDatePicker_Widget_C::CurrentDate' has a wrong offset!");

}

