#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_PlayTagAnim

#include "Basic.hpp"

#include "TheIsle_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_PlayTagAnim.GA_PlayTagAnim_C.ExecuteUbergraph_GA_PlayTagAnim
// 0x0398 (0x0398 - 0x0000)
struct GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x008C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x00AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x00CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x00DC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x00EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x00FC(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0104(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x010C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x0114(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_15;           // 0x011C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIDinosaurBase*                        K2Node_DynamicCast_AsThe_Isle_Dinosaur_Base;       // 0x0150(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_16;           // 0x015C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTIDinosaurMontages*                    CallFunc_GetMontages_ReturnValue;                  // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x0178(0x0010)(ConstParm, ReferenceParm)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue; // 0x0188(0x0020)()
	struct FGrowthMontages                        CallFunc_Map_Find_Value;                           // 0x01A8(0x0028)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetGrowthBasedMontage_ReturnValue;        // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array_1;                          // 0x01F8(0x0010)(ConstParm, ReferenceParm)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue_1; // 0x0208(0x0020)()
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTIDinosaurMontages*                    CallFunc_GetMontages_ReturnValue_1;                // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array_2;                          // 0x0238(0x0010)(ConstParm, ReferenceParm)
	struct FGrowthMontages                        CallFunc_Map_Find_Value_1;                         // 0x0248(0x0028)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue_2; // 0x0278(0x0020)()
	class UAnimMontage*                           CallFunc_GetGrowthBasedMontage_ReturnValue_1;      // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1; // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_2; // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTIDinosaurMontages*                    CallFunc_GetMontages_ReturnValue_2;                // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array_3;                          // 0x02B8(0x0010)(ConstParm, ReferenceParm)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue_3; // 0x02C8(0x0020)()
	struct FGrowthMontages                        CallFunc_Map_Find_Value_2;                         // 0x02E8(0x0028)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetGrowthBasedMontage_ReturnValue_2;      // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_3; // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_2; // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTIDinosaurMontages*                    CallFunc_GetMontages_ReturnValue_3;                // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGrowthMontages                        CallFunc_Map_Find_Value_3;                         // 0x0348(0x0028)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue_3;                   // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetGrowthBasedMontage_ReturnValue_3;      // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_3; // 0x0380(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0388(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim) == 0x000008, "Wrong alignment on GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim");
static_assert(sizeof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim) == 0x000398, "Wrong size on GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, EntryPoint) == 0x000000, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, K2Node_CreateDelegate_OutputDelegate_3) == 0x00003C, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, K2Node_CreateDelegate_OutputDelegate_4) == 0x00004C, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, K2Node_CreateDelegate_OutputDelegate_5) == 0x00005C, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, K2Node_CreateDelegate_OutputDelegate_6) == 0x00006C, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, K2Node_CreateDelegate_OutputDelegate_7) == 0x00007C, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, K2Node_CreateDelegate_OutputDelegate_8) == 0x00008C, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, K2Node_CreateDelegate_OutputDelegate_9) == 0x00009C, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, K2Node_CreateDelegate_OutputDelegate_10) == 0x0000AC, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, K2Node_CreateDelegate_OutputDelegate_11) == 0x0000BC, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, K2Node_CreateDelegate_OutputDelegate_12) == 0x0000CC, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, K2Node_CreateDelegate_OutputDelegate_13) == 0x0000DC, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, K2Node_CreateDelegate_OutputDelegate_14) == 0x0000EC, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, Temp_name_Variable) == 0x0000FC, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, Temp_name_Variable_1) == 0x000104, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, Temp_name_Variable_2) == 0x00010C, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, Temp_name_Variable_3) == 0x000114, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, K2Node_CreateDelegate_OutputDelegate_15) == 0x00011C, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_WaitDelay_ReturnValue) == 0x000130, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_IsValid_ReturnValue_1) == 0x000138, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000140, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_K2_CommitAbility_ReturnValue) == 0x000148, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, K2Node_DynamicCast_AsThe_Isle_Dinosaur_Base) == 0x000150, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::K2Node_DynamicCast_AsThe_Isle_Dinosaur_Base' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, K2Node_CreateDelegate_OutputDelegate_16) == 0x00015C, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_GetMontages_ReturnValue) == 0x000170, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_GetMontages_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, K2Node_MakeArray_Array) == 0x000178, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_MakeGameplayTagContainerFromArray_ReturnValue) == 0x000188, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_MakeGameplayTagContainerFromArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_Map_Find_Value) == 0x0001A8, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_Map_Find_ReturnValue) == 0x0001D0, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_GetGrowthBasedMontage_ReturnValue) == 0x0001D8, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_GetGrowthBasedMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0001E0, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x0001E8, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_IsValid_ReturnValue_2) == 0x0001F0, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, K2Node_MakeArray_Array_1) == 0x0001F8, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_MakeGameplayTagContainerFromArray_ReturnValue_1) == 0x000208, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_MakeGameplayTagContainerFromArray_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x000228, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_GetMontages_ReturnValue_1) == 0x000230, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_GetMontages_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, K2Node_MakeArray_Array_2) == 0x000238, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_Map_Find_Value_1) == 0x000248, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_Map_Find_ReturnValue_1) == 0x000270, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_MakeGameplayTagContainerFromArray_ReturnValue_2) == 0x000278, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_MakeGameplayTagContainerFromArray_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_GetGrowthBasedMontage_ReturnValue_1) == 0x000298, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_GetGrowthBasedMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1) == 0x0002A0, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_2) == 0x0002A8, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_IsValid_ReturnValue_3) == 0x0002A9, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_GetMontages_ReturnValue_2) == 0x0002B0, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_GetMontages_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, K2Node_MakeArray_Array_3) == 0x0002B8, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_MakeGameplayTagContainerFromArray_ReturnValue_3) == 0x0002C8, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_MakeGameplayTagContainerFromArray_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_Map_Find_Value_2) == 0x0002E8, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_Map_Find_ReturnValue_2) == 0x000310, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_GetGrowthBasedMontage_ReturnValue_2) == 0x000318, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_GetGrowthBasedMontage_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_3) == 0x000320, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_2) == 0x000328, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_IsValid_ReturnValue_4) == 0x000330, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_GetMontages_ReturnValue_3) == 0x000338, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_GetMontages_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, K2Node_SwitchInteger_CmpSuccess) == 0x000340, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_Map_Find_Value_3) == 0x000348, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_Map_Find_Value_3' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_Map_Find_ReturnValue_3) == 0x000370, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_Map_Find_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_GetGrowthBasedMontage_ReturnValue_3) == 0x000378, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_GetGrowthBasedMontage_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_3) == 0x000380, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000388, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, CallFunc_IsValid_ReturnValue_5) == 0x000390, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim, K2Node_Event_bWasCancelled) == 0x000391, "Member 'GA_PlayTagAnim_C_ExecuteUbergraph_GA_PlayTagAnim::K2Node_Event_bWasCancelled' has a wrong offset!");

// Function GA_PlayTagAnim.GA_PlayTagAnim_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_PlayTagAnim_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_PlayTagAnim_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_PlayTagAnim_C_K2_OnEndAbility");
static_assert(sizeof(GA_PlayTagAnim_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_PlayTagAnim_C_K2_OnEndAbility");
static_assert(offsetof(GA_PlayTagAnim_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_PlayTagAnim_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

