#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameplayDebugger

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayDebugger_structs.hpp"


namespace SDK::Params
{

// Function GameplayDebugger.GameplayDebuggerCategoryReplicator.ClientDataPackPacket
// 0x0030 (0x0030 - 0x0000)
struct GameplayDebuggerCategoryReplicator_ClientDataPackPacket final
{
public:
	struct FGameplayDebuggerDataPackRPCParams     Params_0;                                          // 0x0000(0x0030)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayDebuggerCategoryReplicator_ClientDataPackPacket) == 0x000008, "Wrong alignment on GameplayDebuggerCategoryReplicator_ClientDataPackPacket");
static_assert(sizeof(GameplayDebuggerCategoryReplicator_ClientDataPackPacket) == 0x000030, "Wrong size on GameplayDebuggerCategoryReplicator_ClientDataPackPacket");
static_assert(offsetof(GameplayDebuggerCategoryReplicator_ClientDataPackPacket, Params_0) == 0x000000, "Member 'GameplayDebuggerCategoryReplicator_ClientDataPackPacket::Params_0' has a wrong offset!");

// Function GameplayDebugger.GameplayDebuggerCategoryReplicator.ServerSendCategoryInputEvent
// 0x0008 (0x0008 - 0x0000)
struct GameplayDebuggerCategoryReplicator_ServerSendCategoryInputEvent final
{
public:
	int32                                         CategoryId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HandlerId;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayDebuggerCategoryReplicator_ServerSendCategoryInputEvent) == 0x000004, "Wrong alignment on GameplayDebuggerCategoryReplicator_ServerSendCategoryInputEvent");
static_assert(sizeof(GameplayDebuggerCategoryReplicator_ServerSendCategoryInputEvent) == 0x000008, "Wrong size on GameplayDebuggerCategoryReplicator_ServerSendCategoryInputEvent");
static_assert(offsetof(GameplayDebuggerCategoryReplicator_ServerSendCategoryInputEvent, CategoryId) == 0x000000, "Member 'GameplayDebuggerCategoryReplicator_ServerSendCategoryInputEvent::CategoryId' has a wrong offset!");
static_assert(offsetof(GameplayDebuggerCategoryReplicator_ServerSendCategoryInputEvent, HandlerId) == 0x000004, "Member 'GameplayDebuggerCategoryReplicator_ServerSendCategoryInputEvent::HandlerId' has a wrong offset!");

// Function GameplayDebugger.GameplayDebuggerCategoryReplicator.ServerSendExtensionInputEvent
// 0x0008 (0x0008 - 0x0000)
struct GameplayDebuggerCategoryReplicator_ServerSendExtensionInputEvent final
{
public:
	int32                                         ExtensionId;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HandlerId;                                         // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayDebuggerCategoryReplicator_ServerSendExtensionInputEvent) == 0x000004, "Wrong alignment on GameplayDebuggerCategoryReplicator_ServerSendExtensionInputEvent");
static_assert(sizeof(GameplayDebuggerCategoryReplicator_ServerSendExtensionInputEvent) == 0x000008, "Wrong size on GameplayDebuggerCategoryReplicator_ServerSendExtensionInputEvent");
static_assert(offsetof(GameplayDebuggerCategoryReplicator_ServerSendExtensionInputEvent, ExtensionId) == 0x000000, "Member 'GameplayDebuggerCategoryReplicator_ServerSendExtensionInputEvent::ExtensionId' has a wrong offset!");
static_assert(offsetof(GameplayDebuggerCategoryReplicator_ServerSendExtensionInputEvent, HandlerId) == 0x000004, "Member 'GameplayDebuggerCategoryReplicator_ServerSendExtensionInputEvent::HandlerId' has a wrong offset!");

// Function GameplayDebugger.GameplayDebuggerCategoryReplicator.ServerSetCategoryEnabled
// 0x0008 (0x0008 - 0x0000)
struct GameplayDebuggerCategoryReplicator_ServerSetCategoryEnabled final
{
public:
	int32                                         CategoryId;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameplayDebuggerCategoryReplicator_ServerSetCategoryEnabled) == 0x000004, "Wrong alignment on GameplayDebuggerCategoryReplicator_ServerSetCategoryEnabled");
static_assert(sizeof(GameplayDebuggerCategoryReplicator_ServerSetCategoryEnabled) == 0x000008, "Wrong size on GameplayDebuggerCategoryReplicator_ServerSetCategoryEnabled");
static_assert(offsetof(GameplayDebuggerCategoryReplicator_ServerSetCategoryEnabled, CategoryId) == 0x000000, "Member 'GameplayDebuggerCategoryReplicator_ServerSetCategoryEnabled::CategoryId' has a wrong offset!");
static_assert(offsetof(GameplayDebuggerCategoryReplicator_ServerSetCategoryEnabled, bEnable) == 0x000004, "Member 'GameplayDebuggerCategoryReplicator_ServerSetCategoryEnabled::bEnable' has a wrong offset!");

// Function GameplayDebugger.GameplayDebuggerCategoryReplicator.ServerSetDebugActor
// 0x0010 (0x0010 - 0x0000)
struct GameplayDebuggerCategoryReplicator_ServerSetDebugActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectInEditor;                                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(GameplayDebuggerCategoryReplicator_ServerSetDebugActor) == 0x000008, "Wrong alignment on GameplayDebuggerCategoryReplicator_ServerSetDebugActor");
static_assert(sizeof(GameplayDebuggerCategoryReplicator_ServerSetDebugActor) == 0x000010, "Wrong size on GameplayDebuggerCategoryReplicator_ServerSetDebugActor");
static_assert(offsetof(GameplayDebuggerCategoryReplicator_ServerSetDebugActor, Actor) == 0x000000, "Member 'GameplayDebuggerCategoryReplicator_ServerSetDebugActor::Actor' has a wrong offset!");
static_assert(offsetof(GameplayDebuggerCategoryReplicator_ServerSetDebugActor, bSelectInEditor) == 0x000008, "Member 'GameplayDebuggerCategoryReplicator_ServerSetDebugActor::bSelectInEditor' has a wrong offset!");

// Function GameplayDebugger.GameplayDebuggerCategoryReplicator.ServerSetEnabled
// 0x0001 (0x0001 - 0x0000)
struct GameplayDebuggerCategoryReplicator_ServerSetEnabled final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayDebuggerCategoryReplicator_ServerSetEnabled) == 0x000001, "Wrong alignment on GameplayDebuggerCategoryReplicator_ServerSetEnabled");
static_assert(sizeof(GameplayDebuggerCategoryReplicator_ServerSetEnabled) == 0x000001, "Wrong size on GameplayDebuggerCategoryReplicator_ServerSetEnabled");
static_assert(offsetof(GameplayDebuggerCategoryReplicator_ServerSetEnabled, bEnable) == 0x000000, "Member 'GameplayDebuggerCategoryReplicator_ServerSetEnabled::bEnable' has a wrong offset!");

// Function GameplayDebugger.GameplayDebuggerCategoryReplicator.ServerSetViewPoint
// 0x0030 (0x0030 - 0x0000)
struct GameplayDebuggerCategoryReplicator_ServerSetViewPoint final
{
public:
	struct FVector                                InViewLocation;                                    // 0x0000(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InViewDirection;                                   // 0x0018(0x0018)(ConstParm, Parm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(GameplayDebuggerCategoryReplicator_ServerSetViewPoint) == 0x000008, "Wrong alignment on GameplayDebuggerCategoryReplicator_ServerSetViewPoint");
static_assert(sizeof(GameplayDebuggerCategoryReplicator_ServerSetViewPoint) == 0x000030, "Wrong size on GameplayDebuggerCategoryReplicator_ServerSetViewPoint");
static_assert(offsetof(GameplayDebuggerCategoryReplicator_ServerSetViewPoint, InViewLocation) == 0x000000, "Member 'GameplayDebuggerCategoryReplicator_ServerSetViewPoint::InViewLocation' has a wrong offset!");
static_assert(offsetof(GameplayDebuggerCategoryReplicator_ServerSetViewPoint, InViewDirection) == 0x000018, "Member 'GameplayDebuggerCategoryReplicator_ServerSetViewPoint::InViewDirection' has a wrong offset!");

}

