#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_BeesEasy

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GC_BeesEasy.GC_BeesEasy_C.ExecuteUbergraph_GC_BeesEasy
// 0x0008 (0x0008 - 0x0000)
struct GC_BeesEasy_C_ExecuteUbergraph_GC_BeesEasy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_BeesEasy_C_ExecuteUbergraph_GC_BeesEasy) == 0x000004, "Wrong alignment on GC_BeesEasy_C_ExecuteUbergraph_GC_BeesEasy");
static_assert(sizeof(GC_BeesEasy_C_ExecuteUbergraph_GC_BeesEasy) == 0x000008, "Wrong size on GC_BeesEasy_C_ExecuteUbergraph_GC_BeesEasy");
static_assert(offsetof(GC_BeesEasy_C_ExecuteUbergraph_GC_BeesEasy, EntryPoint) == 0x000000, "Member 'GC_BeesEasy_C_ExecuteUbergraph_GC_BeesEasy::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_BeesEasy_C_ExecuteUbergraph_GC_BeesEasy, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'GC_BeesEasy_C_ExecuteUbergraph_GC_BeesEasy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BeesEasy_C_ExecuteUbergraph_GC_BeesEasy, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'GC_BeesEasy_C_ExecuteUbergraph_GC_BeesEasy::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function GC_BeesEasy.GC_BeesEasy_C.OnActive
// 0x0120 (0x0120 - 0x0000)
struct GC_BeesEasy_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATICharacterBase*                       K2Node_DynamicCast_AsThe_Isle_Character_Base;      // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsAlive_ReturnValue;                   // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_BeesEasy_C_OnActive) == 0x000008, "Wrong alignment on GC_BeesEasy_C_OnActive");
static_assert(sizeof(GC_BeesEasy_C_OnActive) == 0x000120, "Wrong size on GC_BeesEasy_C_OnActive");
static_assert(offsetof(GC_BeesEasy_C_OnActive, MyTarget) == 0x000000, "Member 'GC_BeesEasy_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_BeesEasy_C_OnActive, Parameters) == 0x000008, "Member 'GC_BeesEasy_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_BeesEasy_C_OnActive, ReturnValue) == 0x0000E0, "Member 'GC_BeesEasy_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BeesEasy_C_OnActive, K2Node_DynamicCast_AsThe_Isle_Character_Base) == 0x0000E8, "Member 'GC_BeesEasy_C_OnActive::K2Node_DynamicCast_AsThe_Isle_Character_Base' has a wrong offset!");
static_assert(offsetof(GC_BeesEasy_C_OnActive, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GC_BeesEasy_C_OnActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_BeesEasy_C_OnActive, CallFunc_GetIsAlive_ReturnValue) == 0x0000F1, "Member 'GC_BeesEasy_C_OnActive::CallFunc_GetIsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BeesEasy_C_OnActive, CallFunc_GetSocketLocation_ReturnValue) == 0x0000F8, "Member 'GC_BeesEasy_C_OnActive::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BeesEasy_C_OnActive, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000110, "Member 'GC_BeesEasy_C_OnActive::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BeesEasy_C_OnActive, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000118, "Member 'GC_BeesEasy_C_OnActive::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");

// Function GC_BeesEasy.GC_BeesEasy_C.OnRemove
// 0x00E8 (0x00E8 - 0x0000)
struct GC_BeesEasy_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_BeesEasy_C_OnRemove) == 0x000008, "Wrong alignment on GC_BeesEasy_C_OnRemove");
static_assert(sizeof(GC_BeesEasy_C_OnRemove) == 0x0000E8, "Wrong size on GC_BeesEasy_C_OnRemove");
static_assert(offsetof(GC_BeesEasy_C_OnRemove, MyTarget) == 0x000000, "Member 'GC_BeesEasy_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_BeesEasy_C_OnRemove, Parameters) == 0x000008, "Member 'GC_BeesEasy_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GC_BeesEasy_C_OnRemove, ReturnValue) == 0x0000E0, "Member 'GC_BeesEasy_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BeesEasy_C_OnRemove, CallFunc_IsValid_ReturnValue) == 0x0000E1, "Member 'GC_BeesEasy_C_OnRemove::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_BeesEasy_C_OnRemove, CallFunc_IsValid_ReturnValue_1) == 0x0000E2, "Member 'GC_BeesEasy_C_OnRemove::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

