#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Bleeding

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "TheIsle_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Bleeding.GC_Bleeding_C
// 0x0030 (0x0330 - 0x0300)
class AGC_Bleeding_C final : public AGameplayCueNotify_Actor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ATICharacterBase*                       CueOwner;                                          // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        BloodDripScale;                                    // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Scale;                                             // 0x0318(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Bleeding_C">();
	}
	static class AGC_Bleeding_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Bleeding_C>();
	}
};
static_assert(alignof(AGC_Bleeding_C) == 0x000008, "Wrong alignment on AGC_Bleeding_C");
static_assert(sizeof(AGC_Bleeding_C) == 0x000330, "Wrong size on AGC_Bleeding_C");
static_assert(offsetof(AGC_Bleeding_C, DefaultSceneRoot) == 0x000300, "Member 'AGC_Bleeding_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGC_Bleeding_C, CueOwner) == 0x000308, "Member 'AGC_Bleeding_C::CueOwner' has a wrong offset!");
static_assert(offsetof(AGC_Bleeding_C, BloodDripScale) == 0x000310, "Member 'AGC_Bleeding_C::BloodDripScale' has a wrong offset!");
static_assert(offsetof(AGC_Bleeding_C, Scale) == 0x000318, "Member 'AGC_Bleeding_C::Scale' has a wrong offset!");

}

