#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Bees

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Bees.GC_Bees_C
// 0x0030 (0x0330 - 0x0300)
class AGC_Bees_C final : public AGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ATICharacterBase*                       CueTarget;                                         // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsAlive;                                          // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      BeesParticle;                                      // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        BeesSound;                                         // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_Bees(int32 EntryPoint);
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void ReceiveDestroyed();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Bees_C">();
	}
	static class AGC_Bees_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Bees_C>();
	}
};
static_assert(alignof(AGC_Bees_C) == 0x000008, "Wrong alignment on AGC_Bees_C");
static_assert(sizeof(AGC_Bees_C) == 0x000330, "Wrong size on AGC_Bees_C");
static_assert(offsetof(AGC_Bees_C, UberGraphFrame) == 0x000300, "Member 'AGC_Bees_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_Bees_C, DefaultSceneRoot) == 0x000308, "Member 'AGC_Bees_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGC_Bees_C, CueTarget) == 0x000310, "Member 'AGC_Bees_C::CueTarget' has a wrong offset!");
static_assert(offsetof(AGC_Bees_C, bIsAlive) == 0x000318, "Member 'AGC_Bees_C::bIsAlive' has a wrong offset!");
static_assert(offsetof(AGC_Bees_C, BeesParticle) == 0x000320, "Member 'AGC_Bees_C::BeesParticle' has a wrong offset!");
static_assert(offsetof(AGC_Bees_C, BeesSound) == 0x000328, "Member 'AGC_Bees_C::BeesSound' has a wrong offset!");

}

