#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_BiteImpact

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "TheIsle_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_BiteImpact.GC_BiteImpact_C
// 0x0160 (0x0460 - 0x0300)
class AGC_BiteImpact_C : public AGameplayCueNotify_Actor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ATICharacterBase*                       CueTarget;                                         // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           AnimToPlay;                                        // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           AnimToPlayJuv;                                     // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAttribute                     WeightAttribute;                                   // 0x0320(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayAttribute                     HealthAttribute;                                   // 0x0358(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	double                                        ForceStrength;                                     // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EffectScale;                                       // 0x0398(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             PainSound;                                         // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocationHit;                                       // 0x03B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RotationXVector;                                   // 0x03D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class FName                                   AdultHitHeavy;                                     // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SubAdultHitHeavy;                                  // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   JuvHitHeavy;                                       // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   HatchlingHitHeavy;                                 // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AdultHitLight;                                     // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SubAdultHitLight;                                  // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   JuvHitLight;                                       // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   HatchlingHitLight;                                 // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsStaggerOrKnockdown;                             // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATICharacterBase*                       InstigatorRef;                                     // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        InstigatorWeight;                                  // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TargetWeight;                                      // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsAlive;                                          // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayExtraImpactBiteSound;                         // 0x0449(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44A[0x2];                                      // 0x044A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ImpactBloodEffect;                                 // 0x044C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ImpactBluntEffect;                                 // 0x0454(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Check_If_Montage_Playing_Is_Equal_To_This(const struct FGrowthMontages& GrowthMontages, bool* bSame);
	void CheckDirection(const struct FVector& CauserLocation, class FString* DirectionString);
	void GetAnimToPlay(const class AActor* OriginalInstigator, class UAnimMontage** Animation);
	void GetAnimToPlayJuv(const class AActor* OriginalInstigator, class UAnimMontage** Animation);
	void IsWaterLatchingBeipi(bool* Value);
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void ResetPhysics();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_BiteImpact_C">();
	}
	static class AGC_BiteImpact_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_BiteImpact_C>();
	}
};
static_assert(alignof(AGC_BiteImpact_C) == 0x000008, "Wrong alignment on AGC_BiteImpact_C");
static_assert(sizeof(AGC_BiteImpact_C) == 0x000460, "Wrong size on AGC_BiteImpact_C");
static_assert(offsetof(AGC_BiteImpact_C, DefaultSceneRoot) == 0x000300, "Member 'AGC_BiteImpact_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, CueTarget) == 0x000308, "Member 'AGC_BiteImpact_C::CueTarget' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, AnimToPlay) == 0x000310, "Member 'AGC_BiteImpact_C::AnimToPlay' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, AnimToPlayJuv) == 0x000318, "Member 'AGC_BiteImpact_C::AnimToPlayJuv' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, WeightAttribute) == 0x000320, "Member 'AGC_BiteImpact_C::WeightAttribute' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, HealthAttribute) == 0x000358, "Member 'AGC_BiteImpact_C::HealthAttribute' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, ForceStrength) == 0x000390, "Member 'AGC_BiteImpact_C::ForceStrength' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, EffectScale) == 0x000398, "Member 'AGC_BiteImpact_C::EffectScale' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, PainSound) == 0x0003B0, "Member 'AGC_BiteImpact_C::PainSound' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, LocationHit) == 0x0003B8, "Member 'AGC_BiteImpact_C::LocationHit' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, RotationXVector) == 0x0003D0, "Member 'AGC_BiteImpact_C::RotationXVector' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, AdultHitHeavy) == 0x0003E8, "Member 'AGC_BiteImpact_C::AdultHitHeavy' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, SubAdultHitHeavy) == 0x0003F0, "Member 'AGC_BiteImpact_C::SubAdultHitHeavy' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, JuvHitHeavy) == 0x0003F8, "Member 'AGC_BiteImpact_C::JuvHitHeavy' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, HatchlingHitHeavy) == 0x000400, "Member 'AGC_BiteImpact_C::HatchlingHitHeavy' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, AdultHitLight) == 0x000408, "Member 'AGC_BiteImpact_C::AdultHitLight' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, SubAdultHitLight) == 0x000410, "Member 'AGC_BiteImpact_C::SubAdultHitLight' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, JuvHitLight) == 0x000418, "Member 'AGC_BiteImpact_C::JuvHitLight' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, HatchlingHitLight) == 0x000420, "Member 'AGC_BiteImpact_C::HatchlingHitLight' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, bIsStaggerOrKnockdown) == 0x000428, "Member 'AGC_BiteImpact_C::bIsStaggerOrKnockdown' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, InstigatorRef) == 0x000430, "Member 'AGC_BiteImpact_C::InstigatorRef' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, InstigatorWeight) == 0x000438, "Member 'AGC_BiteImpact_C::InstigatorWeight' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, TargetWeight) == 0x000440, "Member 'AGC_BiteImpact_C::TargetWeight' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, bIsAlive) == 0x000448, "Member 'AGC_BiteImpact_C::bIsAlive' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, bPlayExtraImpactBiteSound) == 0x000449, "Member 'AGC_BiteImpact_C::bPlayExtraImpactBiteSound' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, ImpactBloodEffect) == 0x00044C, "Member 'AGC_BiteImpact_C::ImpactBloodEffect' has a wrong offset!");
static_assert(offsetof(AGC_BiteImpact_C, ImpactBluntEffect) == 0x000454, "Member 'AGC_BiteImpact_C::ImpactBluntEffect' has a wrong offset!");

}

