#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_DeactivateHeartIcon

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_DeactivateHeartIcon.GC_DeactivateHeartIcon_C.OnActive
// 0x00E8 (0x00E8 - 0x0000)
struct GC_DeactivateHeartIcon_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_DeactivateHeartIcon_C_OnActive) == 0x000008, "Wrong alignment on GC_DeactivateHeartIcon_C_OnActive");
static_assert(sizeof(GC_DeactivateHeartIcon_C_OnActive) == 0x0000E8, "Wrong size on GC_DeactivateHeartIcon_C_OnActive");
static_assert(offsetof(GC_DeactivateHeartIcon_C_OnActive, MyTarget) == 0x000000, "Member 'GC_DeactivateHeartIcon_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_DeactivateHeartIcon_C_OnActive, Parameters) == 0x000008, "Member 'GC_DeactivateHeartIcon_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_DeactivateHeartIcon_C_OnActive, ReturnValue) == 0x0000E0, "Member 'GC_DeactivateHeartIcon_C_OnActive::ReturnValue' has a wrong offset!");

// Function GC_DeactivateHeartIcon.GC_DeactivateHeartIcon_C.OnExecute
// 0x00E8 (0x00E8 - 0x0000)
struct GC_DeactivateHeartIcon_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_DeactivateHeartIcon_C_OnExecute) == 0x000008, "Wrong alignment on GC_DeactivateHeartIcon_C_OnExecute");
static_assert(sizeof(GC_DeactivateHeartIcon_C_OnExecute) == 0x0000E8, "Wrong size on GC_DeactivateHeartIcon_C_OnExecute");
static_assert(offsetof(GC_DeactivateHeartIcon_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_DeactivateHeartIcon_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_DeactivateHeartIcon_C_OnExecute, Parameters) == 0x000008, "Member 'GC_DeactivateHeartIcon_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_DeactivateHeartIcon_C_OnExecute, ReturnValue) == 0x0000E0, "Member 'GC_DeactivateHeartIcon_C_OnExecute::ReturnValue' has a wrong offset!");

}

