#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Dragged

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Dragged.GC_Dragged_C.ExecutePickedUp
// 0x0010 (0x0010 - 0x0000)
struct GC_Dragged_C_ExecutePickedUp final
{
public:
	class FName                                   bone;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATICharacterBase*                       Target;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Dragged_C_ExecutePickedUp) == 0x000008, "Wrong alignment on GC_Dragged_C_ExecutePickedUp");
static_assert(sizeof(GC_Dragged_C_ExecutePickedUp) == 0x000010, "Wrong size on GC_Dragged_C_ExecutePickedUp");
static_assert(offsetof(GC_Dragged_C_ExecutePickedUp, bone) == 0x000000, "Member 'GC_Dragged_C_ExecutePickedUp::bone' has a wrong offset!");
static_assert(offsetof(GC_Dragged_C_ExecutePickedUp, Target) == 0x000008, "Member 'GC_Dragged_C_ExecutePickedUp::Target' has a wrong offset!");

// Function GC_Dragged.GC_Dragged_C.ExecuteUbergraph_GC_Dragged
// 0x0018 (0x0018 - 0x0000)
struct GC_Dragged_C_ExecuteUbergraph_GC_Dragged final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Bone;                           // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATICharacterBase*                       K2Node_CustomEvent_Target;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Dragged_C_ExecuteUbergraph_GC_Dragged) == 0x000008, "Wrong alignment on GC_Dragged_C_ExecuteUbergraph_GC_Dragged");
static_assert(sizeof(GC_Dragged_C_ExecuteUbergraph_GC_Dragged) == 0x000018, "Wrong size on GC_Dragged_C_ExecuteUbergraph_GC_Dragged");
static_assert(offsetof(GC_Dragged_C_ExecuteUbergraph_GC_Dragged, EntryPoint) == 0x000000, "Member 'GC_Dragged_C_ExecuteUbergraph_GC_Dragged::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_Dragged_C_ExecuteUbergraph_GC_Dragged, K2Node_CustomEvent_Bone) == 0x000004, "Member 'GC_Dragged_C_ExecuteUbergraph_GC_Dragged::K2Node_CustomEvent_Bone' has a wrong offset!");
static_assert(offsetof(GC_Dragged_C_ExecuteUbergraph_GC_Dragged, K2Node_CustomEvent_Target) == 0x000010, "Member 'GC_Dragged_C_ExecuteUbergraph_GC_Dragged::K2Node_CustomEvent_Target' has a wrong offset!");

// Function GC_Dragged.GC_Dragged_C.OnExecute
// 0x00F8 (0x00F8 - 0x0000)
struct GC_Dragged_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATICharacterBase*                       K2Node_DynamicCast_AsThe_Isle_Character_Base;      // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Dragged_C_OnExecute) == 0x000008, "Wrong alignment on GC_Dragged_C_OnExecute");
static_assert(sizeof(GC_Dragged_C_OnExecute) == 0x0000F8, "Wrong size on GC_Dragged_C_OnExecute");
static_assert(offsetof(GC_Dragged_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_Dragged_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Dragged_C_OnExecute, Parameters) == 0x000008, "Member 'GC_Dragged_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Dragged_C_OnExecute, ReturnValue) == 0x0000E0, "Member 'GC_Dragged_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Dragged_C_OnExecute, K2Node_DynamicCast_AsThe_Isle_Character_Base) == 0x0000E8, "Member 'GC_Dragged_C_OnExecute::K2Node_DynamicCast_AsThe_Isle_Character_Base' has a wrong offset!");
static_assert(offsetof(GC_Dragged_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GC_Dragged_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

