#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Eating

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Eating.GC_Eating_C.OnExecute
// 0x0138 (0x0138 - 0x0000)
struct GC_Eating_C_OnExecute final
{
public:
	class AActor*                                 MyTarget_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATICharacterBase*                       K2Node_DynamicCast_AsThe_Isle_Character_Base;      // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnExecute_ReturnValue;                    // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetEdibleNearby_ReturnValue;              // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATICharacterBase*                       K2Node_DynamicCast_AsThe_Isle_Character_Base_1;    // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0113(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIGoreBase*                            CallFunc_GetDraggedPickablePiece_ReturnValue;      // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_123[0x5];                                      // 0x0123(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Eating_C_OnExecute) == 0x000008, "Wrong alignment on GC_Eating_C_OnExecute");
static_assert(sizeof(GC_Eating_C_OnExecute) == 0x000138, "Wrong size on GC_Eating_C_OnExecute");
static_assert(offsetof(GC_Eating_C_OnExecute, MyTarget_0) == 0x000000, "Member 'GC_Eating_C_OnExecute::MyTarget_0' has a wrong offset!");
static_assert(offsetof(GC_Eating_C_OnExecute, Parameters) == 0x000008, "Member 'GC_Eating_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Eating_C_OnExecute, ReturnValue) == 0x0000E0, "Member 'GC_Eating_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Eating_C_OnExecute, K2Node_DynamicCast_AsThe_Isle_Character_Base) == 0x0000E8, "Member 'GC_Eating_C_OnExecute::K2Node_DynamicCast_AsThe_Isle_Character_Base' has a wrong offset!");
static_assert(offsetof(GC_Eating_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GC_Eating_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_Eating_C_OnExecute, CallFunc_OnExecute_ReturnValue) == 0x0000F1, "Member 'GC_Eating_C_OnExecute::CallFunc_OnExecute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Eating_C_OnExecute, CallFunc_GetEdibleNearby_ReturnValue) == 0x0000F8, "Member 'GC_Eating_C_OnExecute::CallFunc_GetEdibleNearby_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Eating_C_OnExecute, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000100, "Member 'GC_Eating_C_OnExecute::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Eating_C_OnExecute, K2Node_DynamicCast_AsThe_Isle_Character_Base_1) == 0x000108, "Member 'GC_Eating_C_OnExecute::K2Node_DynamicCast_AsThe_Isle_Character_Base_1' has a wrong offset!");
static_assert(offsetof(GC_Eating_C_OnExecute, K2Node_DynamicCast_bSuccess_1) == 0x000110, "Member 'GC_Eating_C_OnExecute::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_Eating_C_OnExecute, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000111, "Member 'GC_Eating_C_OnExecute::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Eating_C_OnExecute, CallFunc_IsValid_ReturnValue) == 0x000112, "Member 'GC_Eating_C_OnExecute::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Eating_C_OnExecute, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000113, "Member 'GC_Eating_C_OnExecute::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Eating_C_OnExecute, CallFunc_GetDraggedPickablePiece_ReturnValue) == 0x000118, "Member 'GC_Eating_C_OnExecute::CallFunc_GetDraggedPickablePiece_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Eating_C_OnExecute, CallFunc_BooleanOR_ReturnValue) == 0x000120, "Member 'GC_Eating_C_OnExecute::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Eating_C_OnExecute, CallFunc_IsValid_ReturnValue_1) == 0x000121, "Member 'GC_Eating_C_OnExecute::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Eating_C_OnExecute, CallFunc_BooleanOR_ReturnValue_1) == 0x000122, "Member 'GC_Eating_C_OnExecute::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Eating_C_OnExecute, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000128, "Member 'GC_Eating_C_OnExecute::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Eating_C_OnExecute, CallFunc_BooleanAND_ReturnValue) == 0x000130, "Member 'GC_Eating_C_OnExecute::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Eating_C_OnExecute, CallFunc_BooleanOR_ReturnValue_2) == 0x000131, "Member 'GC_Eating_C_OnExecute::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

}

