#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_ForcePouncerFixRotation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GC_ForcePouncerFixRotation.GC_ForcePouncerFixRotation_C.OnExecute
// 0x0360 (0x0360 - 0x0000)
struct GC_ForcePouncerFixRotation_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATICharacterBase*                       K2Node_DynamicCast_AsThe_Isle_Character_Base;      // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0100(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0240(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0338(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_ForcePouncerFixRotation_C_OnExecute) == 0x000008, "Wrong alignment on GC_ForcePouncerFixRotation_C_OnExecute");
static_assert(sizeof(GC_ForcePouncerFixRotation_C_OnExecute) == 0x000360, "Wrong size on GC_ForcePouncerFixRotation_C_OnExecute");
static_assert(offsetof(GC_ForcePouncerFixRotation_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_ForcePouncerFixRotation_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_ForcePouncerFixRotation_C_OnExecute, Parameters) == 0x000008, "Member 'GC_ForcePouncerFixRotation_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_ForcePouncerFixRotation_C_OnExecute, ReturnValue) == 0x0000E0, "Member 'GC_ForcePouncerFixRotation_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ForcePouncerFixRotation_C_OnExecute, K2Node_DynamicCast_AsThe_Isle_Character_Base) == 0x0000E8, "Member 'GC_ForcePouncerFixRotation_C_OnExecute::K2Node_DynamicCast_AsThe_Isle_Character_Base' has a wrong offset!");
static_assert(offsetof(GC_ForcePouncerFixRotation_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GC_ForcePouncerFixRotation_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_ForcePouncerFixRotation_C_OnExecute, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000F8, "Member 'GC_ForcePouncerFixRotation_C_OnExecute::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ForcePouncerFixRotation_C_OnExecute, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000100, "Member 'GC_ForcePouncerFixRotation_C_OnExecute::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GC_ForcePouncerFixRotation_C_OnExecute, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0001F8, "Member 'GC_ForcePouncerFixRotation_C_OnExecute::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ForcePouncerFixRotation_C_OnExecute, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000200, "Member 'GC_ForcePouncerFixRotation_C_OnExecute::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ForcePouncerFixRotation_C_OnExecute, CallFunc_MakeVector_ReturnValue) == 0x000218, "Member 'GC_ForcePouncerFixRotation_C_OnExecute::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ForcePouncerFixRotation_C_OnExecute, CallFunc_BreakRotator_Roll) == 0x000230, "Member 'GC_ForcePouncerFixRotation_C_OnExecute::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GC_ForcePouncerFixRotation_C_OnExecute, CallFunc_BreakRotator_Pitch) == 0x000234, "Member 'GC_ForcePouncerFixRotation_C_OnExecute::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GC_ForcePouncerFixRotation_C_OnExecute, CallFunc_BreakRotator_Yaw) == 0x000238, "Member 'GC_ForcePouncerFixRotation_C_OnExecute::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GC_ForcePouncerFixRotation_C_OnExecute, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000240, "Member 'GC_ForcePouncerFixRotation_C_OnExecute::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GC_ForcePouncerFixRotation_C_OnExecute, CallFunc_MakeRotator_ReturnValue) == 0x000338, "Member 'GC_ForcePouncerFixRotation_C_OnExecute::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ForcePouncerFixRotation_C_OnExecute, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000350, "Member 'GC_ForcePouncerFixRotation_C_OnExecute::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_ForcePouncerFixRotation_C_OnExecute, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000358, "Member 'GC_ForcePouncerFixRotation_C_OnExecute::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

