#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Knockdown

#include "Basic.hpp"

#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_Knockdown.GC_Knockdown_C
// 0x0018 (0x0318 - 0x0300)
class AGC_Knockdown_C final : public AGameplayCueNotify_Actor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ATICharacterBase*                       CueTarget;                                         // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           AnimToPlay;                                        // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CheckDirection(const struct FVector& CauserLocation, class FString* DirectionString);
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void ResetPhysics();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_Knockdown_C">();
	}
	static class AGC_Knockdown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_Knockdown_C>();
	}
};
static_assert(alignof(AGC_Knockdown_C) == 0x000008, "Wrong alignment on AGC_Knockdown_C");
static_assert(sizeof(AGC_Knockdown_C) == 0x000318, "Wrong size on AGC_Knockdown_C");
static_assert(offsetof(AGC_Knockdown_C, DefaultSceneRoot) == 0x000300, "Member 'AGC_Knockdown_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGC_Knockdown_C, CueTarget) == 0x000308, "Member 'AGC_Knockdown_C::CueTarget' has a wrong offset!");
static_assert(offsetof(AGC_Knockdown_C, AnimToPlay) == 0x000310, "Member 'AGC_Knockdown_C::AnimToPlay' has a wrong offset!");

}

