#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_Knockdown

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_Knockdown.GC_Knockdown_C.CheckDirection
// 0x0148 (0x0148 - 0x0000)
struct GC_Knockdown_C_CheckDirection final
{
public:
	struct FVector                                CauserLocation;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 DirectionString;                                   // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 DirectionResult;                                   // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ProjectVectorOnToPlane_ReturnValue;       // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SignOfFloat_ReturnValue;                  // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegAcos_ReturnValue;                      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default;                             // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x013E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x013F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Knockdown_C_CheckDirection) == 0x000008, "Wrong alignment on GC_Knockdown_C_CheckDirection");
static_assert(sizeof(GC_Knockdown_C_CheckDirection) == 0x000148, "Wrong size on GC_Knockdown_C_CheckDirection");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, CauserLocation) == 0x000000, "Member 'GC_Knockdown_C_CheckDirection::CauserLocation' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, DirectionString) == 0x000018, "Member 'GC_Knockdown_C_CheckDirection::DirectionString' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, DirectionResult) == 0x000028, "Member 'GC_Knockdown_C_CheckDirection::DirectionResult' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, Temp_bool_Variable) == 0x000038, "Member 'GC_Knockdown_C_CheckDirection::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, Temp_real_Variable) == 0x000040, "Member 'GC_Knockdown_C_CheckDirection::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, CallFunc_GetActorForwardVector_ReturnValue) == 0x000048, "Member 'GC_Knockdown_C_CheckDirection::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, CallFunc_GetActorRightVector_ReturnValue) == 0x000060, "Member 'GC_Knockdown_C_CheckDirection::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, CallFunc_GetActorUpVector_ReturnValue) == 0x000078, "Member 'GC_Knockdown_C_CheckDirection::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000090, "Member 'GC_Knockdown_C_CheckDirection::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000A8, "Member 'GC_Knockdown_C_CheckDirection::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, CallFunc_ProjectVectorOnToPlane_ReturnValue) == 0x0000C0, "Member 'GC_Knockdown_C_CheckDirection::CallFunc_ProjectVectorOnToPlane_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, CallFunc_Normal_ReturnValue) == 0x0000D8, "Member 'GC_Knockdown_C_CheckDirection::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, CallFunc_Dot_VectorVector_ReturnValue) == 0x0000F0, "Member 'GC_Knockdown_C_CheckDirection::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x0000F8, "Member 'GC_Knockdown_C_CheckDirection::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, CallFunc_SignOfFloat_ReturnValue) == 0x000100, "Member 'GC_Knockdown_C_CheckDirection::CallFunc_SignOfFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, CallFunc_DegAcos_ReturnValue) == 0x000108, "Member 'GC_Knockdown_C_CheckDirection::CallFunc_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000110, "Member 'GC_Knockdown_C_CheckDirection::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, K2Node_Select_Default) == 0x000118, "Member 'GC_Knockdown_C_CheckDirection::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000120, "Member 'GC_Knockdown_C_CheckDirection::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000128, "Member 'GC_Knockdown_C_CheckDirection::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, CallFunc_Abs_ReturnValue) == 0x000130, "Member 'GC_Knockdown_C_CheckDirection::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000138, "Member 'GC_Knockdown_C_CheckDirection::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000139, "Member 'GC_Knockdown_C_CheckDirection::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00013A, "Member 'GC_Knockdown_C_CheckDirection::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, CallFunc_BooleanAND_ReturnValue) == 0x00013B, "Member 'GC_Knockdown_C_CheckDirection::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x00013C, "Member 'GC_Knockdown_C_CheckDirection::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x00013D, "Member 'GC_Knockdown_C_CheckDirection::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x00013E, "Member 'GC_Knockdown_C_CheckDirection::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, CallFunc_BooleanAND_ReturnValue_1) == 0x00013F, "Member 'GC_Knockdown_C_CheckDirection::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_CheckDirection, CallFunc_BooleanAND_ReturnValue_2) == 0x000140, "Member 'GC_Knockdown_C_CheckDirection::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

// Function GC_Knockdown.GC_Knockdown_C.OnExecute
// 0x0118 (0x0118 - 0x0000)
struct GC_Knockdown_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   MontageName;                                       // 0x00E4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        EmitterToSpawn;                                    // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   HitBone;                                           // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactPoint;                                       // 0x0100(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Knockdown_C_OnExecute) == 0x000008, "Wrong alignment on GC_Knockdown_C_OnExecute");
static_assert(sizeof(GC_Knockdown_C_OnExecute) == 0x000118, "Wrong size on GC_Knockdown_C_OnExecute");
static_assert(offsetof(GC_Knockdown_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_Knockdown_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_OnExecute, Parameters) == 0x000008, "Member 'GC_Knockdown_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_OnExecute, ReturnValue) == 0x0000E0, "Member 'GC_Knockdown_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_OnExecute, MontageName) == 0x0000E4, "Member 'GC_Knockdown_C_OnExecute::MontageName' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_OnExecute, EmitterToSpawn) == 0x0000F0, "Member 'GC_Knockdown_C_OnExecute::EmitterToSpawn' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_OnExecute, HitBone) == 0x0000F8, "Member 'GC_Knockdown_C_OnExecute::HitBone' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_OnExecute, ImpactPoint) == 0x000100, "Member 'GC_Knockdown_C_OnExecute::ImpactPoint' has a wrong offset!");

// Function GC_Knockdown.GC_Knockdown_C.ResetPhysics
// 0x0068 (0x0068 - 0x0000)
struct GC_Knockdown_C_ResetPhysics final
{
public:
	struct FPhysicalAnimationData                 K2Node_MakeStruct_PhysicalAnimationData;           // 0x0000(0x0024)(NoDestructor)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_2;            // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPhysicalAnimationData                 K2Node_MakeStruct_PhysicalAnimationData_1;         // 0x003C(0x0024)(NoDestructor)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_3;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_Knockdown_C_ResetPhysics) == 0x000004, "Wrong alignment on GC_Knockdown_C_ResetPhysics");
static_assert(sizeof(GC_Knockdown_C_ResetPhysics) == 0x000068, "Wrong size on GC_Knockdown_C_ResetPhysics");
static_assert(offsetof(GC_Knockdown_C_ResetPhysics, K2Node_MakeStruct_PhysicalAnimationData) == 0x000000, "Member 'GC_Knockdown_C_ResetPhysics::K2Node_MakeStruct_PhysicalAnimationData' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_ResetPhysics, CallFunc_MakeLiteralName_ReturnValue) == 0x000024, "Member 'GC_Knockdown_C_ResetPhysics::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_ResetPhysics, CallFunc_MakeLiteralName_ReturnValue_1) == 0x00002C, "Member 'GC_Knockdown_C_ResetPhysics::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_ResetPhysics, CallFunc_MakeLiteralName_ReturnValue_2) == 0x000034, "Member 'GC_Knockdown_C_ResetPhysics::CallFunc_MakeLiteralName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_ResetPhysics, K2Node_MakeStruct_PhysicalAnimationData_1) == 0x00003C, "Member 'GC_Knockdown_C_ResetPhysics::K2Node_MakeStruct_PhysicalAnimationData_1' has a wrong offset!");
static_assert(offsetof(GC_Knockdown_C_ResetPhysics, CallFunc_MakeLiteralName_ReturnValue_3) == 0x000060, "Member 'GC_Knockdown_C_ResetPhysics::CallFunc_MakeLiteralName_ReturnValue_3' has a wrong offset!");

}

