#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_PounceMeshCorrector

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TheIsle_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GC_PounceMeshCorrector.GC_PounceMeshCorrector_C.ExecuteUbergraph_GC_PounceMeshCorrector
// 0x0128 (0x0128 - 0x0000)
struct GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityState                                 CallFunc_GetAbilityState_ReturnValue;              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0028(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector) == 0x000008, "Wrong alignment on GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector");
static_assert(sizeof(GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector) == 0x000128, "Wrong size on GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector");
static_assert(offsetof(GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector, EntryPoint) == 0x000000, "Member 'GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector, CallFunc_MakeRotator_ReturnValue) == 0x000008, "Member 'GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector, K2Node_Event_DeltaSeconds) == 0x000020, "Member 'GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector, CallFunc_GetAbilityState_ReturnValue) == 0x000025, "Member 'GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector::CallFunc_GetAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000026, "Member 'GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000028, "Member 'GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000120, "Member 'GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000121, "Member 'GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector, CallFunc_BooleanOR_ReturnValue) == 0x000122, "Member 'GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000123, "Member 'GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector, CallFunc_BooleanOR_ReturnValue_1) == 0x000124, "Member 'GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector, CallFunc_BooleanOR_ReturnValue_2) == 0x000125, "Member 'GC_PounceMeshCorrector_C_ExecuteUbergraph_GC_PounceMeshCorrector::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");

// Function GC_PounceMeshCorrector.GC_PounceMeshCorrector_C.OnActive
// 0x00F8 (0x00F8 - 0x0000)
struct GC_PounceMeshCorrector_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATICharacterBase*                       K2Node_DynamicCast_AsThe_Isle_Character_Base;      // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_PounceMeshCorrector_C_OnActive) == 0x000008, "Wrong alignment on GC_PounceMeshCorrector_C_OnActive");
static_assert(sizeof(GC_PounceMeshCorrector_C_OnActive) == 0x0000F8, "Wrong size on GC_PounceMeshCorrector_C_OnActive");
static_assert(offsetof(GC_PounceMeshCorrector_C_OnActive, MyTarget) == 0x000000, "Member 'GC_PounceMeshCorrector_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_PounceMeshCorrector_C_OnActive, Parameters) == 0x000008, "Member 'GC_PounceMeshCorrector_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_PounceMeshCorrector_C_OnActive, ReturnValue) == 0x0000E0, "Member 'GC_PounceMeshCorrector_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceMeshCorrector_C_OnActive, K2Node_DynamicCast_AsThe_Isle_Character_Base) == 0x0000E8, "Member 'GC_PounceMeshCorrector_C_OnActive::K2Node_DynamicCast_AsThe_Isle_Character_Base' has a wrong offset!");
static_assert(offsetof(GC_PounceMeshCorrector_C_OnActive, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GC_PounceMeshCorrector_C_OnActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GC_PounceMeshCorrector.GC_PounceMeshCorrector_C.OnExecute
// 0x00F8 (0x00F8 - 0x0000)
struct GC_PounceMeshCorrector_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATICharacterBase*                       K2Node_DynamicCast_AsThe_Isle_Character_Base;      // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_PounceMeshCorrector_C_OnExecute) == 0x000008, "Wrong alignment on GC_PounceMeshCorrector_C_OnExecute");
static_assert(sizeof(GC_PounceMeshCorrector_C_OnExecute) == 0x0000F8, "Wrong size on GC_PounceMeshCorrector_C_OnExecute");
static_assert(offsetof(GC_PounceMeshCorrector_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_PounceMeshCorrector_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_PounceMeshCorrector_C_OnExecute, Parameters) == 0x000008, "Member 'GC_PounceMeshCorrector_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_PounceMeshCorrector_C_OnExecute, ReturnValue) == 0x0000E0, "Member 'GC_PounceMeshCorrector_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceMeshCorrector_C_OnExecute, K2Node_DynamicCast_AsThe_Isle_Character_Base) == 0x0000E8, "Member 'GC_PounceMeshCorrector_C_OnExecute::K2Node_DynamicCast_AsThe_Isle_Character_Base' has a wrong offset!");
static_assert(offsetof(GC_PounceMeshCorrector_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GC_PounceMeshCorrector_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GC_PounceMeshCorrector.GC_PounceMeshCorrector_C.OnRemove
// 0x00E8 (0x00E8 - 0x0000)
struct GC_PounceMeshCorrector_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_PounceMeshCorrector_C_OnRemove) == 0x000008, "Wrong alignment on GC_PounceMeshCorrector_C_OnRemove");
static_assert(sizeof(GC_PounceMeshCorrector_C_OnRemove) == 0x0000E8, "Wrong size on GC_PounceMeshCorrector_C_OnRemove");
static_assert(offsetof(GC_PounceMeshCorrector_C_OnRemove, MyTarget) == 0x000000, "Member 'GC_PounceMeshCorrector_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_PounceMeshCorrector_C_OnRemove, Parameters) == 0x000008, "Member 'GC_PounceMeshCorrector_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GC_PounceMeshCorrector_C_OnRemove, ReturnValue) == 0x0000E0, "Member 'GC_PounceMeshCorrector_C_OnRemove::ReturnValue' has a wrong offset!");

// Function GC_PounceMeshCorrector.GC_PounceMeshCorrector_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GC_PounceMeshCorrector_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_PounceMeshCorrector_C_ReceiveTick) == 0x000004, "Wrong alignment on GC_PounceMeshCorrector_C_ReceiveTick");
static_assert(sizeof(GC_PounceMeshCorrector_C_ReceiveTick) == 0x000004, "Wrong size on GC_PounceMeshCorrector_C_ReceiveTick");
static_assert(offsetof(GC_PounceMeshCorrector_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GC_PounceMeshCorrector_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

