#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_PickedHornsImpale

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TheIsle_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GC_PickedHornsImpale.GC_PickedHornsImpale_C.ExecutePickedUp
// 0x0010 (0x0010 - 0x0000)
struct GC_PickedHornsImpale_C_ExecutePickedUp final
{
public:
	class FName                                   bone;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATICharacterBase*                       Target;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_PickedHornsImpale_C_ExecutePickedUp) == 0x000008, "Wrong alignment on GC_PickedHornsImpale_C_ExecutePickedUp");
static_assert(sizeof(GC_PickedHornsImpale_C_ExecutePickedUp) == 0x000010, "Wrong size on GC_PickedHornsImpale_C_ExecutePickedUp");
static_assert(offsetof(GC_PickedHornsImpale_C_ExecutePickedUp, bone) == 0x000000, "Member 'GC_PickedHornsImpale_C_ExecutePickedUp::bone' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_ExecutePickedUp, Target) == 0x000008, "Member 'GC_PickedHornsImpale_C_ExecutePickedUp::Target' has a wrong offset!");

// Function GC_PickedHornsImpale.GC_PickedHornsImpale_C.ExecuteUbergraph_GC_PickedHornsImpale
// 0x0018 (0x0018 - 0x0000)
struct GC_PickedHornsImpale_C_ExecuteUbergraph_GC_PickedHornsImpale final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Bone;                           // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATICharacterBase*                       K2Node_CustomEvent_Target;                         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_PickedHornsImpale_C_ExecuteUbergraph_GC_PickedHornsImpale) == 0x000008, "Wrong alignment on GC_PickedHornsImpale_C_ExecuteUbergraph_GC_PickedHornsImpale");
static_assert(sizeof(GC_PickedHornsImpale_C_ExecuteUbergraph_GC_PickedHornsImpale) == 0x000018, "Wrong size on GC_PickedHornsImpale_C_ExecuteUbergraph_GC_PickedHornsImpale");
static_assert(offsetof(GC_PickedHornsImpale_C_ExecuteUbergraph_GC_PickedHornsImpale, EntryPoint) == 0x000000, "Member 'GC_PickedHornsImpale_C_ExecuteUbergraph_GC_PickedHornsImpale::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_ExecuteUbergraph_GC_PickedHornsImpale, K2Node_CustomEvent_Bone) == 0x000004, "Member 'GC_PickedHornsImpale_C_ExecuteUbergraph_GC_PickedHornsImpale::K2Node_CustomEvent_Bone' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_ExecuteUbergraph_GC_PickedHornsImpale, K2Node_CustomEvent_Target) == 0x000010, "Member 'GC_PickedHornsImpale_C_ExecuteUbergraph_GC_PickedHornsImpale::K2Node_CustomEvent_Target' has a wrong offset!");

// Function GC_PickedHornsImpale.GC_PickedHornsImpale_C.OnExecute
// 0x0468 (0x0468 - 0x0000)
struct GC_PickedHornsImpale_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x00F0(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0108(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0110(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0118(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0138(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy; // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATICharacterBase*                       K2Node_DynamicCast_AsThe_Isle_Character_Base;      // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_EffectContextGetHitResult_ReturnValue;    // 0x01D0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CA[0x2];                                      // 0x02CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0308(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0320(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0348(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0370(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0388(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATIDinosaurBase*                        K2Node_DynamicCast_AsThe_Isle_Dinosaur_Base;       // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x03B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x03D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEffectsSets                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x03F0(0x0010)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x3];                                      // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGrowth_ReturnValue;                    // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFootsteps                             CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0408(0x0028)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0431(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_432[0x6];                                      // 0x0432(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0438(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0450(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Growth_ImplicitCast;            // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_PickedHornsImpale_C_OnExecute) == 0x000008, "Wrong alignment on GC_PickedHornsImpale_C_OnExecute");
static_assert(sizeof(GC_PickedHornsImpale_C_OnExecute) == 0x000468, "Wrong size on GC_PickedHornsImpale_C_OnExecute");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_PickedHornsImpale_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, Parameters) == 0x000008, "Member 'GC_PickedHornsImpale_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, ReturnValue) == 0x0000E0, "Member 'GC_PickedHornsImpale_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0000E4, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x0000E8, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x0000F0, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000108, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000110, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000118, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000138, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakGameplayCueParameters_Location) == 0x000158, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakGameplayCueParameters_Normal) == 0x000170, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000188, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000190, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000198, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x0001A0, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001A8, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001AC, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001B0, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy) == 0x0001B8, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakGameplayCueParameters_bReplicateLocationWhenUsingMinimalRepProxy' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, K2Node_DynamicCast_AsThe_Isle_Character_Base) == 0x0001C0, "Member 'GC_PickedHornsImpale_C_OnExecute::K2Node_DynamicCast_AsThe_Isle_Character_Base' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x0001C8, "Member 'GC_PickedHornsImpale_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_EffectContextGetHitResult_ReturnValue) == 0x0001D0, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_EffectContextGetHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakHitResult_bBlockingHit) == 0x0002C8, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakHitResult_bInitialOverlap) == 0x0002C9, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakHitResult_Time) == 0x0002CC, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakHitResult_Distance) == 0x0002D0, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakHitResult_Location) == 0x0002D8, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakHitResult_ImpactPoint) == 0x0002F0, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakHitResult_Normal) == 0x000308, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakHitResult_ImpactNormal) == 0x000320, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakHitResult_PhysMat) == 0x000338, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakHitResult_HitActor) == 0x000340, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakHitResult_HitComponent) == 0x000348, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakHitResult_HitBoneName) == 0x000350, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakHitResult_BoneName) == 0x000358, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakHitResult_HitItem) == 0x000360, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakHitResult_ElementIndex) == 0x000364, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakHitResult_FaceIndex) == 0x000368, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakHitResult_TraceStart) == 0x000370, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_BreakHitResult_TraceEnd) == 0x000388, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, K2Node_DynamicCast_AsThe_Isle_Dinosaur_Base) == 0x0003A0, "Member 'GC_PickedHornsImpale_C_OnExecute::K2Node_DynamicCast_AsThe_Isle_Dinosaur_Base' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, K2Node_DynamicCast_bSuccess_1) == 0x0003A8, "Member 'GC_PickedHornsImpale_C_OnExecute::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0003B0, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_MakeVector_ReturnValue) == 0x0003B8, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0003D0, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_Conv_StringToName_ReturnValue) == 0x0003E0, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_IsValid_ReturnValue) == 0x0003E8, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_GetDataTableRowFromName_OutRow) == 0x0003F0, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000400, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_GetGrowth_ReturnValue) == 0x000404, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_GetGrowth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000408, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000430, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_IsValid_ReturnValue_1) == 0x000431, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000438, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000450, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000458, "Member 'GC_PickedHornsImpale_C_OnExecute::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsImpale_C_OnExecute, K2Node_VariableSet_Growth_ImplicitCast) == 0x000460, "Member 'GC_PickedHornsImpale_C_OnExecute::K2Node_VariableSet_Growth_ImplicitCast' has a wrong offset!");

}

