#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_PounceMeshCorrector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "TheIsle_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_PounceMeshCorrector.GC_PounceMeshCorrector_C
// 0x0080 (0x0380 - 0x0300)
class AGC_PounceMeshCorrector_C final : public AGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ATICharacterBase*                       CueOwner;                                          // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          bStarted;                                          // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 PouncedActor;                                      // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketToUse;                                       // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<double, class FName>                     PouncePoints;                                      // 0x0330(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GC_PounceMeshCorrector(int32 EntryPoint);
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_PounceMeshCorrector_C">();
	}
	static class AGC_PounceMeshCorrector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_PounceMeshCorrector_C>();
	}
};
static_assert(alignof(AGC_PounceMeshCorrector_C) == 0x000008, "Wrong alignment on AGC_PounceMeshCorrector_C");
static_assert(sizeof(AGC_PounceMeshCorrector_C) == 0x000380, "Wrong size on AGC_PounceMeshCorrector_C");
static_assert(offsetof(AGC_PounceMeshCorrector_C, UberGraphFrame) == 0x000300, "Member 'AGC_PounceMeshCorrector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_PounceMeshCorrector_C, DefaultSceneRoot) == 0x000308, "Member 'AGC_PounceMeshCorrector_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGC_PounceMeshCorrector_C, CueOwner) == 0x000310, "Member 'AGC_PounceMeshCorrector_C::CueOwner' has a wrong offset!");
static_assert(offsetof(AGC_PounceMeshCorrector_C, bStarted) == 0x000318, "Member 'AGC_PounceMeshCorrector_C::bStarted' has a wrong offset!");
static_assert(offsetof(AGC_PounceMeshCorrector_C, PouncedActor) == 0x000320, "Member 'AGC_PounceMeshCorrector_C::PouncedActor' has a wrong offset!");
static_assert(offsetof(AGC_PounceMeshCorrector_C, SocketToUse) == 0x000328, "Member 'AGC_PounceMeshCorrector_C::SocketToUse' has a wrong offset!");
static_assert(offsetof(AGC_PounceMeshCorrector_C, PouncePoints) == 0x000330, "Member 'AGC_PounceMeshCorrector_C::PouncePoints' has a wrong offset!");

}

