#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_PouncedLargeCue

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_PouncedLargeCue.GC_PouncedLargeCue_C.ExecuteUbergraph_GC_PouncedLargeCue
// 0x0008 (0x0008 - 0x0000)
struct GC_PouncedLargeCue_C_ExecuteUbergraph_GC_PouncedLargeCue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_PouncedLargeCue_C_ExecuteUbergraph_GC_PouncedLargeCue) == 0x000004, "Wrong alignment on GC_PouncedLargeCue_C_ExecuteUbergraph_GC_PouncedLargeCue");
static_assert(sizeof(GC_PouncedLargeCue_C_ExecuteUbergraph_GC_PouncedLargeCue) == 0x000008, "Wrong size on GC_PouncedLargeCue_C_ExecuteUbergraph_GC_PouncedLargeCue");
static_assert(offsetof(GC_PouncedLargeCue_C_ExecuteUbergraph_GC_PouncedLargeCue, EntryPoint) == 0x000000, "Member 'GC_PouncedLargeCue_C_ExecuteUbergraph_GC_PouncedLargeCue::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_PouncedLargeCue_C_ExecuteUbergraph_GC_PouncedLargeCue, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'GC_PouncedLargeCue_C_ExecuteUbergraph_GC_PouncedLargeCue::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function GC_PouncedLargeCue.GC_PouncedLargeCue_C.OnExecute
// 0x00F8 (0x00F8 - 0x0000)
struct GC_PouncedLargeCue_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATICharacterBase*                       K2Node_DynamicCast_AsThe_Isle_Character_Base;      // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_PouncedLargeCue_C_OnExecute) == 0x000008, "Wrong alignment on GC_PouncedLargeCue_C_OnExecute");
static_assert(sizeof(GC_PouncedLargeCue_C_OnExecute) == 0x0000F8, "Wrong size on GC_PouncedLargeCue_C_OnExecute");
static_assert(offsetof(GC_PouncedLargeCue_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_PouncedLargeCue_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_PouncedLargeCue_C_OnExecute, Parameters) == 0x000008, "Member 'GC_PouncedLargeCue_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_PouncedLargeCue_C_OnExecute, ReturnValue) == 0x0000E0, "Member 'GC_PouncedLargeCue_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PouncedLargeCue_C_OnExecute, K2Node_DynamicCast_AsThe_Isle_Character_Base) == 0x0000E8, "Member 'GC_PouncedLargeCue_C_OnExecute::K2Node_DynamicCast_AsThe_Isle_Character_Base' has a wrong offset!");
static_assert(offsetof(GC_PouncedLargeCue_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GC_PouncedLargeCue_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_PouncedLargeCue_C_OnExecute, CallFunc_IsValid_ReturnValue) == 0x0000F1, "Member 'GC_PouncedLargeCue_C_OnExecute::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GC_PouncedLargeCue.GC_PouncedLargeCue_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GC_PouncedLargeCue_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_PouncedLargeCue_C_ReceiveTick) == 0x000004, "Wrong alignment on GC_PouncedLargeCue_C_ReceiveTick");
static_assert(sizeof(GC_PouncedLargeCue_C_ReceiveTick) == 0x000004, "Wrong size on GC_PouncedLargeCue_C_ReceiveTick");
static_assert(offsetof(GC_PouncedLargeCue_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GC_PouncedLargeCue_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

