#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_PickedLungeSimplified

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "TheIsle_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_PickedLungeSimplified.GC_PickedLungeSimplified_C
// 0x0048 (0x0348 - 0x0300)
class AGC_PickedLungeSimplified_C final : public AGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        EmitterToSpawn;                                    // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocationHit;                                       // 0x0318(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATICharacterBase*                       ImpaledTarget;                                     // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ATICharacterBase*                       CueOwner;                                          // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          bStarted;                                          // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_PickedLungeSimplified(int32 EntryPoint);
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_PickedLungeSimplified_C">();
	}
	static class AGC_PickedLungeSimplified_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_PickedLungeSimplified_C>();
	}
};
static_assert(alignof(AGC_PickedLungeSimplified_C) == 0x000008, "Wrong alignment on AGC_PickedLungeSimplified_C");
static_assert(sizeof(AGC_PickedLungeSimplified_C) == 0x000348, "Wrong size on AGC_PickedLungeSimplified_C");
static_assert(offsetof(AGC_PickedLungeSimplified_C, UberGraphFrame) == 0x000300, "Member 'AGC_PickedLungeSimplified_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_PickedLungeSimplified_C, DefaultSceneRoot) == 0x000308, "Member 'AGC_PickedLungeSimplified_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGC_PickedLungeSimplified_C, EmitterToSpawn) == 0x000310, "Member 'AGC_PickedLungeSimplified_C::EmitterToSpawn' has a wrong offset!");
static_assert(offsetof(AGC_PickedLungeSimplified_C, LocationHit) == 0x000318, "Member 'AGC_PickedLungeSimplified_C::LocationHit' has a wrong offset!");
static_assert(offsetof(AGC_PickedLungeSimplified_C, ImpaledTarget) == 0x000330, "Member 'AGC_PickedLungeSimplified_C::ImpaledTarget' has a wrong offset!");
static_assert(offsetof(AGC_PickedLungeSimplified_C, CueOwner) == 0x000338, "Member 'AGC_PickedLungeSimplified_C::CueOwner' has a wrong offset!");
static_assert(offsetof(AGC_PickedLungeSimplified_C, bStarted) == 0x000340, "Member 'AGC_PickedLungeSimplified_C::bStarted' has a wrong offset!");

}

