#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_PickedHornsSimplified

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_PickedHornsSimplified.GC_PickedHornsSimplified_C
// 0x0030 (0x0330 - 0x0300)
class AGC_PickedHornsSimplified_C final : public AGameplayCueNotify_Actor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        EmitterToSpawn;                                    // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocationHit;                                       // 0x0310(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATICharacterBase*                       ImpaledTarget;                                     // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_PickedHornsSimplified_C">();
	}
	static class AGC_PickedHornsSimplified_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_PickedHornsSimplified_C>();
	}
};
static_assert(alignof(AGC_PickedHornsSimplified_C) == 0x000008, "Wrong alignment on AGC_PickedHornsSimplified_C");
static_assert(sizeof(AGC_PickedHornsSimplified_C) == 0x000330, "Wrong size on AGC_PickedHornsSimplified_C");
static_assert(offsetof(AGC_PickedHornsSimplified_C, DefaultSceneRoot) == 0x000300, "Member 'AGC_PickedHornsSimplified_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGC_PickedHornsSimplified_C, EmitterToSpawn) == 0x000308, "Member 'AGC_PickedHornsSimplified_C::EmitterToSpawn' has a wrong offset!");
static_assert(offsetof(AGC_PickedHornsSimplified_C, LocationHit) == 0x000310, "Member 'AGC_PickedHornsSimplified_C::LocationHit' has a wrong offset!");
static_assert(offsetof(AGC_PickedHornsSimplified_C, ImpaledTarget) == 0x000328, "Member 'AGC_PickedHornsSimplified_C::ImpaledTarget' has a wrong offset!");

}

