#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_PlayHitAnimation

#include "Basic.hpp"

#include "TheIsle_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_PlayHitAnimation.GC_PlayHitAnimation_C
// 0x0078 (0x0378 - 0x0300)
class AGC_PlayHitAnimation_C : public AGameplayCueNotify_Actor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ATICharacterBase*                       TargetBase;                                        // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FAbilitiesAnimData                     DataTableData;                                     // 0x0310(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   AnimationFromDT;                                   // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATIDinosaurBase*                        OwningDino;                                        // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_PlayHitAnimation_C">();
	}
	static class AGC_PlayHitAnimation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_PlayHitAnimation_C>();
	}
};
static_assert(alignof(AGC_PlayHitAnimation_C) == 0x000008, "Wrong alignment on AGC_PlayHitAnimation_C");
static_assert(sizeof(AGC_PlayHitAnimation_C) == 0x000378, "Wrong size on AGC_PlayHitAnimation_C");
static_assert(offsetof(AGC_PlayHitAnimation_C, DefaultSceneRoot) == 0x000300, "Member 'AGC_PlayHitAnimation_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGC_PlayHitAnimation_C, TargetBase) == 0x000308, "Member 'AGC_PlayHitAnimation_C::TargetBase' has a wrong offset!");
static_assert(offsetof(AGC_PlayHitAnimation_C, DataTableData) == 0x000310, "Member 'AGC_PlayHitAnimation_C::DataTableData' has a wrong offset!");
static_assert(offsetof(AGC_PlayHitAnimation_C, AnimationFromDT) == 0x000368, "Member 'AGC_PlayHitAnimation_C::AnimationFromDT' has a wrong offset!");
static_assert(offsetof(AGC_PlayHitAnimation_C, OwningDino) == 0x000370, "Member 'AGC_PlayHitAnimation_C::OwningDino' has a wrong offset!");

}

