#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_PickedHornsSimplified

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "TheIsle_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_PickedHornsSimplified.GC_PickedHornsSimplified_C.OnExecute
// 0x0190 (0x0190 - 0x0000)
struct GC_PickedHornsSimplified_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATICharacterBase*                       K2Node_DynamicCast_AsThe_Isle_Character_Base;      // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsAlive_ReturnValue;                   // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGrowth_ReturnValue;                    // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetCurrentMontage_ReturnValue;            // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVocals                                CallFunc_GetDataTableRowFromName_OutRow;           // 0x0100(0x0020)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATICharacterBase*                       CallFunc_GetMyDamageCauser_ReturnValue;            // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATICharacterBase*                       K2Node_DynamicCast_AsThe_Isle_Character_Base_1;    // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATITriceratops*                         K2Node_DynamicCast_AsThe_Isle_Triceratops;         // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_2;     // 0x0188(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_PickedHornsSimplified_C_OnExecute) == 0x000008, "Wrong alignment on GC_PickedHornsSimplified_C_OnExecute");
static_assert(sizeof(GC_PickedHornsSimplified_C_OnExecute) == 0x000190, "Wrong size on GC_PickedHornsSimplified_C_OnExecute");
static_assert(offsetof(GC_PickedHornsSimplified_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_PickedHornsSimplified_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsSimplified_C_OnExecute, Parameters) == 0x000008, "Member 'GC_PickedHornsSimplified_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsSimplified_C_OnExecute, ReturnValue) == 0x0000E0, "Member 'GC_PickedHornsSimplified_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsSimplified_C_OnExecute, K2Node_DynamicCast_AsThe_Isle_Character_Base) == 0x0000E8, "Member 'GC_PickedHornsSimplified_C_OnExecute::K2Node_DynamicCast_AsThe_Isle_Character_Base' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsSimplified_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GC_PickedHornsSimplified_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsSimplified_C_OnExecute, CallFunc_GetIsAlive_ReturnValue) == 0x0000F1, "Member 'GC_PickedHornsSimplified_C_OnExecute::CallFunc_GetIsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsSimplified_C_OnExecute, CallFunc_GetGrowth_ReturnValue) == 0x0000F4, "Member 'GC_PickedHornsSimplified_C_OnExecute::CallFunc_GetGrowth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsSimplified_C_OnExecute, CallFunc_GetCurrentMontage_ReturnValue) == 0x0000F8, "Member 'GC_PickedHornsSimplified_C_OnExecute::CallFunc_GetCurrentMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsSimplified_C_OnExecute, CallFunc_GetDataTableRowFromName_OutRow) == 0x000100, "Member 'GC_PickedHornsSimplified_C_OnExecute::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsSimplified_C_OnExecute, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000120, "Member 'GC_PickedHornsSimplified_C_OnExecute::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsSimplified_C_OnExecute, CallFunc_GetMyDamageCauser_ReturnValue) == 0x000128, "Member 'GC_PickedHornsSimplified_C_OnExecute::CallFunc_GetMyDamageCauser_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsSimplified_C_OnExecute, K2Node_DynamicCast_AsThe_Isle_Character_Base_1) == 0x000130, "Member 'GC_PickedHornsSimplified_C_OnExecute::K2Node_DynamicCast_AsThe_Isle_Character_Base_1' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsSimplified_C_OnExecute, K2Node_DynamicCast_bSuccess_1) == 0x000138, "Member 'GC_PickedHornsSimplified_C_OnExecute::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsSimplified_C_OnExecute, K2Node_DynamicCast_AsThe_Isle_Triceratops) == 0x000140, "Member 'GC_PickedHornsSimplified_C_OnExecute::K2Node_DynamicCast_AsThe_Isle_Triceratops' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsSimplified_C_OnExecute, K2Node_DynamicCast_bSuccess_2) == 0x000148, "Member 'GC_PickedHornsSimplified_C_OnExecute::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsSimplified_C_OnExecute, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000149, "Member 'GC_PickedHornsSimplified_C_OnExecute::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsSimplified_C_OnExecute, CallFunc_GetSocketLocation_ReturnValue) == 0x000150, "Member 'GC_PickedHornsSimplified_C_OnExecute::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsSimplified_C_OnExecute, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000168, "Member 'GC_PickedHornsSimplified_C_OnExecute::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsSimplified_C_OnExecute, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000170, "Member 'GC_PickedHornsSimplified_C_OnExecute::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsSimplified_C_OnExecute, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000178, "Member 'GC_PickedHornsSimplified_C_OnExecute::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsSimplified_C_OnExecute, CallFunc_SpawnEmitterAtLocation_ReturnValue_1) == 0x000180, "Member 'GC_PickedHornsSimplified_C_OnExecute::CallFunc_SpawnEmitterAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_PickedHornsSimplified_C_OnExecute, CallFunc_SpawnEmitterAtLocation_ReturnValue_2) == 0x000188, "Member 'GC_PickedHornsSimplified_C_OnExecute::CallFunc_SpawnEmitterAtLocation_ReturnValue_2' has a wrong offset!");

}

