#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_PounceLatchMeshCorrector

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "TheIsle_structs.hpp"


namespace SDK::Params
{

// Function GC_PounceLatchMeshCorrector.GC_PounceLatchMeshCorrector_C.ExecuteUbergraph_GC_PounceLatchMeshCorrector
// 0x03A0 (0x03A0 - 0x0000)
struct GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetLatchSocketName_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATICharacterBase*                       CallFunc_GetLastDamagedTarget_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0198(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0290(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityState                                 CallFunc_GetAbilityState_ReturnValue;              // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x038A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38B[0x1];                                      // 0x038B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector) == 0x000008, "Wrong alignment on GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector");
static_assert(sizeof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector) == 0x0003A0, "Wrong size on GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, EntryPoint) == 0x000000, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::EntryPoint' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_GetActorForwardVector_ReturnValue) == 0x000008, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000020, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x000024, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_GetLatchSocketName_ReturnValue) == 0x000028, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_GetLatchSocketName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_GetLastDamagedTarget_ReturnValue) == 0x000030, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_GetLastDamagedTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_BreakRotator_Roll) == 0x00003C, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_BreakRotator_Pitch) == 0x000040, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_BreakRotator_Yaw) == 0x000044, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_MakeRotator_ReturnValue) == 0x000048, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_GetSocketRotation_ReturnValue) == 0x000060, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_GetSocketRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000078, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_SelectFloat_ReturnValue) == 0x000080, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_SelectFloat_ReturnValue_1) == 0x000088, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000090, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000098, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_GetSocketLocation_ReturnValue) == 0x0000A0, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000B8, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_Add_VectorVector_ReturnValue) == 0x0000D0, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_BreakVector_X) == 0x0000E8, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_BreakVector_Y) == 0x0000F0, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_BreakVector_Z) == 0x0000F8, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000100, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_MakeVector_ReturnValue) == 0x000108, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_SelectVector_ReturnValue) == 0x000120, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000138, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000150, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_VInterpTo_ReturnValue) == 0x000168, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_RInterpTo_ReturnValue) == 0x000180, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000198, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000290, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_IsValid_ReturnValue_1) == 0x000388, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_GetAbilityState_ReturnValue) == 0x000389, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_GetAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00038A, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, K2Node_Event_DeltaSeconds) == 0x00038C, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000390, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000398, "Member 'GC_PounceLatchMeshCorrector_C_ExecuteUbergraph_GC_PounceLatchMeshCorrector::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function GC_PounceLatchMeshCorrector.GC_PounceLatchMeshCorrector_C.OnActive
// 0x00F8 (0x00F8 - 0x0000)
struct GC_PounceLatchMeshCorrector_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATICharacterBase*                       K2Node_DynamicCast_AsThe_Isle_Character_Base;      // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_PounceLatchMeshCorrector_C_OnActive) == 0x000008, "Wrong alignment on GC_PounceLatchMeshCorrector_C_OnActive");
static_assert(sizeof(GC_PounceLatchMeshCorrector_C_OnActive) == 0x0000F8, "Wrong size on GC_PounceLatchMeshCorrector_C_OnActive");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_OnActive, MyTarget) == 0x000000, "Member 'GC_PounceLatchMeshCorrector_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_OnActive, Parameters) == 0x000008, "Member 'GC_PounceLatchMeshCorrector_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_OnActive, ReturnValue) == 0x0000E0, "Member 'GC_PounceLatchMeshCorrector_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_OnActive, K2Node_DynamicCast_AsThe_Isle_Character_Base) == 0x0000E8, "Member 'GC_PounceLatchMeshCorrector_C_OnActive::K2Node_DynamicCast_AsThe_Isle_Character_Base' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_OnActive, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GC_PounceLatchMeshCorrector_C_OnActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GC_PounceLatchMeshCorrector.GC_PounceLatchMeshCorrector_C.OnExecute
// 0x00F8 (0x00F8 - 0x0000)
struct GC_PounceLatchMeshCorrector_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATICharacterBase*                       K2Node_DynamicCast_AsThe_Isle_Character_Base;      // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_PounceLatchMeshCorrector_C_OnExecute) == 0x000008, "Wrong alignment on GC_PounceLatchMeshCorrector_C_OnExecute");
static_assert(sizeof(GC_PounceLatchMeshCorrector_C_OnExecute) == 0x0000F8, "Wrong size on GC_PounceLatchMeshCorrector_C_OnExecute");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_PounceLatchMeshCorrector_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_OnExecute, Parameters) == 0x000008, "Member 'GC_PounceLatchMeshCorrector_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_OnExecute, ReturnValue) == 0x0000E0, "Member 'GC_PounceLatchMeshCorrector_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_OnExecute, K2Node_DynamicCast_AsThe_Isle_Character_Base) == 0x0000E8, "Member 'GC_PounceLatchMeshCorrector_C_OnExecute::K2Node_DynamicCast_AsThe_Isle_Character_Base' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GC_PounceLatchMeshCorrector_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GC_PounceLatchMeshCorrector.GC_PounceLatchMeshCorrector_C.OnRemove
// 0x00E8 (0x00E8 - 0x0000)
struct GC_PounceLatchMeshCorrector_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_PounceLatchMeshCorrector_C_OnRemove) == 0x000008, "Wrong alignment on GC_PounceLatchMeshCorrector_C_OnRemove");
static_assert(sizeof(GC_PounceLatchMeshCorrector_C_OnRemove) == 0x0000E8, "Wrong size on GC_PounceLatchMeshCorrector_C_OnRemove");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_OnRemove, MyTarget) == 0x000000, "Member 'GC_PounceLatchMeshCorrector_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_OnRemove, Parameters) == 0x000008, "Member 'GC_PounceLatchMeshCorrector_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_OnRemove, ReturnValue) == 0x0000E0, "Member 'GC_PounceLatchMeshCorrector_C_OnRemove::ReturnValue' has a wrong offset!");

// Function GC_PounceLatchMeshCorrector.GC_PounceLatchMeshCorrector_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GC_PounceLatchMeshCorrector_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds_0;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_PounceLatchMeshCorrector_C_ReceiveTick) == 0x000004, "Wrong alignment on GC_PounceLatchMeshCorrector_C_ReceiveTick");
static_assert(sizeof(GC_PounceLatchMeshCorrector_C_ReceiveTick) == 0x000004, "Wrong size on GC_PounceLatchMeshCorrector_C_ReceiveTick");
static_assert(offsetof(GC_PounceLatchMeshCorrector_C_ReceiveTick, DeltaSeconds_0) == 0x000000, "Member 'GC_PounceLatchMeshCorrector_C_ReceiveTick::DeltaSeconds_0' has a wrong offset!");

}

