#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_PlayJuvAnim

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GC_PlayJuvAnim.GC_PlayJuvAnim_C.OnExecute
// 0x00F8 (0x00F8 - 0x0000)
struct GC_PlayJuvAnim_C_OnExecute final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATICharacterBase*                       K2Node_DynamicCast_AsThe_Isle_Character_Base;      // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x2];                                       // 0x00F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayAnimMontage_ReturnValue;              // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GC_PlayJuvAnim_C_OnExecute) == 0x000008, "Wrong alignment on GC_PlayJuvAnim_C_OnExecute");
static_assert(sizeof(GC_PlayJuvAnim_C_OnExecute) == 0x0000F8, "Wrong size on GC_PlayJuvAnim_C_OnExecute");
static_assert(offsetof(GC_PlayJuvAnim_C_OnExecute, MyTarget) == 0x000000, "Member 'GC_PlayJuvAnim_C_OnExecute::MyTarget' has a wrong offset!");
static_assert(offsetof(GC_PlayJuvAnim_C_OnExecute, Parameters) == 0x000008, "Member 'GC_PlayJuvAnim_C_OnExecute::Parameters' has a wrong offset!");
static_assert(offsetof(GC_PlayJuvAnim_C_OnExecute, ReturnValue) == 0x0000E0, "Member 'GC_PlayJuvAnim_C_OnExecute::ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PlayJuvAnim_C_OnExecute, K2Node_DynamicCast_AsThe_Isle_Character_Base) == 0x0000E8, "Member 'GC_PlayJuvAnim_C_OnExecute::K2Node_DynamicCast_AsThe_Isle_Character_Base' has a wrong offset!");
static_assert(offsetof(GC_PlayJuvAnim_C_OnExecute, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GC_PlayJuvAnim_C_OnExecute::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GC_PlayJuvAnim_C_OnExecute, CallFunc_IsValid_ReturnValue) == 0x0000F1, "Member 'GC_PlayJuvAnim_C_OnExecute::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GC_PlayJuvAnim_C_OnExecute, CallFunc_PlayAnimMontage_ReturnValue) == 0x0000F4, "Member 'GC_PlayJuvAnim_C_OnExecute::CallFunc_PlayAnimMontage_ReturnValue' has a wrong offset!");

}

