#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_PounceLatchMeshCorrector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "TheIsle_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_PounceLatchMeshCorrector.GC_PounceLatchMeshCorrector_C
// 0x00B8 (0x03B8 - 0x0300)
class AGC_PounceLatchMeshCorrector_C final : public AGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ATICharacterBase*                       CueOwner;                                          // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          bStarted;                                          // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 PouncedActor;                                      // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketToUse;                                       // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<double, class FName>                     PouncePoints;                                      // 0x0330(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                SocketLocation;                                    // 0x0380(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               SocketRotation;                                    // 0x0398(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         DeltaSeconds;                                      // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocationInterpolation;                             // 0x03B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GC_PounceLatchMeshCorrector(int32 EntryPoint);
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void ReceiveTick(float DeltaSeconds_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_PounceLatchMeshCorrector_C">();
	}
	static class AGC_PounceLatchMeshCorrector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_PounceLatchMeshCorrector_C>();
	}
};
static_assert(alignof(AGC_PounceLatchMeshCorrector_C) == 0x000008, "Wrong alignment on AGC_PounceLatchMeshCorrector_C");
static_assert(sizeof(AGC_PounceLatchMeshCorrector_C) == 0x0003B8, "Wrong size on AGC_PounceLatchMeshCorrector_C");
static_assert(offsetof(AGC_PounceLatchMeshCorrector_C, UberGraphFrame) == 0x000300, "Member 'AGC_PounceLatchMeshCorrector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_PounceLatchMeshCorrector_C, DefaultSceneRoot) == 0x000308, "Member 'AGC_PounceLatchMeshCorrector_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGC_PounceLatchMeshCorrector_C, CueOwner) == 0x000310, "Member 'AGC_PounceLatchMeshCorrector_C::CueOwner' has a wrong offset!");
static_assert(offsetof(AGC_PounceLatchMeshCorrector_C, bStarted) == 0x000318, "Member 'AGC_PounceLatchMeshCorrector_C::bStarted' has a wrong offset!");
static_assert(offsetof(AGC_PounceLatchMeshCorrector_C, PouncedActor) == 0x000320, "Member 'AGC_PounceLatchMeshCorrector_C::PouncedActor' has a wrong offset!");
static_assert(offsetof(AGC_PounceLatchMeshCorrector_C, SocketToUse) == 0x000328, "Member 'AGC_PounceLatchMeshCorrector_C::SocketToUse' has a wrong offset!");
static_assert(offsetof(AGC_PounceLatchMeshCorrector_C, PouncePoints) == 0x000330, "Member 'AGC_PounceLatchMeshCorrector_C::PouncePoints' has a wrong offset!");
static_assert(offsetof(AGC_PounceLatchMeshCorrector_C, SocketLocation) == 0x000380, "Member 'AGC_PounceLatchMeshCorrector_C::SocketLocation' has a wrong offset!");
static_assert(offsetof(AGC_PounceLatchMeshCorrector_C, SocketRotation) == 0x000398, "Member 'AGC_PounceLatchMeshCorrector_C::SocketRotation' has a wrong offset!");
static_assert(offsetof(AGC_PounceLatchMeshCorrector_C, DeltaSeconds) == 0x0003B0, "Member 'AGC_PounceLatchMeshCorrector_C::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(AGC_PounceLatchMeshCorrector_C, LocationInterpolation) == 0x0003B4, "Member 'AGC_PounceLatchMeshCorrector_C::LocationInterpolation' has a wrong offset!");

}

