#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GC_PickedHornsImpale

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GC_PickedHornsImpale.GC_PickedHornsImpale_C
// 0x0040 (0x0340 - 0x0300)
class AGC_PickedHornsImpale_C final : public AGameplayCueNotify_Actor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         EmitterToSpawn;                                    // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocationHit;                                       // 0x0318(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATICharacterBase*                       ImpaledTarget;                                     // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Growth;                                            // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecutePickedUp(class FName bone, class ATICharacterBase* Target);
	void ExecuteUbergraph_GC_PickedHornsImpale(int32 EntryPoint);
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GC_PickedHornsImpale_C">();
	}
	static class AGC_PickedHornsImpale_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGC_PickedHornsImpale_C>();
	}
};
static_assert(alignof(AGC_PickedHornsImpale_C) == 0x000008, "Wrong alignment on AGC_PickedHornsImpale_C");
static_assert(sizeof(AGC_PickedHornsImpale_C) == 0x000340, "Wrong size on AGC_PickedHornsImpale_C");
static_assert(offsetof(AGC_PickedHornsImpale_C, UberGraphFrame) == 0x000300, "Member 'AGC_PickedHornsImpale_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGC_PickedHornsImpale_C, DefaultSceneRoot) == 0x000308, "Member 'AGC_PickedHornsImpale_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGC_PickedHornsImpale_C, EmitterToSpawn) == 0x000310, "Member 'AGC_PickedHornsImpale_C::EmitterToSpawn' has a wrong offset!");
static_assert(offsetof(AGC_PickedHornsImpale_C, LocationHit) == 0x000318, "Member 'AGC_PickedHornsImpale_C::LocationHit' has a wrong offset!");
static_assert(offsetof(AGC_PickedHornsImpale_C, ImpaledTarget) == 0x000330, "Member 'AGC_PickedHornsImpale_C::ImpaledTarget' has a wrong offset!");
static_assert(offsetof(AGC_PickedHornsImpale_C, Growth) == 0x000338, "Member 'AGC_PickedHornsImpale_C::Growth' has a wrong offset!");

}

