#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassActors

#include "Basic.hpp"

#include "MassCommon_structs.hpp"
#include "StructUtils_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MassActors_structs.hpp"
#include "MassEntity_classes.hpp"
#include "MassSpawner_structs.hpp"
#include "MassSpawner_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class MassActors.MassActorPoolableInterface
// 0x0000 (0x0000 - 0x0000)
class IMassActorPoolableInterface final
{
public:
	bool CanBePooled();
	void PrepareForGame();
	void PrepareForPooling();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassActorPoolableInterface">();
	}
	static class IMassActorPoolableInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMassActorPoolableInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IMassActorPoolableInterface) == 0x000001, "Wrong alignment on IMassActorPoolableInterface");
static_assert(sizeof(IMassActorPoolableInterface) == 0x000001, "Wrong size on IMassActorPoolableInterface");

// Class MassActors.MassActorSpawnerSubsystem
// 0x00B8 (0x00F0 - 0x0038)
class UMassActorSpawnerSubsystem final : public UMassSubsystemBase
{
public:
	TArray<struct FInstancedStruct>               SpawnRequests;                                     // 0x0038(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class AActor*>                         ActorsToDestroy;                                   // 0x0048(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class AActor*>                         DeactivatedActorsToDestroy;                        // 0x0058(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x88];                                      // 0x0068(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassActorSpawnerSubsystem">();
	}
	static class UMassActorSpawnerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassActorSpawnerSubsystem>();
	}
};
static_assert(alignof(UMassActorSpawnerSubsystem) == 0x000008, "Wrong alignment on UMassActorSpawnerSubsystem");
static_assert(sizeof(UMassActorSpawnerSubsystem) == 0x0000F0, "Wrong size on UMassActorSpawnerSubsystem");
static_assert(offsetof(UMassActorSpawnerSubsystem, SpawnRequests) == 0x000038, "Member 'UMassActorSpawnerSubsystem::SpawnRequests' has a wrong offset!");
static_assert(offsetof(UMassActorSpawnerSubsystem, ActorsToDestroy) == 0x000048, "Member 'UMassActorSpawnerSubsystem::ActorsToDestroy' has a wrong offset!");
static_assert(offsetof(UMassActorSpawnerSubsystem, DeactivatedActorsToDestroy) == 0x000058, "Member 'UMassActorSpawnerSubsystem::DeactivatedActorsToDestroy' has a wrong offset!");

// Class MassActors.MassActorSubsystem
// 0x0010 (0x0048 - 0x0038)
class UMassActorSubsystem final : public UMassSubsystemBase
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassActorSubsystem">();
	}
	static class UMassActorSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassActorSubsystem>();
	}
};
static_assert(alignof(UMassActorSubsystem) == 0x000008, "Wrong alignment on UMassActorSubsystem");
static_assert(sizeof(UMassActorSubsystem) == 0x000048, "Wrong size on UMassActorSubsystem");

// Class MassActors.MassAgentComponent
// 0x00E0 (0x0180 - 0x00A0)
class UMassAgentComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x80];                                      // 0x00A0(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassEntityConfig                      EntityConfig;                                      // 0x0120(0x0030)(Edit, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_150[0x2C];                                     // 0x0150(0x002C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassNetworkID                         NetID;                                             // 0x017C(0x0004)(Net, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void Disable();
	void Enable();
	void KillEntity(const bool bDestroyActor);
	void OnRep_NetID();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassAgentComponent">();
	}
	static class UMassAgentComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassAgentComponent>();
	}
};
static_assert(alignof(UMassAgentComponent) == 0x000008, "Wrong alignment on UMassAgentComponent");
static_assert(sizeof(UMassAgentComponent) == 0x000180, "Wrong size on UMassAgentComponent");
static_assert(offsetof(UMassAgentComponent, EntityConfig) == 0x000120, "Member 'UMassAgentComponent::EntityConfig' has a wrong offset!");
static_assert(offsetof(UMassAgentComponent, NetID) == 0x00017C, "Member 'UMassAgentComponent::NetID' has a wrong offset!");

// Class MassActors.MassAgentSubsystem
// 0x0148 (0x0180 - 0x0038)
class UMassAgentSubsystem final : public UMassSubsystemBase
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UMassSpawnerSubsystem*                  SpawnerSystem;                                     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMassSimulationSubsystem*               SimulationSystem;                                  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct FMassEntityTemplateID, struct FMassAgentInitializationQueue> PendingAgentEntities;   // 0x0058(0x0050)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TMap<struct FMassEntityTemplateID, struct FMassAgentInitializationQueue> PendingPuppets;         // 0x00A8(0x0050)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UMassReplicationSubsystem*              ReplicationSubsystem;                              // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct FMassNetworkID, class UMassAgentComponent*> ReplicatedAgentComponents;               // 0x0100(0x0050)(ExportObject, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_150[0x30];                                     // 0x0150(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassAgentSubsystem">();
	}
	static class UMassAgentSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassAgentSubsystem>();
	}
};
static_assert(alignof(UMassAgentSubsystem) == 0x000008, "Wrong alignment on UMassAgentSubsystem");
static_assert(sizeof(UMassAgentSubsystem) == 0x000180, "Wrong size on UMassAgentSubsystem");
static_assert(offsetof(UMassAgentSubsystem, SpawnerSystem) == 0x000048, "Member 'UMassAgentSubsystem::SpawnerSystem' has a wrong offset!");
static_assert(offsetof(UMassAgentSubsystem, SimulationSystem) == 0x000050, "Member 'UMassAgentSubsystem::SimulationSystem' has a wrong offset!");
static_assert(offsetof(UMassAgentSubsystem, PendingAgentEntities) == 0x000058, "Member 'UMassAgentSubsystem::PendingAgentEntities' has a wrong offset!");
static_assert(offsetof(UMassAgentSubsystem, PendingPuppets) == 0x0000A8, "Member 'UMassAgentSubsystem::PendingPuppets' has a wrong offset!");
static_assert(offsetof(UMassAgentSubsystem, ReplicationSubsystem) == 0x0000F8, "Member 'UMassAgentSubsystem::ReplicationSubsystem' has a wrong offset!");
static_assert(offsetof(UMassAgentSubsystem, ReplicatedAgentComponents) == 0x000100, "Member 'UMassAgentSubsystem::ReplicatedAgentComponents' has a wrong offset!");

// Class MassActors.MassAgentSyncTrait
// 0x0008 (0x0030 - 0x0028)
class UMassAgentSyncTrait : public UMassEntityTraitBase
{
public:
	EMassTranslationDirection                     SyncDirection;                                     // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassAgentSyncTrait">();
	}
	static class UMassAgentSyncTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassAgentSyncTrait>();
	}
};
static_assert(alignof(UMassAgentSyncTrait) == 0x000008, "Wrong alignment on UMassAgentSyncTrait");
static_assert(sizeof(UMassAgentSyncTrait) == 0x000030, "Wrong size on UMassAgentSyncTrait");
static_assert(offsetof(UMassAgentSyncTrait, SyncDirection) == 0x000028, "Member 'UMassAgentSyncTrait::SyncDirection' has a wrong offset!");

// Class MassActors.MassAgentCapsuleCollisionSyncTrait
// 0x0008 (0x0038 - 0x0030)
class UMassAgentCapsuleCollisionSyncTrait final : public UMassAgentSyncTrait
{
public:
	bool                                          bSyncTransform;                                    // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassAgentCapsuleCollisionSyncTrait">();
	}
	static class UMassAgentCapsuleCollisionSyncTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassAgentCapsuleCollisionSyncTrait>();
	}
};
static_assert(alignof(UMassAgentCapsuleCollisionSyncTrait) == 0x000008, "Wrong alignment on UMassAgentCapsuleCollisionSyncTrait");
static_assert(sizeof(UMassAgentCapsuleCollisionSyncTrait) == 0x000038, "Wrong size on UMassAgentCapsuleCollisionSyncTrait");
static_assert(offsetof(UMassAgentCapsuleCollisionSyncTrait, bSyncTransform) == 0x000030, "Member 'UMassAgentCapsuleCollisionSyncTrait::bSyncTransform' has a wrong offset!");

// Class MassActors.MassAgentMovementSyncTrait
// 0x0000 (0x0030 - 0x0030)
class UMassAgentMovementSyncTrait final : public UMassAgentSyncTrait
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassAgentMovementSyncTrait">();
	}
	static class UMassAgentMovementSyncTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassAgentMovementSyncTrait>();
	}
};
static_assert(alignof(UMassAgentMovementSyncTrait) == 0x000008, "Wrong alignment on UMassAgentMovementSyncTrait");
static_assert(sizeof(UMassAgentMovementSyncTrait) == 0x000030, "Wrong size on UMassAgentMovementSyncTrait");

// Class MassActors.MassAgentOrientationSyncTrait
// 0x0000 (0x0030 - 0x0030)
class UMassAgentOrientationSyncTrait final : public UMassAgentSyncTrait
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassAgentOrientationSyncTrait">();
	}
	static class UMassAgentOrientationSyncTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassAgentOrientationSyncTrait>();
	}
};
static_assert(alignof(UMassAgentOrientationSyncTrait) == 0x000008, "Wrong alignment on UMassAgentOrientationSyncTrait");
static_assert(sizeof(UMassAgentOrientationSyncTrait) == 0x000030, "Wrong size on UMassAgentOrientationSyncTrait");

// Class MassActors.MassAgentFeetLocationSyncTrait
// 0x0000 (0x0030 - 0x0030)
class UMassAgentFeetLocationSyncTrait final : public UMassAgentSyncTrait
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassAgentFeetLocationSyncTrait">();
	}
	static class UMassAgentFeetLocationSyncTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassAgentFeetLocationSyncTrait>();
	}
};
static_assert(alignof(UMassAgentFeetLocationSyncTrait) == 0x000008, "Wrong alignment on UMassAgentFeetLocationSyncTrait");
static_assert(sizeof(UMassAgentFeetLocationSyncTrait) == 0x000030, "Wrong size on UMassAgentFeetLocationSyncTrait");

// Class MassActors.MassCapsuleTransformToMassTranslator
// 0x02A0 (0x0380 - 0x00E0)
class UMassCapsuleTransformToMassTranslator final : public UMassTranslator
{
public:
	uint8                                         Pad_E0[0x2A0];                                     // 0x00E0(0x02A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCapsuleTransformToMassTranslator">();
	}
	static class UMassCapsuleTransformToMassTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCapsuleTransformToMassTranslator>();
	}
};
static_assert(alignof(UMassCapsuleTransformToMassTranslator) == 0x000008, "Wrong alignment on UMassCapsuleTransformToMassTranslator");
static_assert(sizeof(UMassCapsuleTransformToMassTranslator) == 0x000380, "Wrong size on UMassCapsuleTransformToMassTranslator");

// Class MassActors.MassTransformToActorCapsuleTranslator
// 0x02A0 (0x0380 - 0x00E0)
class UMassTransformToActorCapsuleTranslator final : public UMassTranslator
{
public:
	uint8                                         Pad_E0[0x2A0];                                     // 0x00E0(0x02A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTransformToActorCapsuleTranslator">();
	}
	static class UMassTransformToActorCapsuleTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTransformToActorCapsuleTranslator>();
	}
};
static_assert(alignof(UMassTransformToActorCapsuleTranslator) == 0x000008, "Wrong alignment on UMassTransformToActorCapsuleTranslator");
static_assert(sizeof(UMassTransformToActorCapsuleTranslator) == 0x000380, "Wrong size on UMassTransformToActorCapsuleTranslator");

// Class MassActors.MassCharacterMovementToMassTranslator
// 0x02A0 (0x0380 - 0x00E0)
class UMassCharacterMovementToMassTranslator final : public UMassTranslator
{
public:
	uint8                                         Pad_E0[0x2A0];                                     // 0x00E0(0x02A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCharacterMovementToMassTranslator">();
	}
	static class UMassCharacterMovementToMassTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCharacterMovementToMassTranslator>();
	}
};
static_assert(alignof(UMassCharacterMovementToMassTranslator) == 0x000008, "Wrong alignment on UMassCharacterMovementToMassTranslator");
static_assert(sizeof(UMassCharacterMovementToMassTranslator) == 0x000380, "Wrong size on UMassCharacterMovementToMassTranslator");

// Class MassActors.MassCharacterMovementToActorTranslator
// 0x02A0 (0x0380 - 0x00E0)
class UMassCharacterMovementToActorTranslator final : public UMassTranslator
{
public:
	uint8                                         Pad_E0[0x2A0];                                     // 0x00E0(0x02A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCharacterMovementToActorTranslator">();
	}
	static class UMassCharacterMovementToActorTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCharacterMovementToActorTranslator>();
	}
};
static_assert(alignof(UMassCharacterMovementToActorTranslator) == 0x000008, "Wrong alignment on UMassCharacterMovementToActorTranslator");
static_assert(sizeof(UMassCharacterMovementToActorTranslator) == 0x000380, "Wrong size on UMassCharacterMovementToActorTranslator");

// Class MassActors.MassCharacterOrientationToMassTranslator
// 0x02A0 (0x0380 - 0x00E0)
class UMassCharacterOrientationToMassTranslator final : public UMassTranslator
{
public:
	uint8                                         Pad_E0[0x2A0];                                     // 0x00E0(0x02A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCharacterOrientationToMassTranslator">();
	}
	static class UMassCharacterOrientationToMassTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCharacterOrientationToMassTranslator>();
	}
};
static_assert(alignof(UMassCharacterOrientationToMassTranslator) == 0x000008, "Wrong alignment on UMassCharacterOrientationToMassTranslator");
static_assert(sizeof(UMassCharacterOrientationToMassTranslator) == 0x000380, "Wrong size on UMassCharacterOrientationToMassTranslator");

// Class MassActors.MassCharacterOrientationToActorTranslator
// 0x02A0 (0x0380 - 0x00E0)
class UMassCharacterOrientationToActorTranslator final : public UMassTranslator
{
public:
	uint8                                         Pad_E0[0x2A0];                                     // 0x00E0(0x02A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassCharacterOrientationToActorTranslator">();
	}
	static class UMassCharacterOrientationToActorTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassCharacterOrientationToActorTranslator>();
	}
};
static_assert(alignof(UMassCharacterOrientationToActorTranslator) == 0x000008, "Wrong alignment on UMassCharacterOrientationToActorTranslator");
static_assert(sizeof(UMassCharacterOrientationToActorTranslator) == 0x000380, "Wrong size on UMassCharacterOrientationToActorTranslator");

// Class MassActors.MassSceneComponentLocationToMassTranslator
// 0x02A0 (0x0380 - 0x00E0)
class UMassSceneComponentLocationToMassTranslator final : public UMassTranslator
{
public:
	uint8                                         Pad_E0[0x2A0];                                     // 0x00E0(0x02A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSceneComponentLocationToMassTranslator">();
	}
	static class UMassSceneComponentLocationToMassTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSceneComponentLocationToMassTranslator>();
	}
};
static_assert(alignof(UMassSceneComponentLocationToMassTranslator) == 0x000008, "Wrong alignment on UMassSceneComponentLocationToMassTranslator");
static_assert(sizeof(UMassSceneComponentLocationToMassTranslator) == 0x000380, "Wrong size on UMassSceneComponentLocationToMassTranslator");

// Class MassActors.MassSceneComponentLocationToActorTranslator
// 0x02A0 (0x0380 - 0x00E0)
class UMassSceneComponentLocationToActorTranslator final : public UMassTranslator
{
public:
	uint8                                         Pad_E0[0x2A0];                                     // 0x00E0(0x02A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSceneComponentLocationToActorTranslator">();
	}
	static class UMassSceneComponentLocationToActorTranslator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSceneComponentLocationToActorTranslator>();
	}
};
static_assert(alignof(UMassSceneComponentLocationToActorTranslator) == 0x000008, "Wrong alignment on UMassSceneComponentLocationToActorTranslator");
static_assert(sizeof(UMassSceneComponentLocationToActorTranslator) == 0x000380, "Wrong size on UMassSceneComponentLocationToActorTranslator");

// Class MassActors.MassTranslator_BehaviorTree
// 0x02A0 (0x0380 - 0x00E0)
class UMassTranslator_BehaviorTree final : public UMassTranslator
{
public:
	uint8                                         Pad_E0[0x2A0];                                     // 0x00E0(0x02A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassTranslator_BehaviorTree">();
	}
	static class UMassTranslator_BehaviorTree* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassTranslator_BehaviorTree>();
	}
};
static_assert(alignof(UMassTranslator_BehaviorTree) == 0x000008, "Wrong alignment on UMassTranslator_BehaviorTree");
static_assert(sizeof(UMassTranslator_BehaviorTree) == 0x000380, "Wrong size on UMassTranslator_BehaviorTree");

}

