#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassReplication

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "MassEntity_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "MassReplication_structs.hpp"
#include "MassSpawner_classes.hpp"


namespace SDK
{

// Class MassReplication.MassClientBubbleInfoBase
// 0x0018 (0x02A8 - 0x0290)
class AMassClientBubbleInfoBase final : public AInfo
{
public:
	uint8                                         Pad_290[0x18];                                     // 0x0290(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassClientBubbleInfoBase">();
	}
	static class AMassClientBubbleInfoBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMassClientBubbleInfoBase>();
	}
};
static_assert(alignof(AMassClientBubbleInfoBase) == 0x000008, "Wrong alignment on AMassClientBubbleInfoBase");
static_assert(sizeof(AMassClientBubbleInfoBase) == 0x0002A8, "Wrong size on AMassClientBubbleInfoBase");

// Class MassReplication.MassNetworkIDFragmentInitializer
// 0x02A8 (0x0380 - 0x00D8)
class UMassNetworkIDFragmentInitializer final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_D8[0x2A8];                                     // 0x00D8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassNetworkIDFragmentInitializer">();
	}
	static class UMassNetworkIDFragmentInitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassNetworkIDFragmentInitializer>();
	}
};
static_assert(alignof(UMassNetworkIDFragmentInitializer) == 0x000008, "Wrong alignment on UMassNetworkIDFragmentInitializer");
static_assert(sizeof(UMassNetworkIDFragmentInitializer) == 0x000380, "Wrong size on UMassNetworkIDFragmentInitializer");

// Class MassReplication.MassReplicationGridProcessor
// 0x07E0 (0x08A0 - 0x00C0)
class UMassReplicationGridProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_C0[0x7E0];                                     // 0x00C0(0x07E0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassReplicationGridProcessor">();
	}
	static class UMassReplicationGridProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassReplicationGridProcessor>();
	}
};
static_assert(alignof(UMassReplicationGridProcessor) == 0x000008, "Wrong alignment on UMassReplicationGridProcessor");
static_assert(sizeof(UMassReplicationGridProcessor) == 0x0008A0, "Wrong size on UMassReplicationGridProcessor");

// Class MassReplication.MassReplicationGridRemoverProcessor
// 0x02A8 (0x0380 - 0x00D8)
class UMassReplicationGridRemoverProcessor final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_D8[0x2A8];                                     // 0x00D8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassReplicationGridRemoverProcessor">();
	}
	static class UMassReplicationGridRemoverProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassReplicationGridRemoverProcessor>();
	}
};
static_assert(alignof(UMassReplicationGridRemoverProcessor) == 0x000008, "Wrong alignment on UMassReplicationGridRemoverProcessor");
static_assert(sizeof(UMassReplicationGridRemoverProcessor) == 0x000380, "Wrong size on UMassReplicationGridRemoverProcessor");

// Class MassReplication.MassReplicationProcessor
// 0x0D30 (0x0DF0 - 0x00C0)
class alignas(0x10) UMassReplicationProcessor final : public UMassProcessor
{
public:
	class UMassReplicationSubsystem*              ReplicationSubsystem;                              // 0x00C0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C8[0xD28];                                     // 0x00C8(0x0D28)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassReplicationProcessor">();
	}
	static class UMassReplicationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassReplicationProcessor>();
	}
};
static_assert(alignof(UMassReplicationProcessor) == 0x000010, "Wrong alignment on UMassReplicationProcessor");
static_assert(sizeof(UMassReplicationProcessor) == 0x000DF0, "Wrong size on UMassReplicationProcessor");
static_assert(offsetof(UMassReplicationProcessor, ReplicationSubsystem) == 0x0000C0, "Member 'UMassReplicationProcessor::ReplicationSubsystem' has a wrong offset!");

// Class MassReplication.MassReplicatorBase
// 0x0000 (0x0028 - 0x0028)
class UMassReplicatorBase final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassReplicatorBase">();
	}
	static class UMassReplicatorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassReplicatorBase>();
	}
};
static_assert(alignof(UMassReplicatorBase) == 0x000008, "Wrong alignment on UMassReplicatorBase");
static_assert(sizeof(UMassReplicatorBase) == 0x000028, "Wrong size on UMassReplicatorBase");

// Class MassReplication.MassReplicationSettings
// 0x0008 (0x0030 - 0x0028)
class UMassReplicationSettings final : public UMassModuleSettings
{
public:
	float                                         ReplicationGridCellSize;                           // 0x0028(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassReplicationSettings">();
	}
	static class UMassReplicationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassReplicationSettings>();
	}
};
static_assert(alignof(UMassReplicationSettings) == 0x000008, "Wrong alignment on UMassReplicationSettings");
static_assert(sizeof(UMassReplicationSettings) == 0x000030, "Wrong size on UMassReplicationSettings");
static_assert(offsetof(UMassReplicationSettings, ReplicationGridCellSize) == 0x000028, "Member 'UMassReplicationSettings::ReplicationGridCellSize' has a wrong offset!");

// Class MassReplication.MassReplicationSubsystem
// 0x01B0 (0x01E8 - 0x0038)
class UMassReplicationSubsystem final : public UMassSubsystemBase
{
public:
	uint8                                         Pad_38[0x30];                                      // 0x0038(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMassClientBubbleInfoData>      BubbleInfoArray;                                   // 0x0068(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_78[0x30];                                      // 0x0078(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 World;                                             // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMassLODSubsystem*                      MassLODSubsystem;                                  // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B8[0x130];                                     // 0x00B8(0x0130)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassReplicationSubsystem">();
	}
	static class UMassReplicationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassReplicationSubsystem>();
	}
};
static_assert(alignof(UMassReplicationSubsystem) == 0x000008, "Wrong alignment on UMassReplicationSubsystem");
static_assert(sizeof(UMassReplicationSubsystem) == 0x0001E8, "Wrong size on UMassReplicationSubsystem");
static_assert(offsetof(UMassReplicationSubsystem, BubbleInfoArray) == 0x000068, "Member 'UMassReplicationSubsystem::BubbleInfoArray' has a wrong offset!");
static_assert(offsetof(UMassReplicationSubsystem, World) == 0x0000A8, "Member 'UMassReplicationSubsystem::World' has a wrong offset!");
static_assert(offsetof(UMassReplicationSubsystem, MassLODSubsystem) == 0x0000B0, "Member 'UMassReplicationSubsystem::MassLODSubsystem' has a wrong offset!");

// Class MassReplication.MassReplicationTrait
// 0x0058 (0x0080 - 0x0028)
class UMassReplicationTrait final : public UMassEntityTraitBase
{
public:
	struct FMassReplicationParameters             Params_0;                                          // 0x0028(0x0058)(Edit, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassReplicationTrait">();
	}
	static class UMassReplicationTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassReplicationTrait>();
	}
};
static_assert(alignof(UMassReplicationTrait) == 0x000008, "Wrong alignment on UMassReplicationTrait");
static_assert(sizeof(UMassReplicationTrait) == 0x000080, "Wrong size on UMassReplicationTrait");
static_assert(offsetof(UMassReplicationTrait, Params_0) == 0x000028, "Member 'UMassReplicationTrait::Params_0' has a wrong offset!");

}

