#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassSignals

#include "Basic.hpp"

#include "MassEntity_classes.hpp"


namespace SDK
{

// Class MassSignals.MassSignalProcessorBase
// 0x0360 (0x0420 - 0x00C0)
class UMassSignalProcessorBase : public UMassProcessor
{
public:
	uint8                                         Pad_C0[0x360];                                     // 0x00C0(0x0360)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSignalProcessorBase">();
	}
	static class UMassSignalProcessorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSignalProcessorBase>();
	}
};
static_assert(alignof(UMassSignalProcessorBase) == 0x000008, "Wrong alignment on UMassSignalProcessorBase");
static_assert(sizeof(UMassSignalProcessorBase) == 0x000420, "Wrong size on UMassSignalProcessorBase");

// Class MassSignals.MassSignalSubsystem
// 0x0068 (0x00B0 - 0x0048)
class UMassSignalSubsystem final : public UMassTickableSubsystemBase
{
public:
	uint8                                         Pad_48[0x60];                                      // 0x0048(0x0060)(Fixing Size After Last Property [ Dumper-7 ])
	class UWorld*                                 CachedWorld;                                       // 0x00A8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSignalSubsystem">();
	}
	static class UMassSignalSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSignalSubsystem>();
	}
};
static_assert(alignof(UMassSignalSubsystem) == 0x000008, "Wrong alignment on UMassSignalSubsystem");
static_assert(sizeof(UMassSignalSubsystem) == 0x0000B0, "Wrong size on UMassSignalSubsystem");
static_assert(offsetof(UMassSignalSubsystem, CachedWorld) == 0x0000A8, "Member 'UMassSignalSubsystem::CachedWorld' has a wrong offset!");

}

