#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassSmartObjects

#include "Basic.hpp"

#include "SmartObjectsModule_classes.hpp"
#include "MassEntity_classes.hpp"
#include "MassSignals_classes.hpp"
#include "ZoneGraph_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "ZoneGraphAnnotations_classes.hpp"
#include "MassSpawner_classes.hpp"
#include "MassSmartObjects_structs.hpp"


namespace SDK
{

// Class MassSmartObjects.SmartObjectMassBehaviorDefinition
// 0x0008 (0x0030 - 0x0028)
class USmartObjectMassBehaviorDefinition final : public USmartObjectBehaviorDefinition
{
public:
	float                                         UseTime;                                           // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectMassBehaviorDefinition">();
	}
	static class USmartObjectMassBehaviorDefinition* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectMassBehaviorDefinition>();
	}
};
static_assert(alignof(USmartObjectMassBehaviorDefinition) == 0x000008, "Wrong alignment on USmartObjectMassBehaviorDefinition");
static_assert(sizeof(USmartObjectMassBehaviorDefinition) == 0x000030, "Wrong size on USmartObjectMassBehaviorDefinition");
static_assert(offsetof(USmartObjectMassBehaviorDefinition, UseTime) == 0x000028, "Member 'USmartObjectMassBehaviorDefinition::UseTime' has a wrong offset!");

// Class MassSmartObjects.MassSmartObjectCandidatesFinderProcessor
// 0x0550 (0x0610 - 0x00C0)
class UMassSmartObjectCandidatesFinderProcessor final : public UMassProcessor
{
public:
	float                                         SearchExtents;                                     // 0x00C0(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C4[0x54C];                                     // 0x00C4(0x054C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSmartObjectCandidatesFinderProcessor">();
	}
	static class UMassSmartObjectCandidatesFinderProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSmartObjectCandidatesFinderProcessor>();
	}
};
static_assert(alignof(UMassSmartObjectCandidatesFinderProcessor) == 0x000008, "Wrong alignment on UMassSmartObjectCandidatesFinderProcessor");
static_assert(sizeof(UMassSmartObjectCandidatesFinderProcessor) == 0x000610, "Wrong size on UMassSmartObjectCandidatesFinderProcessor");
static_assert(offsetof(UMassSmartObjectCandidatesFinderProcessor, SearchExtents) == 0x0000C0, "Member 'UMassSmartObjectCandidatesFinderProcessor::SearchExtents' has a wrong offset!");

// Class MassSmartObjects.MassSmartObjectTimedBehaviorProcessor
// 0x02A0 (0x0360 - 0x00C0)
class UMassSmartObjectTimedBehaviorProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_C0[0x2A0];                                     // 0x00C0(0x02A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSmartObjectTimedBehaviorProcessor">();
	}
	static class UMassSmartObjectTimedBehaviorProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSmartObjectTimedBehaviorProcessor>();
	}
};
static_assert(alignof(UMassSmartObjectTimedBehaviorProcessor) == 0x000008, "Wrong alignment on UMassSmartObjectTimedBehaviorProcessor");
static_assert(sizeof(UMassSmartObjectTimedBehaviorProcessor) == 0x000360, "Wrong size on UMassSmartObjectTimedBehaviorProcessor");

// Class MassSmartObjects.MassSmartObjectUserFragmentDeinitializer
// 0x02A8 (0x0380 - 0x00D8)
class UMassSmartObjectUserFragmentDeinitializer final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_D8[0x2A8];                                     // 0x00D8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSmartObjectUserFragmentDeinitializer">();
	}
	static class UMassSmartObjectUserFragmentDeinitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSmartObjectUserFragmentDeinitializer>();
	}
};
static_assert(alignof(UMassSmartObjectUserFragmentDeinitializer) == 0x000008, "Wrong alignment on UMassSmartObjectUserFragmentDeinitializer");
static_assert(sizeof(UMassSmartObjectUserFragmentDeinitializer) == 0x000380, "Wrong size on UMassSmartObjectUserFragmentDeinitializer");

// Class MassSmartObjects.MassSmartObjectInitializerBase
// 0x02B8 (0x0390 - 0x00D8)
class UMassSmartObjectInitializerBase : public UMassObserverProcessor
{
public:
	uint8                                         Pad_D8[0x2B8];                                     // 0x00D8(0x02B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSmartObjectInitializerBase">();
	}
	static class UMassSmartObjectInitializerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSmartObjectInitializerBase>();
	}
};
static_assert(alignof(UMassSmartObjectInitializerBase) == 0x000008, "Wrong alignment on UMassSmartObjectInitializerBase");
static_assert(sizeof(UMassSmartObjectInitializerBase) == 0x000390, "Wrong size on UMassSmartObjectInitializerBase");

// Class MassSmartObjects.MassSmartObjectDeinitializerBase
// 0x02B8 (0x0390 - 0x00D8)
class UMassSmartObjectDeinitializerBase : public UMassObserverProcessor
{
public:
	uint8                                         Pad_D8[0x2B8];                                     // 0x00D8(0x02B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSmartObjectDeinitializerBase">();
	}
	static class UMassSmartObjectDeinitializerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSmartObjectDeinitializerBase>();
	}
};
static_assert(alignof(UMassSmartObjectDeinitializerBase) == 0x000008, "Wrong alignment on UMassSmartObjectDeinitializerBase");
static_assert(sizeof(UMassSmartObjectDeinitializerBase) == 0x000390, "Wrong size on UMassSmartObjectDeinitializerBase");

// Class MassSmartObjects.MassActiveSmartObjectInitializer
// 0x0000 (0x0390 - 0x0390)
class UMassActiveSmartObjectInitializer final : public UMassSmartObjectInitializerBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassActiveSmartObjectInitializer">();
	}
	static class UMassActiveSmartObjectInitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassActiveSmartObjectInitializer>();
	}
};
static_assert(alignof(UMassActiveSmartObjectInitializer) == 0x000008, "Wrong alignment on UMassActiveSmartObjectInitializer");
static_assert(sizeof(UMassActiveSmartObjectInitializer) == 0x000390, "Wrong size on UMassActiveSmartObjectInitializer");

// Class MassSmartObjects.MassActiveSmartObjectDeinitializer
// 0x0000 (0x0390 - 0x0390)
class UMassActiveSmartObjectDeinitializer final : public UMassSmartObjectDeinitializerBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassActiveSmartObjectDeinitializer">();
	}
	static class UMassActiveSmartObjectDeinitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassActiveSmartObjectDeinitializer>();
	}
};
static_assert(alignof(UMassActiveSmartObjectDeinitializer) == 0x000008, "Wrong alignment on UMassActiveSmartObjectDeinitializer");
static_assert(sizeof(UMassActiveSmartObjectDeinitializer) == 0x000390, "Wrong size on UMassActiveSmartObjectDeinitializer");

// Class MassSmartObjects.MassActorInstanceHandleInitializer
// 0x0000 (0x0390 - 0x0390)
class UMassActorInstanceHandleInitializer final : public UMassSmartObjectInitializerBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassActorInstanceHandleInitializer">();
	}
	static class UMassActorInstanceHandleInitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassActorInstanceHandleInitializer>();
	}
};
static_assert(alignof(UMassActorInstanceHandleInitializer) == 0x000008, "Wrong alignment on UMassActorInstanceHandleInitializer");
static_assert(sizeof(UMassActorInstanceHandleInitializer) == 0x000390, "Wrong size on UMassActorInstanceHandleInitializer");

// Class MassSmartObjects.MassActorInstanceHandleDeinitializer
// 0x0000 (0x0390 - 0x0390)
class UMassActorInstanceHandleDeinitializer final : public UMassSmartObjectDeinitializerBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassActorInstanceHandleDeinitializer">();
	}
	static class UMassActorInstanceHandleDeinitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassActorInstanceHandleDeinitializer>();
	}
};
static_assert(alignof(UMassActorInstanceHandleDeinitializer) == 0x000008, "Wrong alignment on UMassActorInstanceHandleDeinitializer");
static_assert(sizeof(UMassActorInstanceHandleDeinitializer) == 0x000390, "Wrong size on UMassActorInstanceHandleDeinitializer");

// Class MassSmartObjects.MassActiveSmartObjectSignalProcessor
// 0x0540 (0x0960 - 0x0420)
class UMassActiveSmartObjectSignalProcessor final : public UMassSignalProcessorBase
{
public:
	uint8                                         Pad_420[0x540];                                    // 0x0420(0x0540)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassActiveSmartObjectSignalProcessor">();
	}
	static class UMassActiveSmartObjectSignalProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassActiveSmartObjectSignalProcessor>();
	}
};
static_assert(alignof(UMassActiveSmartObjectSignalProcessor) == 0x000008, "Wrong alignment on UMassActiveSmartObjectSignalProcessor");
static_assert(sizeof(UMassActiveSmartObjectSignalProcessor) == 0x000960, "Wrong size on UMassActiveSmartObjectSignalProcessor");

// Class MassSmartObjects.MassSmartObjectSettings
// 0x0008 (0x0030 - 0x0028)
class UMassSmartObjectSettings final : public UMassModuleSettings
{
public:
	struct FZoneGraphTag                          SmartObjectTag;                                    // 0x0028(0x0001)(Edit, Config, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SearchExtents;                                     // 0x002C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSmartObjectSettings">();
	}
	static class UMassSmartObjectSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSmartObjectSettings>();
	}
};
static_assert(alignof(UMassSmartObjectSettings) == 0x000008, "Wrong alignment on UMassSmartObjectSettings");
static_assert(sizeof(UMassSmartObjectSettings) == 0x000030, "Wrong size on UMassSmartObjectSettings");
static_assert(offsetof(UMassSmartObjectSettings, SmartObjectTag) == 0x000028, "Member 'UMassSmartObjectSettings::SmartObjectTag' has a wrong offset!");
static_assert(offsetof(UMassSmartObjectSettings, SearchExtents) == 0x00002C, "Member 'UMassSmartObjectSettings::SearchExtents' has a wrong offset!");

// Class MassSmartObjects.MassSmartObjectUserTrait
// 0x0020 (0x0048 - 0x0028)
class UMassSmartObjectUserTrait final : public UMassEntityTraitBase
{
public:
	struct FGameplayTagContainer                  UserTags;                                          // 0x0028(0x0020)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSmartObjectUserTrait">();
	}
	static class UMassSmartObjectUserTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSmartObjectUserTrait>();
	}
};
static_assert(alignof(UMassSmartObjectUserTrait) == 0x000008, "Wrong alignment on UMassSmartObjectUserTrait");
static_assert(sizeof(UMassSmartObjectUserTrait) == 0x000048, "Wrong size on UMassSmartObjectUserTrait");
static_assert(offsetof(UMassSmartObjectUserTrait, UserTags) == 0x000028, "Member 'UMassSmartObjectUserTrait::UserTags' has a wrong offset!");

// Class MassSmartObjects.SmartObjectZoneAnnotations
// 0x0030 (0x05C0 - 0x0590)
class USmartObjectZoneAnnotations final : public UZoneGraphAnnotationComponent
{
public:
	struct FZoneGraphTagFilter                    AffectedLaneTags;                                  // 0x0588(0x000C)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_594[0x4];                                      // 0x0594(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSmartObjectAnnotationData>     SmartObjectAnnotationDataArray;                    // 0x0598(0x0010)(Edit, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	struct FZoneGraphTag                          BehaviorTag;                                       // 0x05A8(0x0001)(Edit, EditConst, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5A9[0x7];                                      // 0x05A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USmartObjectSubsystem*                  SmartObjectSubsystem;                              // 0x05B0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5B8[0x8];                                      // 0x05B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SmartObjectZoneAnnotations">();
	}
	static class USmartObjectZoneAnnotations* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmartObjectZoneAnnotations>();
	}
};
static_assert(alignof(USmartObjectZoneAnnotations) == 0x000010, "Wrong alignment on USmartObjectZoneAnnotations");
static_assert(sizeof(USmartObjectZoneAnnotations) == 0x0005C0, "Wrong size on USmartObjectZoneAnnotations");
static_assert(offsetof(USmartObjectZoneAnnotations, AffectedLaneTags) == 0x000588, "Member 'USmartObjectZoneAnnotations::AffectedLaneTags' has a wrong offset!");
static_assert(offsetof(USmartObjectZoneAnnotations, SmartObjectAnnotationDataArray) == 0x000598, "Member 'USmartObjectZoneAnnotations::SmartObjectAnnotationDataArray' has a wrong offset!");
static_assert(offsetof(USmartObjectZoneAnnotations, BehaviorTag) == 0x0005A8, "Member 'USmartObjectZoneAnnotations::BehaviorTag' has a wrong offset!");
static_assert(offsetof(USmartObjectZoneAnnotations, SmartObjectSubsystem) == 0x0005B0, "Member 'USmartObjectZoneAnnotations::SmartObjectSubsystem' has a wrong offset!");

}

