#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassSimulation

#include "Basic.hpp"

#include "MassEntity_structs.hpp"
#include "MassEntity_classes.hpp"


namespace SDK
{

// Class MassSimulation.MassSimulationSettings
// 0x0028 (0x0050 - 0x0028)
class UMassSimulationSettings final : public UMassModuleSettings
{
public:
	double                                        DesiredActorSpawningTimeSlicePerTick;              // 0x0028(0x0008)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        DesiredActorDestructionTimeSlicePerTick;           // 0x0030(0x0008)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEntityCompactionEnabled;                          // 0x0038(0x0001)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DesiredEntityCompactionTimeSlicePerTick;           // 0x0040(0x0008)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DesiredActorFailedSpawningRetryTimeInterval;       // 0x0048(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DesiredActorFailedSpawningRetryMoveDistance;       // 0x004C(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSimulationSettings">();
	}
	static class UMassSimulationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSimulationSettings>();
	}
};
static_assert(alignof(UMassSimulationSettings) == 0x000008, "Wrong alignment on UMassSimulationSettings");
static_assert(sizeof(UMassSimulationSettings) == 0x000050, "Wrong size on UMassSimulationSettings");
static_assert(offsetof(UMassSimulationSettings, DesiredActorSpawningTimeSlicePerTick) == 0x000028, "Member 'UMassSimulationSettings::DesiredActorSpawningTimeSlicePerTick' has a wrong offset!");
static_assert(offsetof(UMassSimulationSettings, DesiredActorDestructionTimeSlicePerTick) == 0x000030, "Member 'UMassSimulationSettings::DesiredActorDestructionTimeSlicePerTick' has a wrong offset!");
static_assert(offsetof(UMassSimulationSettings, bEntityCompactionEnabled) == 0x000038, "Member 'UMassSimulationSettings::bEntityCompactionEnabled' has a wrong offset!");
static_assert(offsetof(UMassSimulationSettings, DesiredEntityCompactionTimeSlicePerTick) == 0x000040, "Member 'UMassSimulationSettings::DesiredEntityCompactionTimeSlicePerTick' has a wrong offset!");
static_assert(offsetof(UMassSimulationSettings, DesiredActorFailedSpawningRetryTimeInterval) == 0x000048, "Member 'UMassSimulationSettings::DesiredActorFailedSpawningRetryTimeInterval' has a wrong offset!");
static_assert(offsetof(UMassSimulationSettings, DesiredActorFailedSpawningRetryMoveDistance) == 0x00004C, "Member 'UMassSimulationSettings::DesiredActorFailedSpawningRetryMoveDistance' has a wrong offset!");

// Class MassSimulation.MassSimulationSubsystem
// 0x0480 (0x04B8 - 0x0038)
class UMassSimulationSubsystem final : public UMassSubsystemBase
{
public:
	uint8                                         Pad_38[0x460];                                     // 0x0038(0x0460)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMassRuntimePipeline                   RuntimePipeline;                                   // 0x0498(0x0018)(Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4B0[0x8];                                      // 0x04B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassSimulationSubsystem">();
	}
	static class UMassSimulationSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassSimulationSubsystem>();
	}
};
static_assert(alignof(UMassSimulationSubsystem) == 0x000008, "Wrong alignment on UMassSimulationSubsystem");
static_assert(sizeof(UMassSimulationSubsystem) == 0x0004B8, "Wrong size on UMassSimulationSubsystem");
static_assert(offsetof(UMassSimulationSubsystem, RuntimePipeline) == 0x000498, "Member 'UMassSimulationSubsystem::RuntimePipeline' has a wrong offset!");

}

