#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassAIBehavior

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MassAIBehavior.MassComponentHitSubsystem.OnHitCallback
// 0x0128 (0x0128 - 0x0000)
struct MassComponentHitSubsystem_OnHitCallback final
{
public:
	class UPrimitiveComponent*                    HitComp;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0030(0x00F8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassComponentHitSubsystem_OnHitCallback) == 0x000008, "Wrong alignment on MassComponentHitSubsystem_OnHitCallback");
static_assert(sizeof(MassComponentHitSubsystem_OnHitCallback) == 0x000128, "Wrong size on MassComponentHitSubsystem_OnHitCallback");
static_assert(offsetof(MassComponentHitSubsystem_OnHitCallback, HitComp) == 0x000000, "Member 'MassComponentHitSubsystem_OnHitCallback::HitComp' has a wrong offset!");
static_assert(offsetof(MassComponentHitSubsystem_OnHitCallback, OtherActor) == 0x000008, "Member 'MassComponentHitSubsystem_OnHitCallback::OtherActor' has a wrong offset!");
static_assert(offsetof(MassComponentHitSubsystem_OnHitCallback, OtherComp) == 0x000010, "Member 'MassComponentHitSubsystem_OnHitCallback::OtherComp' has a wrong offset!");
static_assert(offsetof(MassComponentHitSubsystem_OnHitCallback, NormalImpulse) == 0x000018, "Member 'MassComponentHitSubsystem_OnHitCallback::NormalImpulse' has a wrong offset!");
static_assert(offsetof(MassComponentHitSubsystem_OnHitCallback, Hit) == 0x000030, "Member 'MassComponentHitSubsystem_OnHitCallback::Hit' has a wrong offset!");

}

