#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassAIBehavior

#include "Basic.hpp"

#include "MassEntity_structs.hpp"
#include "MassEntity_classes.hpp"
#include "MassAIBehavior_structs.hpp"
#include "MassSpawner_classes.hpp"
#include "StateTreeModule_classes.hpp"
#include "MassSignals_classes.hpp"


namespace SDK
{

// Class MassAIBehavior.MassBehaviorSettings
// 0x0010 (0x0038 - 0x0028)
class UMassBehaviorSettings final : public UMassModuleSettings
{
public:
	int32                                         MaxActivationsPerLOD[0x4];                         // 0x0028(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassBehaviorSettings">();
	}
	static class UMassBehaviorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassBehaviorSettings>();
	}
};
static_assert(alignof(UMassBehaviorSettings) == 0x000008, "Wrong alignment on UMassBehaviorSettings");
static_assert(sizeof(UMassBehaviorSettings) == 0x000038, "Wrong size on UMassBehaviorSettings");
static_assert(offsetof(UMassBehaviorSettings, MaxActivationsPerLOD) == 0x000028, "Member 'UMassBehaviorSettings::MaxActivationsPerLOD' has a wrong offset!");

// Class MassAIBehavior.MassComponentHitSubsystem
// 0x0100 (0x0148 - 0x0048)
class UMassComponentHitSubsystem final : public UMassTickableSubsystemBase
{
public:
	class UMassSignalSubsystem*                   SignalSubsystem;                                   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMassAgentSubsystem*                    AgentSubsystem;                                    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<struct FMassEntityHandle, struct FMassHitResult> HitResults;                                // 0x0058(0x0050)(Protected, NativeAccessSpecifierProtected)
	TMap<class UActorComponent*, struct FMassEntityHandle> ComponentToEntityMap;                     // 0x00A8(0x0050)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TMap<struct FMassEntityHandle, class UActorComponent*> EntityToComponentMap;                     // 0x00F8(0x0050)(ExportObject, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	void OnHitCallback(class UPrimitiveComponent* HitComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassComponentHitSubsystem">();
	}
	static class UMassComponentHitSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassComponentHitSubsystem>();
	}
};
static_assert(alignof(UMassComponentHitSubsystem) == 0x000008, "Wrong alignment on UMassComponentHitSubsystem");
static_assert(sizeof(UMassComponentHitSubsystem) == 0x000148, "Wrong size on UMassComponentHitSubsystem");
static_assert(offsetof(UMassComponentHitSubsystem, SignalSubsystem) == 0x000048, "Member 'UMassComponentHitSubsystem::SignalSubsystem' has a wrong offset!");
static_assert(offsetof(UMassComponentHitSubsystem, AgentSubsystem) == 0x000050, "Member 'UMassComponentHitSubsystem::AgentSubsystem' has a wrong offset!");
static_assert(offsetof(UMassComponentHitSubsystem, HitResults) == 0x000058, "Member 'UMassComponentHitSubsystem::HitResults' has a wrong offset!");
static_assert(offsetof(UMassComponentHitSubsystem, ComponentToEntityMap) == 0x0000A8, "Member 'UMassComponentHitSubsystem::ComponentToEntityMap' has a wrong offset!");
static_assert(offsetof(UMassComponentHitSubsystem, EntityToComponentMap) == 0x0000F8, "Member 'UMassComponentHitSubsystem::EntityToComponentMap' has a wrong offset!");

// Class MassAIBehavior.MassLookAtProcessor
// 0x02C0 (0x0380 - 0x00C0)
class UMassLookAtProcessor final : public UMassProcessor
{
public:
	float                                         QueryExtent;                                       // 0x00C0(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Duration;                                          // 0x00C4(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DurationVariation;                                 // 0x00C8(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DebugZOffset;                                      // 0x00CC(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AngleThresholdInDegrees;                           // 0x00D0(0x0004)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D4[0x2AC];                                     // 0x00D4(0x02AC)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassLookAtProcessor">();
	}
	static class UMassLookAtProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassLookAtProcessor>();
	}
};
static_assert(alignof(UMassLookAtProcessor) == 0x000008, "Wrong alignment on UMassLookAtProcessor");
static_assert(sizeof(UMassLookAtProcessor) == 0x000380, "Wrong size on UMassLookAtProcessor");
static_assert(offsetof(UMassLookAtProcessor, QueryExtent) == 0x0000C0, "Member 'UMassLookAtProcessor::QueryExtent' has a wrong offset!");
static_assert(offsetof(UMassLookAtProcessor, Duration) == 0x0000C4, "Member 'UMassLookAtProcessor::Duration' has a wrong offset!");
static_assert(offsetof(UMassLookAtProcessor, DurationVariation) == 0x0000C8, "Member 'UMassLookAtProcessor::DurationVariation' has a wrong offset!");
static_assert(offsetof(UMassLookAtProcessor, DebugZOffset) == 0x0000CC, "Member 'UMassLookAtProcessor::DebugZOffset' has a wrong offset!");
static_assert(offsetof(UMassLookAtProcessor, AngleThresholdInDegrees) == 0x0000D0, "Member 'UMassLookAtProcessor::AngleThresholdInDegrees' has a wrong offset!");

// Class MassAIBehavior.MassLookAtTargetTrait
// 0x0000 (0x0028 - 0x0028)
class UMassLookAtTargetTrait final : public UMassEntityTraitBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassLookAtTargetTrait">();
	}
	static class UMassLookAtTargetTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassLookAtTargetTrait>();
	}
};
static_assert(alignof(UMassLookAtTargetTrait) == 0x000008, "Wrong alignment on UMassLookAtTargetTrait");
static_assert(sizeof(UMassLookAtTargetTrait) == 0x000028, "Wrong size on UMassLookAtTargetTrait");

// Class MassAIBehavior.MassLookAtTrait
// 0x0000 (0x0028 - 0x0028)
class UMassLookAtTrait final : public UMassEntityTraitBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassLookAtTrait">();
	}
	static class UMassLookAtTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassLookAtTrait>();
	}
};
static_assert(alignof(UMassLookAtTrait) == 0x000008, "Wrong alignment on UMassLookAtTrait");
static_assert(sizeof(UMassLookAtTrait) == 0x000028, "Wrong size on UMassLookAtTrait");

// Class MassAIBehavior.MassStateTreeFragmentDestructor
// 0x02B8 (0x0390 - 0x00D8)
class alignas(0x10) UMassStateTreeFragmentDestructor final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_D8[0x2A8];                                     // 0x00D8(0x02A8)(Fixing Size After Last Property [ Dumper-7 ])
	class UMassSignalSubsystem*                   SignalSubsystem;                                   // 0x0380(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_388[0x8];                                      // 0x0388(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassStateTreeFragmentDestructor">();
	}
	static class UMassStateTreeFragmentDestructor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassStateTreeFragmentDestructor>();
	}
};
static_assert(alignof(UMassStateTreeFragmentDestructor) == 0x000010, "Wrong alignment on UMassStateTreeFragmentDestructor");
static_assert(sizeof(UMassStateTreeFragmentDestructor) == 0x000390, "Wrong size on UMassStateTreeFragmentDestructor");
static_assert(offsetof(UMassStateTreeFragmentDestructor, SignalSubsystem) == 0x000380, "Member 'UMassStateTreeFragmentDestructor::SignalSubsystem' has a wrong offset!");

// Class MassAIBehavior.MassStateTreeActivationProcessor
// 0x02A0 (0x0360 - 0x00C0)
class UMassStateTreeActivationProcessor final : public UMassProcessor
{
public:
	uint8                                         Pad_C0[0x2A0];                                     // 0x00C0(0x02A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassStateTreeActivationProcessor">();
	}
	static class UMassStateTreeActivationProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassStateTreeActivationProcessor>();
	}
};
static_assert(alignof(UMassStateTreeActivationProcessor) == 0x000008, "Wrong alignment on UMassStateTreeActivationProcessor");
static_assert(sizeof(UMassStateTreeActivationProcessor) == 0x000360, "Wrong size on UMassStateTreeActivationProcessor");

// Class MassAIBehavior.MassStateTreeProcessor
// 0x0000 (0x0420 - 0x0420)
class UMassStateTreeProcessor final : public UMassSignalProcessorBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassStateTreeProcessor">();
	}
	static class UMassStateTreeProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassStateTreeProcessor>();
	}
};
static_assert(alignof(UMassStateTreeProcessor) == 0x000008, "Wrong alignment on UMassStateTreeProcessor");
static_assert(sizeof(UMassStateTreeProcessor) == 0x000420, "Wrong size on UMassStateTreeProcessor");

// Class MassAIBehavior.MassStateTreeSchema
// 0x0000 (0x0028 - 0x0028)
class UMassStateTreeSchema final : public UStateTreeSchema
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassStateTreeSchema">();
	}
	static class UMassStateTreeSchema* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassStateTreeSchema>();
	}
};
static_assert(alignof(UMassStateTreeSchema) == 0x000008, "Wrong alignment on UMassStateTreeSchema");
static_assert(sizeof(UMassStateTreeSchema) == 0x000028, "Wrong size on UMassStateTreeSchema");

// Class MassAIBehavior.MassStateTreeSubsystem
// 0x0020 (0x0058 - 0x0038)
class UMassStateTreeSubsystem final : public UMassSubsystemBase
{
public:
	uint8                                         Pad_38[0x10];                                      // 0x0038(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMassStateTreeInstanceDataItem> InstanceDataArray;                                 // 0x0048(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassStateTreeSubsystem">();
	}
	static class UMassStateTreeSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassStateTreeSubsystem>();
	}
};
static_assert(alignof(UMassStateTreeSubsystem) == 0x000008, "Wrong alignment on UMassStateTreeSubsystem");
static_assert(sizeof(UMassStateTreeSubsystem) == 0x000058, "Wrong size on UMassStateTreeSubsystem");
static_assert(offsetof(UMassStateTreeSubsystem, InstanceDataArray) == 0x000048, "Member 'UMassStateTreeSubsystem::InstanceDataArray' has a wrong offset!");

// Class MassAIBehavior.MassStateTreeTrait
// 0x0008 (0x0030 - 0x0028)
class UMassStateTreeTrait final : public UMassEntityTraitBase
{
public:
	class UStateTree*                             StateTree;                                         // 0x0028(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassStateTreeTrait">();
	}
	static class UMassStateTreeTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassStateTreeTrait>();
	}
};
static_assert(alignof(UMassStateTreeTrait) == 0x000008, "Wrong alignment on UMassStateTreeTrait");
static_assert(sizeof(UMassStateTreeTrait) == 0x000030, "Wrong size on UMassStateTreeTrait");
static_assert(offsetof(UMassStateTreeTrait, StateTree) == 0x000028, "Member 'UMassStateTreeTrait::StateTree' has a wrong offset!");

// Class MassAIBehavior.MassZoneGraphAnnotationTagsInitializer
// 0x02A8 (0x0380 - 0x00D8)
class UMassZoneGraphAnnotationTagsInitializer final : public UMassObserverProcessor
{
public:
	uint8                                         Pad_D8[0x2A8];                                     // 0x00D8(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassZoneGraphAnnotationTagsInitializer">();
	}
	static class UMassZoneGraphAnnotationTagsInitializer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassZoneGraphAnnotationTagsInitializer>();
	}
};
static_assert(alignof(UMassZoneGraphAnnotationTagsInitializer) == 0x000008, "Wrong alignment on UMassZoneGraphAnnotationTagsInitializer");
static_assert(sizeof(UMassZoneGraphAnnotationTagsInitializer) == 0x000380, "Wrong size on UMassZoneGraphAnnotationTagsInitializer");

// Class MassAIBehavior.MassZoneGraphAnnotationTagUpdateProcessor
// 0x0010 (0x0430 - 0x0420)
class UMassZoneGraphAnnotationTagUpdateProcessor final : public UMassSignalProcessorBase
{
public:
	uint8                                         Pad_420[0x10];                                     // 0x0420(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassZoneGraphAnnotationTagUpdateProcessor">();
	}
	static class UMassZoneGraphAnnotationTagUpdateProcessor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassZoneGraphAnnotationTagUpdateProcessor>();
	}
};
static_assert(alignof(UMassZoneGraphAnnotationTagUpdateProcessor) == 0x000008, "Wrong alignment on UMassZoneGraphAnnotationTagUpdateProcessor");
static_assert(sizeof(UMassZoneGraphAnnotationTagUpdateProcessor) == 0x000430, "Wrong size on UMassZoneGraphAnnotationTagUpdateProcessor");

// Class MassAIBehavior.MassZoneGraphAnnotationTrait
// 0x0000 (0x0028 - 0x0028)
class UMassZoneGraphAnnotationTrait final : public UMassEntityTraitBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MassZoneGraphAnnotationTrait">();
	}
	static class UMassZoneGraphAnnotationTrait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMassZoneGraphAnnotationTrait>();
	}
};
static_assert(alignof(UMassZoneGraphAnnotationTrait) == 0x000008, "Wrong alignment on UMassZoneGraphAnnotationTrait");
static_assert(sizeof(UMassZoneGraphAnnotationTrait) == 0x000028, "Wrong size on UMassZoneGraphAnnotationTrait");

}

