#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassMovement

#include "Basic.hpp"

#include "MassEntity_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct MassMovement.MassVelocityFragment
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FMassVelocityFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassVelocityFragment) == 0x000008, "Wrong alignment on FMassVelocityFragment");
static_assert(sizeof(FMassVelocityFragment) == 0x000018, "Wrong size on FMassVelocityFragment");

// ScriptStruct MassMovement.MassForceFragment
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FMassForceFragment final : public FMassFragment
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassForceFragment) == 0x000008, "Wrong alignment on FMassForceFragment");
static_assert(sizeof(FMassForceFragment) == 0x000018, "Wrong size on FMassForceFragment");

// ScriptStruct MassMovement.MassMovementStyleRef
// 0x0018 (0x0018 - 0x0000)
struct FMassMovementStyleRef final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ID;                                                // 0x0008(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassMovementStyleRef) == 0x000004, "Wrong alignment on FMassMovementStyleRef");
static_assert(sizeof(FMassMovementStyleRef) == 0x000018, "Wrong size on FMassMovementStyleRef");
static_assert(offsetof(FMassMovementStyleRef, Name) == 0x000000, "Member 'FMassMovementStyleRef::Name' has a wrong offset!");
static_assert(offsetof(FMassMovementStyleRef, ID) == 0x000008, "Member 'FMassMovementStyleRef::ID' has a wrong offset!");

// ScriptStruct MassMovement.MassMovementStyleSpeedParameters
// 0x0010 (0x0010 - 0x0000)
struct FMassMovementStyleSpeedParameters final
{
public:
	float                                         Speed;                                             // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Variance;                                          // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Probability;                                       // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassMovementStyleSpeedParameters) == 0x000004, "Wrong alignment on FMassMovementStyleSpeedParameters");
static_assert(sizeof(FMassMovementStyleSpeedParameters) == 0x000010, "Wrong size on FMassMovementStyleSpeedParameters");
static_assert(offsetof(FMassMovementStyleSpeedParameters, Speed) == 0x000000, "Member 'FMassMovementStyleSpeedParameters::Speed' has a wrong offset!");
static_assert(offsetof(FMassMovementStyleSpeedParameters, Variance) == 0x000004, "Member 'FMassMovementStyleSpeedParameters::Variance' has a wrong offset!");
static_assert(offsetof(FMassMovementStyleSpeedParameters, Probability) == 0x000008, "Member 'FMassMovementStyleSpeedParameters::Probability' has a wrong offset!");

// ScriptStruct MassMovement.MassMovementStyleParameters
// 0x0028 (0x0028 - 0x0000)
struct FMassMovementStyleParameters final
{
public:
	struct FMassMovementStyleRef                  Style;                                             // 0x0000(0x0018)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FMassMovementStyleSpeedParameters> DesiredSpeeds;                                  // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassMovementStyleParameters) == 0x000008, "Wrong alignment on FMassMovementStyleParameters");
static_assert(sizeof(FMassMovementStyleParameters) == 0x000028, "Wrong size on FMassMovementStyleParameters");
static_assert(offsetof(FMassMovementStyleParameters, Style) == 0x000000, "Member 'FMassMovementStyleParameters::Style' has a wrong offset!");
static_assert(offsetof(FMassMovementStyleParameters, DesiredSpeeds) == 0x000018, "Member 'FMassMovementStyleParameters::DesiredSpeeds' has a wrong offset!");

// ScriptStruct MassMovement.MassMovementParameters
// 0x0028 (0x0028 - 0x0000)
struct FMassMovementParameters final : public FMassSharedFragment
{
public:
	float                                         MaxSpeed;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxAcceleration;                                   // 0x0004(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultDesiredSpeed;                               // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultDesiredSpeedVariance;                       // 0x000C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeightSmoothingTime;                               // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FMassMovementStyleParameters>   MovementStyles;                                    // 0x0018(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassMovementParameters) == 0x000008, "Wrong alignment on FMassMovementParameters");
static_assert(sizeof(FMassMovementParameters) == 0x000028, "Wrong size on FMassMovementParameters");
static_assert(offsetof(FMassMovementParameters, MaxSpeed) == 0x000000, "Member 'FMassMovementParameters::MaxSpeed' has a wrong offset!");
static_assert(offsetof(FMassMovementParameters, MaxAcceleration) == 0x000004, "Member 'FMassMovementParameters::MaxAcceleration' has a wrong offset!");
static_assert(offsetof(FMassMovementParameters, DefaultDesiredSpeed) == 0x000008, "Member 'FMassMovementParameters::DefaultDesiredSpeed' has a wrong offset!");
static_assert(offsetof(FMassMovementParameters, DefaultDesiredSpeedVariance) == 0x00000C, "Member 'FMassMovementParameters::DefaultDesiredSpeedVariance' has a wrong offset!");
static_assert(offsetof(FMassMovementParameters, HeightSmoothingTime) == 0x000010, "Member 'FMassMovementParameters::HeightSmoothingTime' has a wrong offset!");
static_assert(offsetof(FMassMovementParameters, MovementStyles) == 0x000018, "Member 'FMassMovementParameters::MovementStyles' has a wrong offset!");

// ScriptStruct MassMovement.MassMovementStyle
// 0x0018 (0x0018 - 0x0000)
struct FMassMovementStyle final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ID;                                                // 0x0008(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassMovementStyle) == 0x000004, "Wrong alignment on FMassMovementStyle");
static_assert(sizeof(FMassMovementStyle) == 0x000018, "Wrong size on FMassMovementStyle");
static_assert(offsetof(FMassMovementStyle, Name) == 0x000000, "Member 'FMassMovementStyle::Name' has a wrong offset!");
static_assert(offsetof(FMassMovementStyle, ID) == 0x000008, "Member 'FMassMovementStyle::ID' has a wrong offset!");

// ScriptStruct MassMovement.MassSimpleMovementTag
// 0x0000 (0x0001 - 0x0001)
struct FMassSimpleMovementTag final : public FMassTag
{
};
static_assert(alignof(FMassSimpleMovementTag) == 0x000001, "Wrong alignment on FMassSimpleMovementTag");
static_assert(sizeof(FMassSimpleMovementTag) == 0x000001, "Wrong size on FMassSimpleMovementTag");

}

