#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassActors

#include "Basic.hpp"


namespace SDK::Params
{

// Function MassActors.MassActorPoolableInterface.CanBePooled
// 0x0001 (0x0001 - 0x0000)
struct MassActorPoolableInterface_CanBePooled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassActorPoolableInterface_CanBePooled) == 0x000001, "Wrong alignment on MassActorPoolableInterface_CanBePooled");
static_assert(sizeof(MassActorPoolableInterface_CanBePooled) == 0x000001, "Wrong size on MassActorPoolableInterface_CanBePooled");
static_assert(offsetof(MassActorPoolableInterface_CanBePooled, ReturnValue) == 0x000000, "Member 'MassActorPoolableInterface_CanBePooled::ReturnValue' has a wrong offset!");

// Function MassActors.MassAgentComponent.KillEntity
// 0x0001 (0x0001 - 0x0000)
struct MassAgentComponent_KillEntity final
{
public:
	bool                                          bDestroyActor;                                     // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MassAgentComponent_KillEntity) == 0x000001, "Wrong alignment on MassAgentComponent_KillEntity");
static_assert(sizeof(MassAgentComponent_KillEntity) == 0x000001, "Wrong size on MassAgentComponent_KillEntity");
static_assert(offsetof(MassAgentComponent_KillEntity, bDestroyActor) == 0x000000, "Member 'MassAgentComponent_KillEntity::bDestroyActor' has a wrong offset!");

}

