#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MassActors

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "MassCommon_structs.hpp"
#include "Engine_structs.hpp"
#include "MassEntity_structs.hpp"


namespace SDK
{

// Enum MassActors.ESpawnRequestStatus
// NumValues: 0x0007
enum class ESpawnRequestStatus : uint8
{
	None                                     = 0,
	Pending                                  = 1,
	Processing                               = 2,
	Succeeded                                = 3,
	Failed                                   = 4,
	RetryPending                             = 5,
	ESpawnRequestStatus_MAX                  = 6,
};

// Enum MassActors.EAgentComponentState
// NumValues: 0x0009
enum class EAgentComponentState : uint8
{
	None                                     = 0,
	EntityPendingCreation                    = 1,
	EntityCreated                            = 2,
	PuppetPendingInitialization              = 3,
	PuppetInitialized                        = 4,
	PuppetPaused                             = 5,
	PuppetPendingReplication                 = 6,
	PuppetReplicatedOrphan                   = 7,
	EAgentComponentState_MAX                 = 8,
};

// ScriptStruct MassActors.MassActorSpawnRequestHandle
// 0x0000 (0x0008 - 0x0008)
struct FMassActorSpawnRequestHandle final : public FIndexedHandleBase
{
};
static_assert(alignof(FMassActorSpawnRequestHandle) == 0x000004, "Wrong alignment on FMassActorSpawnRequestHandle");
static_assert(sizeof(FMassActorSpawnRequestHandle) == 0x000008, "Wrong size on FMassActorSpawnRequestHandle");

// ScriptStruct MassActors.MassActorSpawnRequest
// 0x00D0 (0x00D0 - 0x0000)
struct alignas(0x10) FMassActorSpawnRequest final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     Template;                                          // 0x0008(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_10[0x90];                                      // 0x0010(0x0090)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SpawnedActor;                                      // 0x00A0(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x28];                                      // 0x00A8(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassActorSpawnRequest) == 0x000010, "Wrong alignment on FMassActorSpawnRequest");
static_assert(sizeof(FMassActorSpawnRequest) == 0x0000D0, "Wrong size on FMassActorSpawnRequest");
static_assert(offsetof(FMassActorSpawnRequest, Template) == 0x000008, "Member 'FMassActorSpawnRequest::Template' has a wrong offset!");
static_assert(offsetof(FMassActorSpawnRequest, SpawnedActor) == 0x0000A0, "Member 'FMassActorSpawnRequest::SpawnedActor' has a wrong offset!");

// ScriptStruct MassActors.MassGuidFragment
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x04) FMassGuidFragment final : public FObjectWrapperFragment
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassGuidFragment) == 0x000004, "Wrong alignment on FMassGuidFragment");
static_assert(sizeof(FMassGuidFragment) == 0x000010, "Wrong size on FMassGuidFragment");

// ScriptStruct MassActors.MassActorInstanceFragment
// 0x0020 (0x0020 - 0x0000)
struct FMassActorInstanceFragment final : public FMassFragment
{
public:
	struct FActorInstanceHandle                   Handle;                                            // 0x0000(0x0020)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassActorInstanceFragment) == 0x000008, "Wrong alignment on FMassActorInstanceFragment");
static_assert(sizeof(FMassActorInstanceFragment) == 0x000020, "Wrong size on FMassActorInstanceFragment");
static_assert(offsetof(FMassActorInstanceFragment, Handle) == 0x000000, "Member 'FMassActorInstanceFragment::Handle' has a wrong offset!");

// ScriptStruct MassActors.MassActorFragment
// 0x000C (0x000C - 0x0000)
struct FMassActorFragment final : public FObjectWrapperFragment
{
public:
	TWeakObjectPtr<class AActor>                  Actor;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_8[0x4];                                        // 0x0008(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassActorFragment) == 0x000004, "Wrong alignment on FMassActorFragment");
static_assert(sizeof(FMassActorFragment) == 0x00000C, "Wrong size on FMassActorFragment");
static_assert(offsetof(FMassActorFragment, Actor) == 0x000000, "Member 'FMassActorFragment::Actor' has a wrong offset!");

// ScriptStruct MassActors.MassAgentInitializationQueue
// 0x0010 (0x0010 - 0x0000)
struct FMassAgentInitializationQueue final
{
public:
	TArray<class UMassAgentComponent*>            AgentComponents;                                   // 0x0000(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic)
};
static_assert(alignof(FMassAgentInitializationQueue) == 0x000008, "Wrong alignment on FMassAgentInitializationQueue");
static_assert(sizeof(FMassAgentInitializationQueue) == 0x000010, "Wrong size on FMassAgentInitializationQueue");
static_assert(offsetof(FMassAgentInitializationQueue, AgentComponents) == 0x000000, "Member 'FMassAgentInitializationQueue::AgentComponents' has a wrong offset!");

// ScriptStruct MassActors.CapsuleComponentWrapperFragment
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FCapsuleComponentWrapperFragment final : public FObjectWrapperFragment
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCapsuleComponentWrapperFragment) == 0x000004, "Wrong alignment on FCapsuleComponentWrapperFragment");
static_assert(sizeof(FCapsuleComponentWrapperFragment) == 0x000008, "Wrong size on FCapsuleComponentWrapperFragment");

// ScriptStruct MassActors.MassCapsuleTransformCopyToMassTag
// 0x0000 (0x0001 - 0x0001)
struct FMassCapsuleTransformCopyToMassTag final : public FMassTag
{
};
static_assert(alignof(FMassCapsuleTransformCopyToMassTag) == 0x000001, "Wrong alignment on FMassCapsuleTransformCopyToMassTag");
static_assert(sizeof(FMassCapsuleTransformCopyToMassTag) == 0x000001, "Wrong size on FMassCapsuleTransformCopyToMassTag");

// ScriptStruct MassActors.MassCapsuleTransformCopyToActorTag
// 0x0000 (0x0001 - 0x0001)
struct FMassCapsuleTransformCopyToActorTag final : public FMassTag
{
};
static_assert(alignof(FMassCapsuleTransformCopyToActorTag) == 0x000001, "Wrong alignment on FMassCapsuleTransformCopyToActorTag");
static_assert(sizeof(FMassCapsuleTransformCopyToActorTag) == 0x000001, "Wrong size on FMassCapsuleTransformCopyToActorTag");

// ScriptStruct MassActors.CharacterMovementComponentWrapperFragment
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FCharacterMovementComponentWrapperFragment final : public FObjectWrapperFragment
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCharacterMovementComponentWrapperFragment) == 0x000004, "Wrong alignment on FCharacterMovementComponentWrapperFragment");
static_assert(sizeof(FCharacterMovementComponentWrapperFragment) == 0x000008, "Wrong size on FCharacterMovementComponentWrapperFragment");

// ScriptStruct MassActors.MassCharacterMovementCopyToMassTag
// 0x0000 (0x0001 - 0x0001)
struct FMassCharacterMovementCopyToMassTag final : public FMassTag
{
};
static_assert(alignof(FMassCharacterMovementCopyToMassTag) == 0x000001, "Wrong alignment on FMassCharacterMovementCopyToMassTag");
static_assert(sizeof(FMassCharacterMovementCopyToMassTag) == 0x000001, "Wrong size on FMassCharacterMovementCopyToMassTag");

// ScriptStruct MassActors.MassCharacterMovementCopyToActorTag
// 0x0000 (0x0001 - 0x0001)
struct FMassCharacterMovementCopyToActorTag final : public FMassTag
{
};
static_assert(alignof(FMassCharacterMovementCopyToActorTag) == 0x000001, "Wrong alignment on FMassCharacterMovementCopyToActorTag");
static_assert(sizeof(FMassCharacterMovementCopyToActorTag) == 0x000001, "Wrong size on FMassCharacterMovementCopyToActorTag");

// ScriptStruct MassActors.MassCharacterOrientationCopyToMassTag
// 0x0000 (0x0001 - 0x0001)
struct FMassCharacterOrientationCopyToMassTag final : public FMassTag
{
};
static_assert(alignof(FMassCharacterOrientationCopyToMassTag) == 0x000001, "Wrong alignment on FMassCharacterOrientationCopyToMassTag");
static_assert(sizeof(FMassCharacterOrientationCopyToMassTag) == 0x000001, "Wrong size on FMassCharacterOrientationCopyToMassTag");

// ScriptStruct MassActors.MassCharacterOrientationCopyToActorTag
// 0x0000 (0x0001 - 0x0001)
struct FMassCharacterOrientationCopyToActorTag final : public FMassTag
{
};
static_assert(alignof(FMassCharacterOrientationCopyToActorTag) == 0x000001, "Wrong alignment on FMassCharacterOrientationCopyToActorTag");
static_assert(sizeof(FMassCharacterOrientationCopyToActorTag) == 0x000001, "Wrong size on FMassCharacterOrientationCopyToActorTag");

// ScriptStruct MassActors.MassSceneComponentWrapperFragment
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FMassSceneComponentWrapperFragment final : public FObjectWrapperFragment
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMassSceneComponentWrapperFragment) == 0x000004, "Wrong alignment on FMassSceneComponentWrapperFragment");
static_assert(sizeof(FMassSceneComponentWrapperFragment) == 0x000008, "Wrong size on FMassSceneComponentWrapperFragment");

// ScriptStruct MassActors.MassSceneComponentLocationCopyToMassTag
// 0x0000 (0x0001 - 0x0001)
struct FMassSceneComponentLocationCopyToMassTag final : public FMassTag
{
};
static_assert(alignof(FMassSceneComponentLocationCopyToMassTag) == 0x000001, "Wrong alignment on FMassSceneComponentLocationCopyToMassTag");
static_assert(sizeof(FMassSceneComponentLocationCopyToMassTag) == 0x000001, "Wrong size on FMassSceneComponentLocationCopyToMassTag");

// ScriptStruct MassActors.MassSceneComponentLocationCopyToActorTag
// 0x0000 (0x0001 - 0x0001)
struct FMassSceneComponentLocationCopyToActorTag final : public FMassTag
{
};
static_assert(alignof(FMassSceneComponentLocationCopyToActorTag) == 0x000001, "Wrong alignment on FMassSceneComponentLocationCopyToActorTag");
static_assert(sizeof(FMassSceneComponentLocationCopyToActorTag) == 0x000001, "Wrong size on FMassSceneComponentLocationCopyToActorTag");

// ScriptStruct MassActors.DataFragment_BehaviorTreeComponentWrapper
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x04) FDataFragment_BehaviorTreeComponentWrapper final : public FObjectWrapperFragment
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDataFragment_BehaviorTreeComponentWrapper) == 0x000004, "Wrong alignment on FDataFragment_BehaviorTreeComponentWrapper");
static_assert(sizeof(FDataFragment_BehaviorTreeComponentWrapper) == 0x000008, "Wrong size on FDataFragment_BehaviorTreeComponentWrapper");

}

