#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieRenderPipelineCore

#include "Basic.hpp"

#include "MovieRenderPipelineCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MovieRenderPipelineCore.MovieGraphNode.TogglePromotePropertyToPin
// 0x0008 (0x0008 - 0x0000)
struct MovieGraphNode_TogglePromotePropertyToPin final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieGraphNode_TogglePromotePropertyToPin) == 0x000004, "Wrong alignment on MovieGraphNode_TogglePromotePropertyToPin");
static_assert(sizeof(MovieGraphNode_TogglePromotePropertyToPin) == 0x000008, "Wrong size on MovieGraphNode_TogglePromotePropertyToPin");
static_assert(offsetof(MovieGraphNode_TogglePromotePropertyToPin, PropertyName) == 0x000000, "Member 'MovieGraphNode_TogglePromotePropertyToPin::PropertyName' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphNode.GetExposedProperties
// 0x0010 (0x0010 - 0x0000)
struct MovieGraphNode_GetExposedProperties final
{
public:
	TArray<struct FMovieGraphPropertyInfo>        ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieGraphNode_GetExposedProperties) == 0x000008, "Wrong alignment on MovieGraphNode_GetExposedProperties");
static_assert(sizeof(MovieGraphNode_GetExposedProperties) == 0x000010, "Wrong size on MovieGraphNode_GetExposedProperties");
static_assert(offsetof(MovieGraphNode_GetExposedProperties, ReturnValue) == 0x000000, "Member 'MovieGraphNode_GetExposedProperties::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphNode.GetInputPin
// 0x0018 (0x0018 - 0x0000)
struct MovieGraphNode_GetInputPin final
{
public:
	class FName                                   InPinLabel;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovieGraphPinQueryRequirement                PinRequirement;                                    // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovieGraphPin*                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieGraphNode_GetInputPin) == 0x000008, "Wrong alignment on MovieGraphNode_GetInputPin");
static_assert(sizeof(MovieGraphNode_GetInputPin) == 0x000018, "Wrong size on MovieGraphNode_GetInputPin");
static_assert(offsetof(MovieGraphNode_GetInputPin, InPinLabel) == 0x000000, "Member 'MovieGraphNode_GetInputPin::InPinLabel' has a wrong offset!");
static_assert(offsetof(MovieGraphNode_GetInputPin, PinRequirement) == 0x000008, "Member 'MovieGraphNode_GetInputPin::PinRequirement' has a wrong offset!");
static_assert(offsetof(MovieGraphNode_GetInputPin, ReturnValue) == 0x000010, "Member 'MovieGraphNode_GetInputPin::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphNode.GetOutputPin
// 0x0010 (0x0010 - 0x0000)
struct MovieGraphNode_GetOutputPin final
{
public:
	class FName                                   InPinLabel;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMovieGraphPin*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieGraphNode_GetOutputPin) == 0x000008, "Wrong alignment on MovieGraphNode_GetOutputPin");
static_assert(sizeof(MovieGraphNode_GetOutputPin) == 0x000010, "Wrong size on MovieGraphNode_GetOutputPin");
static_assert(offsetof(MovieGraphNode_GetOutputPin, InPinLabel) == 0x000000, "Member 'MovieGraphNode_GetOutputPin::InPinLabel' has a wrong offset!");
static_assert(offsetof(MovieGraphNode_GetOutputPin, ReturnValue) == 0x000008, "Member 'MovieGraphNode_GetOutputPin::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.GetCompletionPercentage
// 0x0010 (0x0010 - 0x0000)
struct MovieGraphBlueprintLibrary_GetCompletionPercentage final
{
public:
	const class UMovieGraphPipeline*              InPipeline;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MovieGraphBlueprintLibrary_GetCompletionPercentage) == 0x000008, "Wrong alignment on MovieGraphBlueprintLibrary_GetCompletionPercentage");
static_assert(sizeof(MovieGraphBlueprintLibrary_GetCompletionPercentage) == 0x000010, "Wrong size on MovieGraphBlueprintLibrary_GetCompletionPercentage");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetCompletionPercentage, InPipeline) == 0x000000, "Member 'MovieGraphBlueprintLibrary_GetCompletionPercentage::InPipeline' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetCompletionPercentage, ReturnValue) == 0x000008, "Member 'MovieGraphBlueprintLibrary_GetCompletionPercentage::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.GetCurrentAperture
// 0x0010 (0x0010 - 0x0000)
struct MovieGraphBlueprintLibrary_GetCurrentAperture final
{
public:
	const class UMovieGraphPipeline*              InMovieGraphPipeline;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MovieGraphBlueprintLibrary_GetCurrentAperture) == 0x000008, "Wrong alignment on MovieGraphBlueprintLibrary_GetCurrentAperture");
static_assert(sizeof(MovieGraphBlueprintLibrary_GetCurrentAperture) == 0x000010, "Wrong size on MovieGraphBlueprintLibrary_GetCurrentAperture");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetCurrentAperture, InMovieGraphPipeline) == 0x000000, "Member 'MovieGraphBlueprintLibrary_GetCurrentAperture::InMovieGraphPipeline' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetCurrentAperture, ReturnValue) == 0x000008, "Member 'MovieGraphBlueprintLibrary_GetCurrentAperture::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.GetCurrentCineCamera
// 0x0010 (0x0010 - 0x0000)
struct MovieGraphBlueprintLibrary_GetCurrentCineCamera final
{
public:
	const class UMovieGraphPipeline*              InMovieGraphPipeline;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCineCameraComponent*                   ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieGraphBlueprintLibrary_GetCurrentCineCamera) == 0x000008, "Wrong alignment on MovieGraphBlueprintLibrary_GetCurrentCineCamera");
static_assert(sizeof(MovieGraphBlueprintLibrary_GetCurrentCineCamera) == 0x000010, "Wrong size on MovieGraphBlueprintLibrary_GetCurrentCineCamera");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetCurrentCineCamera, InMovieGraphPipeline) == 0x000000, "Member 'MovieGraphBlueprintLibrary_GetCurrentCineCamera::InMovieGraphPipeline' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetCurrentCineCamera, ReturnValue) == 0x000008, "Member 'MovieGraphBlueprintLibrary_GetCurrentCineCamera::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.GetCurrentFocalLength
// 0x0010 (0x0010 - 0x0000)
struct MovieGraphBlueprintLibrary_GetCurrentFocalLength final
{
public:
	const class UMovieGraphPipeline*              InMovieGraphPipeline;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MovieGraphBlueprintLibrary_GetCurrentFocalLength) == 0x000008, "Wrong alignment on MovieGraphBlueprintLibrary_GetCurrentFocalLength");
static_assert(sizeof(MovieGraphBlueprintLibrary_GetCurrentFocalLength) == 0x000010, "Wrong size on MovieGraphBlueprintLibrary_GetCurrentFocalLength");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetCurrentFocalLength, InMovieGraphPipeline) == 0x000000, "Member 'MovieGraphBlueprintLibrary_GetCurrentFocalLength::InMovieGraphPipeline' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetCurrentFocalLength, ReturnValue) == 0x000008, "Member 'MovieGraphBlueprintLibrary_GetCurrentFocalLength::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.GetCurrentFocusDistance
// 0x0010 (0x0010 - 0x0000)
struct MovieGraphBlueprintLibrary_GetCurrentFocusDistance final
{
public:
	const class UMovieGraphPipeline*              InMovieGraphPipeline;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MovieGraphBlueprintLibrary_GetCurrentFocusDistance) == 0x000008, "Wrong alignment on MovieGraphBlueprintLibrary_GetCurrentFocusDistance");
static_assert(sizeof(MovieGraphBlueprintLibrary_GetCurrentFocusDistance) == 0x000010, "Wrong size on MovieGraphBlueprintLibrary_GetCurrentFocusDistance");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetCurrentFocusDistance, InMovieGraphPipeline) == 0x000000, "Member 'MovieGraphBlueprintLibrary_GetCurrentFocusDistance::InMovieGraphPipeline' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetCurrentFocusDistance, ReturnValue) == 0x000008, "Member 'MovieGraphBlueprintLibrary_GetCurrentFocusDistance::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.GetCurrentSegmentName
// 0x0028 (0x0028 - 0x0000)
struct MovieGraphBlueprintLibrary_GetCurrentSegmentName final
{
public:
	const class UMovieGraphPipeline*              InMovieGraphPipeline;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   OutOuterName;                                      // 0x0008(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
	class FText                                   OutInnerName;                                      // 0x0018(0x0010)(Parm, OutParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieGraphBlueprintLibrary_GetCurrentSegmentName) == 0x000008, "Wrong alignment on MovieGraphBlueprintLibrary_GetCurrentSegmentName");
static_assert(sizeof(MovieGraphBlueprintLibrary_GetCurrentSegmentName) == 0x000028, "Wrong size on MovieGraphBlueprintLibrary_GetCurrentSegmentName");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetCurrentSegmentName, InMovieGraphPipeline) == 0x000000, "Member 'MovieGraphBlueprintLibrary_GetCurrentSegmentName::InMovieGraphPipeline' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetCurrentSegmentName, OutOuterName) == 0x000008, "Member 'MovieGraphBlueprintLibrary_GetCurrentSegmentName::OutOuterName' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetCurrentSegmentName, OutInnerName) == 0x000018, "Member 'MovieGraphBlueprintLibrary_GetCurrentSegmentName::OutInnerName' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.GetCurrentSegmentState
// 0x0010 (0x0010 - 0x0000)
struct MovieGraphBlueprintLibrary_GetCurrentSegmentState final
{
public:
	const class UMovieGraphPipeline*              InMovieGraphPipeline;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovieRenderShotState                         ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MovieGraphBlueprintLibrary_GetCurrentSegmentState) == 0x000008, "Wrong alignment on MovieGraphBlueprintLibrary_GetCurrentSegmentState");
static_assert(sizeof(MovieGraphBlueprintLibrary_GetCurrentSegmentState) == 0x000010, "Wrong size on MovieGraphBlueprintLibrary_GetCurrentSegmentState");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetCurrentSegmentState, InMovieGraphPipeline) == 0x000000, "Member 'MovieGraphBlueprintLibrary_GetCurrentSegmentState::InMovieGraphPipeline' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetCurrentSegmentState, ReturnValue) == 0x000008, "Member 'MovieGraphBlueprintLibrary_GetCurrentSegmentState::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.GetCurrentSegmentWorkMetrics
// 0x0030 (0x0030 - 0x0000)
struct MovieGraphBlueprintLibrary_GetCurrentSegmentWorkMetrics final
{
public:
	const class UMovieGraphPipeline*              InMovieGraphPipeline;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMoviePipelineSegmentWorkMetrics       ReturnValue;                                       // 0x0008(0x0028)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieGraphBlueprintLibrary_GetCurrentSegmentWorkMetrics) == 0x000008, "Wrong alignment on MovieGraphBlueprintLibrary_GetCurrentSegmentWorkMetrics");
static_assert(sizeof(MovieGraphBlueprintLibrary_GetCurrentSegmentWorkMetrics) == 0x000030, "Wrong size on MovieGraphBlueprintLibrary_GetCurrentSegmentWorkMetrics");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetCurrentSegmentWorkMetrics, InMovieGraphPipeline) == 0x000000, "Member 'MovieGraphBlueprintLibrary_GetCurrentSegmentWorkMetrics::InMovieGraphPipeline' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetCurrentSegmentWorkMetrics, ReturnValue) == 0x000008, "Member 'MovieGraphBlueprintLibrary_GetCurrentSegmentWorkMetrics::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.GetCurrentShotFrameNumber
// 0x0010 (0x0010 - 0x0000)
struct MovieGraphBlueprintLibrary_GetCurrentShotFrameNumber final
{
public:
	const class UMovieGraphPipeline*              InMovieGraphPipeline;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameNumber                           ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MovieGraphBlueprintLibrary_GetCurrentShotFrameNumber) == 0x000008, "Wrong alignment on MovieGraphBlueprintLibrary_GetCurrentShotFrameNumber");
static_assert(sizeof(MovieGraphBlueprintLibrary_GetCurrentShotFrameNumber) == 0x000010, "Wrong size on MovieGraphBlueprintLibrary_GetCurrentShotFrameNumber");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetCurrentShotFrameNumber, InMovieGraphPipeline) == 0x000000, "Member 'MovieGraphBlueprintLibrary_GetCurrentShotFrameNumber::InMovieGraphPipeline' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetCurrentShotFrameNumber, ReturnValue) == 0x000008, "Member 'MovieGraphBlueprintLibrary_GetCurrentShotFrameNumber::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.GetCurrentShotTimecode
// 0x0020 (0x0020 - 0x0000)
struct MovieGraphBlueprintLibrary_GetCurrentShotTimecode final
{
public:
	const class UMovieGraphPipeline*              InMovieGraphPipeline;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimecode                              ReturnValue;                                       // 0x0008(0x0014)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MovieGraphBlueprintLibrary_GetCurrentShotTimecode) == 0x000008, "Wrong alignment on MovieGraphBlueprintLibrary_GetCurrentShotTimecode");
static_assert(sizeof(MovieGraphBlueprintLibrary_GetCurrentShotTimecode) == 0x000020, "Wrong size on MovieGraphBlueprintLibrary_GetCurrentShotTimecode");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetCurrentShotTimecode, InMovieGraphPipeline) == 0x000000, "Member 'MovieGraphBlueprintLibrary_GetCurrentShotTimecode::InMovieGraphPipeline' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetCurrentShotTimecode, ReturnValue) == 0x000008, "Member 'MovieGraphBlueprintLibrary_GetCurrentShotTimecode::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.GetEffectiveFrameRate
// 0x0018 (0x0018 - 0x0000)
struct MovieGraphBlueprintLibrary_GetEffectiveFrameRate final
{
public:
	class UMovieGraphGlobalOutputSettingNode*     InNode;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameRate                             InDefaultRate;                                     // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameRate                             ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieGraphBlueprintLibrary_GetEffectiveFrameRate) == 0x000008, "Wrong alignment on MovieGraphBlueprintLibrary_GetEffectiveFrameRate");
static_assert(sizeof(MovieGraphBlueprintLibrary_GetEffectiveFrameRate) == 0x000018, "Wrong size on MovieGraphBlueprintLibrary_GetEffectiveFrameRate");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetEffectiveFrameRate, InNode) == 0x000000, "Member 'MovieGraphBlueprintLibrary_GetEffectiveFrameRate::InNode' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetEffectiveFrameRate, InDefaultRate) == 0x000008, "Member 'MovieGraphBlueprintLibrary_GetEffectiveFrameRate::InDefaultRate' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetEffectiveFrameRate, ReturnValue) == 0x000010, "Member 'MovieGraphBlueprintLibrary_GetEffectiveFrameRate::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.GetEffectiveOutputResolution
// 0x0010 (0x0010 - 0x0000)
struct MovieGraphBlueprintLibrary_GetEffectiveOutputResolution final
{
public:
	class UMovieGraphEvaluatedConfig*             InEvaluatedGraph;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieGraphBlueprintLibrary_GetEffectiveOutputResolution) == 0x000008, "Wrong alignment on MovieGraphBlueprintLibrary_GetEffectiveOutputResolution");
static_assert(sizeof(MovieGraphBlueprintLibrary_GetEffectiveOutputResolution) == 0x000010, "Wrong size on MovieGraphBlueprintLibrary_GetEffectiveOutputResolution");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetEffectiveOutputResolution, InEvaluatedGraph) == 0x000000, "Member 'MovieGraphBlueprintLibrary_GetEffectiveOutputResolution::InEvaluatedGraph' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetEffectiveOutputResolution, ReturnValue) == 0x000008, "Member 'MovieGraphBlueprintLibrary_GetEffectiveOutputResolution::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.GetEstimatedTimeRemaining
// 0x0018 (0x0018 - 0x0000)
struct MovieGraphBlueprintLibrary_GetEstimatedTimeRemaining final
{
public:
	const class UMovieGraphPipeline*              InMovieGraphPipeline;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimespan                              OutEstimate;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MovieGraphBlueprintLibrary_GetEstimatedTimeRemaining) == 0x000008, "Wrong alignment on MovieGraphBlueprintLibrary_GetEstimatedTimeRemaining");
static_assert(sizeof(MovieGraphBlueprintLibrary_GetEstimatedTimeRemaining) == 0x000018, "Wrong size on MovieGraphBlueprintLibrary_GetEstimatedTimeRemaining");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetEstimatedTimeRemaining, InMovieGraphPipeline) == 0x000000, "Member 'MovieGraphBlueprintLibrary_GetEstimatedTimeRemaining::InMovieGraphPipeline' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetEstimatedTimeRemaining, OutEstimate) == 0x000008, "Member 'MovieGraphBlueprintLibrary_GetEstimatedTimeRemaining::OutEstimate' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetEstimatedTimeRemaining, ReturnValue) == 0x000010, "Member 'MovieGraphBlueprintLibrary_GetEstimatedTimeRemaining::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.GetJobAuthor
// 0x0018 (0x0018 - 0x0000)
struct MovieGraphBlueprintLibrary_GetJobAuthor final
{
public:
	const class UMovieGraphPipeline*              InMovieGraphPipeline;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieGraphBlueprintLibrary_GetJobAuthor) == 0x000008, "Wrong alignment on MovieGraphBlueprintLibrary_GetJobAuthor");
static_assert(sizeof(MovieGraphBlueprintLibrary_GetJobAuthor) == 0x000018, "Wrong size on MovieGraphBlueprintLibrary_GetJobAuthor");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetJobAuthor, InMovieGraphPipeline) == 0x000000, "Member 'MovieGraphBlueprintLibrary_GetJobAuthor::InMovieGraphPipeline' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetJobAuthor, ReturnValue) == 0x000008, "Member 'MovieGraphBlueprintLibrary_GetJobAuthor::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.GetJobInitializationTime
// 0x0010 (0x0010 - 0x0000)
struct MovieGraphBlueprintLibrary_GetJobInitializationTime final
{
public:
	const class UMovieGraphPipeline*              InMovieGraphPipeline;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                              ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieGraphBlueprintLibrary_GetJobInitializationTime) == 0x000008, "Wrong alignment on MovieGraphBlueprintLibrary_GetJobInitializationTime");
static_assert(sizeof(MovieGraphBlueprintLibrary_GetJobInitializationTime) == 0x000010, "Wrong size on MovieGraphBlueprintLibrary_GetJobInitializationTime");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetJobInitializationTime, InMovieGraphPipeline) == 0x000000, "Member 'MovieGraphBlueprintLibrary_GetJobInitializationTime::InMovieGraphPipeline' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetJobInitializationTime, ReturnValue) == 0x000008, "Member 'MovieGraphBlueprintLibrary_GetJobInitializationTime::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.GetJobName
// 0x0018 (0x0018 - 0x0000)
struct MovieGraphBlueprintLibrary_GetJobName final
{
public:
	const class UMovieGraphPipeline*              InMovieGraphPipeline;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieGraphBlueprintLibrary_GetJobName) == 0x000008, "Wrong alignment on MovieGraphBlueprintLibrary_GetJobName");
static_assert(sizeof(MovieGraphBlueprintLibrary_GetJobName) == 0x000018, "Wrong size on MovieGraphBlueprintLibrary_GetJobName");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetJobName, InMovieGraphPipeline) == 0x000000, "Member 'MovieGraphBlueprintLibrary_GetJobName::InMovieGraphPipeline' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetJobName, ReturnValue) == 0x000008, "Member 'MovieGraphBlueprintLibrary_GetJobName::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.GetOverallOutputFrames
// 0x0010 (0x0010 - 0x0000)
struct MovieGraphBlueprintLibrary_GetOverallOutputFrames final
{
public:
	const class UMovieGraphPipeline*              InMovieGraphPipeline;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutCurrentIndex;                                   // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutTotalCount;                                     // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieGraphBlueprintLibrary_GetOverallOutputFrames) == 0x000008, "Wrong alignment on MovieGraphBlueprintLibrary_GetOverallOutputFrames");
static_assert(sizeof(MovieGraphBlueprintLibrary_GetOverallOutputFrames) == 0x000010, "Wrong size on MovieGraphBlueprintLibrary_GetOverallOutputFrames");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetOverallOutputFrames, InMovieGraphPipeline) == 0x000000, "Member 'MovieGraphBlueprintLibrary_GetOverallOutputFrames::InMovieGraphPipeline' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetOverallOutputFrames, OutCurrentIndex) == 0x000008, "Member 'MovieGraphBlueprintLibrary_GetOverallOutputFrames::OutCurrentIndex' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetOverallOutputFrames, OutTotalCount) == 0x00000C, "Member 'MovieGraphBlueprintLibrary_GetOverallOutputFrames::OutTotalCount' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.GetOverallSegmentCounts
// 0x0010 (0x0010 - 0x0000)
struct MovieGraphBlueprintLibrary_GetOverallSegmentCounts final
{
public:
	const class UMovieGraphPipeline*              InMovieGraphPipeline;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutCurrentIndex;                                   // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutTotalCount;                                     // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieGraphBlueprintLibrary_GetOverallSegmentCounts) == 0x000008, "Wrong alignment on MovieGraphBlueprintLibrary_GetOverallSegmentCounts");
static_assert(sizeof(MovieGraphBlueprintLibrary_GetOverallSegmentCounts) == 0x000010, "Wrong size on MovieGraphBlueprintLibrary_GetOverallSegmentCounts");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetOverallSegmentCounts, InMovieGraphPipeline) == 0x000000, "Member 'MovieGraphBlueprintLibrary_GetOverallSegmentCounts::InMovieGraphPipeline' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetOverallSegmentCounts, OutCurrentIndex) == 0x000008, "Member 'MovieGraphBlueprintLibrary_GetOverallSegmentCounts::OutCurrentIndex' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetOverallSegmentCounts, OutTotalCount) == 0x00000C, "Member 'MovieGraphBlueprintLibrary_GetOverallSegmentCounts::OutTotalCount' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.GetPipelineState
// 0x0010 (0x0010 - 0x0000)
struct MovieGraphBlueprintLibrary_GetPipelineState final
{
public:
	const class UMovieGraphPipeline*              InMovieGraphPipeline;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMovieRenderPipelineState                     ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MovieGraphBlueprintLibrary_GetPipelineState) == 0x000008, "Wrong alignment on MovieGraphBlueprintLibrary_GetPipelineState");
static_assert(sizeof(MovieGraphBlueprintLibrary_GetPipelineState) == 0x000010, "Wrong size on MovieGraphBlueprintLibrary_GetPipelineState");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetPipelineState, InMovieGraphPipeline) == 0x000000, "Member 'MovieGraphBlueprintLibrary_GetPipelineState::InMovieGraphPipeline' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetPipelineState, ReturnValue) == 0x000008, "Member 'MovieGraphBlueprintLibrary_GetPipelineState::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.GetRootFrameNumber
// 0x0010 (0x0010 - 0x0000)
struct MovieGraphBlueprintLibrary_GetRootFrameNumber final
{
public:
	const class UMovieGraphPipeline*              InMovieGraphPipeline;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameNumber                           ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MovieGraphBlueprintLibrary_GetRootFrameNumber) == 0x000008, "Wrong alignment on MovieGraphBlueprintLibrary_GetRootFrameNumber");
static_assert(sizeof(MovieGraphBlueprintLibrary_GetRootFrameNumber) == 0x000010, "Wrong size on MovieGraphBlueprintLibrary_GetRootFrameNumber");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetRootFrameNumber, InMovieGraphPipeline) == 0x000000, "Member 'MovieGraphBlueprintLibrary_GetRootFrameNumber::InMovieGraphPipeline' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetRootFrameNumber, ReturnValue) == 0x000008, "Member 'MovieGraphBlueprintLibrary_GetRootFrameNumber::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.GetRootTimecode
// 0x0020 (0x0020 - 0x0000)
struct MovieGraphBlueprintLibrary_GetRootTimecode final
{
public:
	const class UMovieGraphPipeline*              InMovieGraphPipeline;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTimecode                              ReturnValue;                                       // 0x0008(0x0014)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MovieGraphBlueprintLibrary_GetRootTimecode) == 0x000008, "Wrong alignment on MovieGraphBlueprintLibrary_GetRootTimecode");
static_assert(sizeof(MovieGraphBlueprintLibrary_GetRootTimecode) == 0x000020, "Wrong size on MovieGraphBlueprintLibrary_GetRootTimecode");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetRootTimecode, InMovieGraphPipeline) == 0x000000, "Member 'MovieGraphBlueprintLibrary_GetRootTimecode::InMovieGraphPipeline' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_GetRootTimecode, ReturnValue) == 0x000008, "Member 'MovieGraphBlueprintLibrary_GetRootTimecode::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.IsNamedResolutionValid
// 0x000C (0x000C - 0x0000)
struct MovieGraphBlueprintLibrary_IsNamedResolutionValid final
{
public:
	class FName                                   InResolutionProfileName;                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MovieGraphBlueprintLibrary_IsNamedResolutionValid) == 0x000004, "Wrong alignment on MovieGraphBlueprintLibrary_IsNamedResolutionValid");
static_assert(sizeof(MovieGraphBlueprintLibrary_IsNamedResolutionValid) == 0x00000C, "Wrong size on MovieGraphBlueprintLibrary_IsNamedResolutionValid");
static_assert(offsetof(MovieGraphBlueprintLibrary_IsNamedResolutionValid, InResolutionProfileName) == 0x000000, "Member 'MovieGraphBlueprintLibrary_IsNamedResolutionValid::InResolutionProfileName' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_IsNamedResolutionValid, ReturnValue) == 0x000008, "Member 'MovieGraphBlueprintLibrary_IsNamedResolutionValid::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.NamedResolutionFromProfile
// 0x0028 (0x0028 - 0x0000)
struct MovieGraphBlueprintLibrary_NamedResolutionFromProfile final
{
public:
	class FName                                   InResolutionProfileName;                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieGraphNamedResolution             ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieGraphBlueprintLibrary_NamedResolutionFromProfile) == 0x000008, "Wrong alignment on MovieGraphBlueprintLibrary_NamedResolutionFromProfile");
static_assert(sizeof(MovieGraphBlueprintLibrary_NamedResolutionFromProfile) == 0x000028, "Wrong size on MovieGraphBlueprintLibrary_NamedResolutionFromProfile");
static_assert(offsetof(MovieGraphBlueprintLibrary_NamedResolutionFromProfile, InResolutionProfileName) == 0x000000, "Member 'MovieGraphBlueprintLibrary_NamedResolutionFromProfile::InResolutionProfileName' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_NamedResolutionFromProfile, ReturnValue) == 0x000008, "Member 'MovieGraphBlueprintLibrary_NamedResolutionFromProfile::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.NamedResolutionFromSize
// 0x0028 (0x0028 - 0x0000)
struct MovieGraphBlueprintLibrary_NamedResolutionFromSize final
{
public:
	int32                                         InResX;                                            // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InResY;                                            // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieGraphNamedResolution             ReturnValue;                                       // 0x0008(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieGraphBlueprintLibrary_NamedResolutionFromSize) == 0x000008, "Wrong alignment on MovieGraphBlueprintLibrary_NamedResolutionFromSize");
static_assert(sizeof(MovieGraphBlueprintLibrary_NamedResolutionFromSize) == 0x000028, "Wrong size on MovieGraphBlueprintLibrary_NamedResolutionFromSize");
static_assert(offsetof(MovieGraphBlueprintLibrary_NamedResolutionFromSize, InResX) == 0x000000, "Member 'MovieGraphBlueprintLibrary_NamedResolutionFromSize::InResX' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_NamedResolutionFromSize, InResY) == 0x000004, "Member 'MovieGraphBlueprintLibrary_NamedResolutionFromSize::InResY' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_NamedResolutionFromSize, ReturnValue) == 0x000008, "Member 'MovieGraphBlueprintLibrary_NamedResolutionFromSize::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.ResolveFilenameFormatArguments
// 0x0218 (0x0218 - 0x0000)
struct MovieGraphBlueprintLibrary_ResolveFilenameFormatArguments final
{
public:
	class FString                                 InFormatString;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieGraphFilenameResolveParams       InParams;                                          // 0x0010(0x0158)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FMovieGraphResolveArgs                 OutMergedFormatArgs;                               // 0x0168(0x00A0)(Parm, OutParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0208(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieGraphBlueprintLibrary_ResolveFilenameFormatArguments) == 0x000008, "Wrong alignment on MovieGraphBlueprintLibrary_ResolveFilenameFormatArguments");
static_assert(sizeof(MovieGraphBlueprintLibrary_ResolveFilenameFormatArguments) == 0x000218, "Wrong size on MovieGraphBlueprintLibrary_ResolveFilenameFormatArguments");
static_assert(offsetof(MovieGraphBlueprintLibrary_ResolveFilenameFormatArguments, InFormatString) == 0x000000, "Member 'MovieGraphBlueprintLibrary_ResolveFilenameFormatArguments::InFormatString' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_ResolveFilenameFormatArguments, InParams) == 0x000010, "Member 'MovieGraphBlueprintLibrary_ResolveFilenameFormatArguments::InParams' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_ResolveFilenameFormatArguments, OutMergedFormatArgs) == 0x000168, "Member 'MovieGraphBlueprintLibrary_ResolveFilenameFormatArguments::OutMergedFormatArgs' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_ResolveFilenameFormatArguments, ReturnValue) == 0x000208, "Member 'MovieGraphBlueprintLibrary_ResolveFilenameFormatArguments::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBlueprintLibrary.ResolveVersionNumber
// 0x0160 (0x0160 - 0x0000)
struct MovieGraphBlueprintLibrary_ResolveVersionNumber final
{
public:
	struct FMovieGraphFilenameResolveParams       InParams;                                          // 0x0000(0x0158)(Parm, NativeAccessSpecifierPublic)
	bool                                          bGetNextVersion;                                   // 0x0158(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x015C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieGraphBlueprintLibrary_ResolveVersionNumber) == 0x000008, "Wrong alignment on MovieGraphBlueprintLibrary_ResolveVersionNumber");
static_assert(sizeof(MovieGraphBlueprintLibrary_ResolveVersionNumber) == 0x000160, "Wrong size on MovieGraphBlueprintLibrary_ResolveVersionNumber");
static_assert(offsetof(MovieGraphBlueprintLibrary_ResolveVersionNumber, InParams) == 0x000000, "Member 'MovieGraphBlueprintLibrary_ResolveVersionNumber::InParams' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_ResolveVersionNumber, bGetNextVersion) == 0x000158, "Member 'MovieGraphBlueprintLibrary_ResolveVersionNumber::bGetNextVersion' has a wrong offset!");
static_assert(offsetof(MovieGraphBlueprintLibrary_ResolveVersionNumber, ReturnValue) == 0x00015C, "Member 'MovieGraphBlueprintLibrary_ResolveVersionNumber::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphBurnInWidget.UpdateForGraph
// 0x0010 (0x0010 - 0x0000)
struct MovieGraphBurnInWidget_UpdateForGraph final
{
public:
	class UMovieGraphPipeline*                    InGraphPipeline;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMovieGraphEvaluatedConfig*             InEvaluatedConfig;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieGraphBurnInWidget_UpdateForGraph) == 0x000008, "Wrong alignment on MovieGraphBurnInWidget_UpdateForGraph");
static_assert(sizeof(MovieGraphBurnInWidget_UpdateForGraph) == 0x000010, "Wrong size on MovieGraphBurnInWidget_UpdateForGraph");
static_assert(offsetof(MovieGraphBurnInWidget_UpdateForGraph, InGraphPipeline) == 0x000000, "Member 'MovieGraphBurnInWidget_UpdateForGraph::InGraphPipeline' has a wrong offset!");
static_assert(offsetof(MovieGraphBurnInWidget_UpdateForGraph, InEvaluatedConfig) == 0x000008, "Member 'MovieGraphBurnInWidget_UpdateForGraph::InEvaluatedConfig' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphValueContainer.GetValueSerializedString
// 0x0010 (0x0010 - 0x0000)
struct MovieGraphValueContainer_GetValueSerializedString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieGraphValueContainer_GetValueSerializedString) == 0x000008, "Wrong alignment on MovieGraphValueContainer_GetValueSerializedString");
static_assert(sizeof(MovieGraphValueContainer_GetValueSerializedString) == 0x000010, "Wrong size on MovieGraphValueContainer_GetValueSerializedString");
static_assert(offsetof(MovieGraphValueContainer_GetValueSerializedString, ReturnValue) == 0x000000, "Member 'MovieGraphValueContainer_GetValueSerializedString::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphValueContainer.SetValueBool
// 0x0002 (0x0002 - 0x0000)
struct MovieGraphValueContainer_SetValueBool final
{
public:
	bool                                          bInValue;                                          // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieGraphValueContainer_SetValueBool) == 0x000001, "Wrong alignment on MovieGraphValueContainer_SetValueBool");
static_assert(sizeof(MovieGraphValueContainer_SetValueBool) == 0x000002, "Wrong size on MovieGraphValueContainer_SetValueBool");
static_assert(offsetof(MovieGraphValueContainer_SetValueBool, bInValue) == 0x000000, "Member 'MovieGraphValueContainer_SetValueBool::bInValue' has a wrong offset!");
static_assert(offsetof(MovieGraphValueContainer_SetValueBool, ReturnValue) == 0x000001, "Member 'MovieGraphValueContainer_SetValueBool::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphValueContainer.SetValueByte
// 0x0002 (0x0002 - 0x0000)
struct MovieGraphValueContainer_SetValueByte final
{
public:
	uint8                                         InValue;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieGraphValueContainer_SetValueByte) == 0x000001, "Wrong alignment on MovieGraphValueContainer_SetValueByte");
static_assert(sizeof(MovieGraphValueContainer_SetValueByte) == 0x000002, "Wrong size on MovieGraphValueContainer_SetValueByte");
static_assert(offsetof(MovieGraphValueContainer_SetValueByte, InValue) == 0x000000, "Member 'MovieGraphValueContainer_SetValueByte::InValue' has a wrong offset!");
static_assert(offsetof(MovieGraphValueContainer_SetValueByte, ReturnValue) == 0x000001, "Member 'MovieGraphValueContainer_SetValueByte::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphValueContainer.SetValueClass
// 0x0010 (0x0010 - 0x0000)
struct MovieGraphValueContainer_SetValueClass final
{
public:
	class UClass*                                 InValue;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MovieGraphValueContainer_SetValueClass) == 0x000008, "Wrong alignment on MovieGraphValueContainer_SetValueClass");
static_assert(sizeof(MovieGraphValueContainer_SetValueClass) == 0x000010, "Wrong size on MovieGraphValueContainer_SetValueClass");
static_assert(offsetof(MovieGraphValueContainer_SetValueClass, InValue) == 0x000000, "Member 'MovieGraphValueContainer_SetValueClass::InValue' has a wrong offset!");
static_assert(offsetof(MovieGraphValueContainer_SetValueClass, ReturnValue) == 0x000008, "Member 'MovieGraphValueContainer_SetValueClass::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphValueContainer.SetValueContainerType
// 0x0001 (0x0001 - 0x0000)
struct MovieGraphValueContainer_SetValueContainerType final
{
public:
	EMovieGraphContainerType                      ContainerType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(MovieGraphValueContainer_SetValueContainerType) == 0x000001, "Wrong alignment on MovieGraphValueContainer_SetValueContainerType");
static_assert(sizeof(MovieGraphValueContainer_SetValueContainerType) == 0x000001, "Wrong size on MovieGraphValueContainer_SetValueContainerType");
static_assert(offsetof(MovieGraphValueContainer_SetValueContainerType, ContainerType) == 0x000000, "Member 'MovieGraphValueContainer_SetValueContainerType::ContainerType' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphValueContainer.SetValueDouble
// 0x0010 (0x0010 - 0x0000)
struct MovieGraphValueContainer_SetValueDouble final
{
public:
	double                                        InValue;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MovieGraphValueContainer_SetValueDouble) == 0x000008, "Wrong alignment on MovieGraphValueContainer_SetValueDouble");
static_assert(sizeof(MovieGraphValueContainer_SetValueDouble) == 0x000010, "Wrong size on MovieGraphValueContainer_SetValueDouble");
static_assert(offsetof(MovieGraphValueContainer_SetValueDouble, InValue) == 0x000000, "Member 'MovieGraphValueContainer_SetValueDouble::InValue' has a wrong offset!");
static_assert(offsetof(MovieGraphValueContainer_SetValueDouble, ReturnValue) == 0x000008, "Member 'MovieGraphValueContainer_SetValueDouble::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphValueContainer.SetValueEnum
// 0x0018 (0x0018 - 0x0000)
struct MovieGraphValueContainer_SetValueEnum final
{
public:
	uint8                                         InValue;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UEnum*                            Enum;                                              // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MovieGraphValueContainer_SetValueEnum) == 0x000008, "Wrong alignment on MovieGraphValueContainer_SetValueEnum");
static_assert(sizeof(MovieGraphValueContainer_SetValueEnum) == 0x000018, "Wrong size on MovieGraphValueContainer_SetValueEnum");
static_assert(offsetof(MovieGraphValueContainer_SetValueEnum, InValue) == 0x000000, "Member 'MovieGraphValueContainer_SetValueEnum::InValue' has a wrong offset!");
static_assert(offsetof(MovieGraphValueContainer_SetValueEnum, Enum) == 0x000008, "Member 'MovieGraphValueContainer_SetValueEnum::Enum' has a wrong offset!");
static_assert(offsetof(MovieGraphValueContainer_SetValueEnum, ReturnValue) == 0x000010, "Member 'MovieGraphValueContainer_SetValueEnum::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphValueContainer.SetValueFloat
// 0x0008 (0x0008 - 0x0000)
struct MovieGraphValueContainer_SetValueFloat final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MovieGraphValueContainer_SetValueFloat) == 0x000004, "Wrong alignment on MovieGraphValueContainer_SetValueFloat");
static_assert(sizeof(MovieGraphValueContainer_SetValueFloat) == 0x000008, "Wrong size on MovieGraphValueContainer_SetValueFloat");
static_assert(offsetof(MovieGraphValueContainer_SetValueFloat, InValue) == 0x000000, "Member 'MovieGraphValueContainer_SetValueFloat::InValue' has a wrong offset!");
static_assert(offsetof(MovieGraphValueContainer_SetValueFloat, ReturnValue) == 0x000004, "Member 'MovieGraphValueContainer_SetValueFloat::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphValueContainer.SetValueInt32
// 0x0008 (0x0008 - 0x0000)
struct MovieGraphValueContainer_SetValueInt32 final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MovieGraphValueContainer_SetValueInt32) == 0x000004, "Wrong alignment on MovieGraphValueContainer_SetValueInt32");
static_assert(sizeof(MovieGraphValueContainer_SetValueInt32) == 0x000008, "Wrong size on MovieGraphValueContainer_SetValueInt32");
static_assert(offsetof(MovieGraphValueContainer_SetValueInt32, InValue) == 0x000000, "Member 'MovieGraphValueContainer_SetValueInt32::InValue' has a wrong offset!");
static_assert(offsetof(MovieGraphValueContainer_SetValueInt32, ReturnValue) == 0x000004, "Member 'MovieGraphValueContainer_SetValueInt32::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphValueContainer.SetValueInt64
// 0x0010 (0x0010 - 0x0000)
struct MovieGraphValueContainer_SetValueInt64 final
{
public:
	int64                                         InValue;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(MovieGraphValueContainer_SetValueInt64) == 0x000008, "Wrong alignment on MovieGraphValueContainer_SetValueInt64");
static_assert(sizeof(MovieGraphValueContainer_SetValueInt64) == 0x000010, "Wrong size on MovieGraphValueContainer_SetValueInt64");
static_assert(offsetof(MovieGraphValueContainer_SetValueInt64, InValue) == 0x000000, "Member 'MovieGraphValueContainer_SetValueInt64::InValue' has a wrong offset!");
static_assert(offsetof(MovieGraphValueContainer_SetValueInt64, ReturnValue) == 0x000008, "Member 'MovieGraphValueContainer_SetValueInt64::ReturnValue' has a wrong offset!");

// Function MovieRenderPipelineCore.MovieGraphValueContainer.SetValueName
