#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieRenderPipelineCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "StructUtils_structs.hpp"
#include "UMG_classes.hpp"
#include "MovieRenderPipelineCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "OpenColorIO_structs.hpp"


namespace SDK
{

// Class MovieRenderPipelineCore.MovieGraphNode
// 0x0070 (0x0098 - 0x0028)
class UMovieGraphNode : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMovieGraphPin*>                 InputPins;                                         // 0x0040(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UMovieGraphPin*>                 OutputPins;                                        // 0x0050(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	struct FInstancedPropertyBag                  DynamicProperties;                                 // 0x0060(0x0010)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<struct FMovieGraphPropertyInfo>        ExposedPropertyInfo;                               // 0x0070(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         bIsDisabled : 1;                                   // 0x0080(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  Guid;                                              // 0x0084(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void TogglePromotePropertyToPin(const class FName& PropertyName);

	TArray<struct FMovieGraphPropertyInfo> GetExposedProperties() const;
	class UMovieGraphPin* GetInputPin(const class FName& InPinLabel, const EMovieGraphPinQueryRequirement PinRequirement) const;
	class UMovieGraphPin* GetOutputPin(const class FName& InPinLabel) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphNode">();
	}
	static class UMovieGraphNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphNode>();
	}
};
static_assert(alignof(UMovieGraphNode) == 0x000008, "Wrong alignment on UMovieGraphNode");
static_assert(sizeof(UMovieGraphNode) == 0x000098, "Wrong size on UMovieGraphNode");
static_assert(offsetof(UMovieGraphNode, InputPins) == 0x000040, "Member 'UMovieGraphNode::InputPins' has a wrong offset!");
static_assert(offsetof(UMovieGraphNode, OutputPins) == 0x000050, "Member 'UMovieGraphNode::OutputPins' has a wrong offset!");
static_assert(offsetof(UMovieGraphNode, DynamicProperties) == 0x000060, "Member 'UMovieGraphNode::DynamicProperties' has a wrong offset!");
static_assert(offsetof(UMovieGraphNode, ExposedPropertyInfo) == 0x000070, "Member 'UMovieGraphNode::ExposedPropertyInfo' has a wrong offset!");
static_assert(offsetof(UMovieGraphNode, Guid) == 0x000084, "Member 'UMovieGraphNode::Guid' has a wrong offset!");

// Class MovieRenderPipelineCore.MovieGraphSettingNode
// 0x0000 (0x0098 - 0x0098)
class UMovieGraphSettingNode : public UMovieGraphNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphSettingNode">();
	}
	static class UMovieGraphSettingNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphSettingNode>();
	}
};
static_assert(alignof(UMovieGraphSettingNode) == 0x000008, "Wrong alignment on UMovieGraphSettingNode");
static_assert(sizeof(UMovieGraphSettingNode) == 0x000098, "Wrong size on UMovieGraphSettingNode");

// Class MovieRenderPipelineCore.MovieGraphApplyCVarPresetNode
// 0x0018 (0x00B0 - 0x0098)
class UMovieGraphApplyCVarPresetNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_ConsoleVariablePreset : 1;               // 0x0098(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IMovieSceneConsoleVariableTrackInterface> ConsoleVariablePreset;          // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphApplyCVarPresetNode">();
	}
	static class UMovieGraphApplyCVarPresetNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphApplyCVarPresetNode>();
	}
};
static_assert(alignof(UMovieGraphApplyCVarPresetNode) == 0x000008, "Wrong alignment on UMovieGraphApplyCVarPresetNode");
static_assert(sizeof(UMovieGraphApplyCVarPresetNode) == 0x0000B0, "Wrong size on UMovieGraphApplyCVarPresetNode");
static_assert(offsetof(UMovieGraphApplyCVarPresetNode, ConsoleVariablePreset) == 0x0000A0, "Member 'UMovieGraphApplyCVarPresetNode::ConsoleVariablePreset' has a wrong offset!");

// Class MovieRenderPipelineCore.MovieGraphFileOutputNode
// 0x0018 (0x00B0 - 0x0098)
class UMovieGraphFileOutputNode : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_FileNameFormat : 1;                      // 0x0098(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FileNameFormat;                                    // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphFileOutputNode">();
	}
	static class UMovieGraphFileOutputNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphFileOutputNode>();
	}
};
static_assert(alignof(UMovieGraphFileOutputNode) == 0x000008, "Wrong alignment on UMovieGraphFileOutputNode");
static_assert(sizeof(UMovieGraphFileOutputNode) == 0x0000B0, "Wrong size on UMovieGraphFileOutputNode");
static_assert(offsetof(UMovieGraphFileOutputNode, FileNameFormat) == 0x0000A0, "Member 'UMovieGraphFileOutputNode::FileNameFormat' has a wrong offset!");

// Class MovieRenderPipelineCore.MovieGraphAudioOutputNode
// 0x0010 (0x00C0 - 0x00B0)
class UMovieGraphAudioOutputNode final : public UMovieGraphFileOutputNode
{
public:
	uint8                                         Pad_B0[0x10];                                      // 0x00B0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphAudioOutputNode">();
	}
	static class UMovieGraphAudioOutputNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphAudioOutputNode>();
	}
};
static_assert(alignof(UMovieGraphAudioOutputNode) == 0x000008, "Wrong alignment on UMovieGraphAudioOutputNode");
static_assert(sizeof(UMovieGraphAudioOutputNode) == 0x0000C0, "Wrong size on UMovieGraphAudioOutputNode");

// Class MovieRenderPipelineCore.MovieGraphBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UMovieGraphBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static float GetCompletionPercentage(const class UMovieGraphPipeline* InPipeline);
	static float GetCurrentAperture(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static class UCineCameraComponent* GetCurrentCineCamera(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static float GetCurrentFocalLength(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static float GetCurrentFocusDistance(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static void GetCurrentSegmentName(const class UMovieGraphPipeline* InMovieGraphPipeline, class FText* OutOuterName, class FText* OutInnerName);
	static EMovieRenderShotState GetCurrentSegmentState(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FMoviePipelineSegmentWorkMetrics GetCurrentSegmentWorkMetrics(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FFrameNumber GetCurrentShotFrameNumber(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FTimecode GetCurrentShotTimecode(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FFrameRate GetEffectiveFrameRate(class UMovieGraphGlobalOutputSettingNode* InNode, const struct FFrameRate& InDefaultRate);
	static struct FIntPoint GetEffectiveOutputResolution(class UMovieGraphEvaluatedConfig* InEvaluatedGraph);
	static bool GetEstimatedTimeRemaining(const class UMovieGraphPipeline* InMovieGraphPipeline, struct FTimespan* OutEstimate);
	static class FText GetJobAuthor(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FDateTime GetJobInitializationTime(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static class FText GetJobName(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static void GetOverallOutputFrames(const class UMovieGraphPipeline* InMovieGraphPipeline, int32* OutCurrentIndex, int32* OutTotalCount);
	static void GetOverallSegmentCounts(const class UMovieGraphPipeline* InMovieGraphPipeline, int32* OutCurrentIndex, int32* OutTotalCount);
	static EMovieRenderPipelineState GetPipelineState(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FFrameNumber GetRootFrameNumber(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static struct FTimecode GetRootTimecode(const class UMovieGraphPipeline* InMovieGraphPipeline);
	static bool IsNamedResolutionValid(const class FName& InResolutionProfileName);
	static struct FMovieGraphNamedResolution NamedResolutionFromProfile(const class FName& InResolutionProfileName);
	static struct FMovieGraphNamedResolution NamedResolutionFromSize(const int32 InResX, const int32 InResY);
	static class FString ResolveFilenameFormatArguments(const class FString& InFormatString, const struct FMovieGraphFilenameResolveParams& InParams, struct FMovieGraphResolveArgs* OutMergedFormatArgs);
	static int32 ResolveVersionNumber(const struct FMovieGraphFilenameResolveParams& InParams, const bool bGetNextVersion);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphBlueprintLibrary">();
	}
	static class UMovieGraphBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphBlueprintLibrary>();
	}
};
static_assert(alignof(UMovieGraphBlueprintLibrary) == 0x000008, "Wrong alignment on UMovieGraphBlueprintLibrary");
static_assert(sizeof(UMovieGraphBlueprintLibrary) == 0x000028, "Wrong size on UMovieGraphBlueprintLibrary");

// Class MovieRenderPipelineCore.MovieGraphBranchNode
// 0x0000 (0x0098 - 0x0098)
class UMovieGraphBranchNode final : public UMovieGraphNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphBranchNode">();
	}
	static class UMovieGraphBranchNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphBranchNode>();
	}
};
static_assert(alignof(UMovieGraphBranchNode) == 0x000008, "Wrong alignment on UMovieGraphBranchNode");
static_assert(sizeof(UMovieGraphBranchNode) == 0x000098, "Wrong size on UMovieGraphBranchNode");

// Class MovieRenderPipelineCore.MovieGraphRenderPassNode
// 0x0000 (0x0098 - 0x0098)
class UMovieGraphRenderPassNode : public UMovieGraphSettingNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphRenderPassNode">();
	}
	static class UMovieGraphRenderPassNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphRenderPassNode>();
	}
};
static_assert(alignof(UMovieGraphRenderPassNode) == 0x000008, "Wrong alignment on UMovieGraphRenderPassNode");
static_assert(sizeof(UMovieGraphRenderPassNode) == 0x000098, "Wrong size on UMovieGraphRenderPassNode");

// Class MovieRenderPipelineCore.MovieGraphWidgetRendererBaseNode
// 0x0078 (0x0110 - 0x0098)
class UMovieGraphWidgetRendererBaseNode : public UMovieGraphRenderPassNode
{
public:
	uint8                                         bOverride_bCompositeOntoFinalImage : 1;            // 0x0098(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	bool                                          bCompositeOntoFinalImage;                          // 0x0099(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9A[0x76];                                      // 0x009A(0x0076)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphWidgetRendererBaseNode">();
	}
	static class UMovieGraphWidgetRendererBaseNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphWidgetRendererBaseNode>();
	}
};
static_assert(alignof(UMovieGraphWidgetRendererBaseNode) == 0x000008, "Wrong alignment on UMovieGraphWidgetRendererBaseNode");
static_assert(sizeof(UMovieGraphWidgetRendererBaseNode) == 0x000110, "Wrong size on UMovieGraphWidgetRendererBaseNode");
static_assert(offsetof(UMovieGraphWidgetRendererBaseNode, bCompositeOntoFinalImage) == 0x000099, "Member 'UMovieGraphWidgetRendererBaseNode::bCompositeOntoFinalImage' has a wrong offset!");

// Class MovieRenderPipelineCore.MovieGraphBurnInNode
// 0x0078 (0x0188 - 0x0110)
class UMovieGraphBurnInNode final : public UMovieGraphWidgetRendererBaseNode
{
public:
	uint8                                         bOverride_BurnInClass : 1;                         // 0x0110(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         BurnInClass;                                       // 0x0118(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class UClass*, class UMovieGraphBurnInWidget*> BurnInWidgetInstances;                       // 0x0138(0x0050)(ExportObject, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphBurnInNode">();
	}
	static class UMovieGraphBurnInNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphBurnInNode>();
	}
};
static_assert(alignof(UMovieGraphBurnInNode) == 0x000008, "Wrong alignment on UMovieGraphBurnInNode");
static_assert(sizeof(UMovieGraphBurnInNode) == 0x000188, "Wrong size on UMovieGraphBurnInNode");
static_assert(offsetof(UMovieGraphBurnInNode, BurnInClass) == 0x000118, "Member 'UMovieGraphBurnInNode::BurnInClass' has a wrong offset!");
static_assert(offsetof(UMovieGraphBurnInNode, BurnInWidgetInstances) == 0x000138, "Member 'UMovieGraphBurnInNode::BurnInWidgetInstances' has a wrong offset!");

// Class MovieRenderPipelineCore.MovieGraphBurnInWidget
// 0x0000 (0x02E0 - 0x02E0)
class UMovieGraphBurnInWidget final : public UUserWidget
{
public:
	void UpdateForGraph(class UMovieGraphPipeline* InGraphPipeline, class UMovieGraphEvaluatedConfig* InEvaluatedConfig);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphBurnInWidget">();
	}
	static class UMovieGraphBurnInWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphBurnInWidget>();
	}
};
static_assert(alignof(UMovieGraphBurnInWidget) == 0x000008, "Wrong alignment on UMovieGraphBurnInWidget");
static_assert(sizeof(UMovieGraphBurnInWidget) == 0x0002E0, "Wrong size on UMovieGraphBurnInWidget");

// Class MovieRenderPipelineCore.MovieGraphCameraSettingNode
// 0x0008 (0x00A0 - 0x0098)
class UMovieGraphCameraSettingNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_ShutterTiming : 1;                       // 0x0098(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_OverscanPercentage : 1;                  // 0x0098(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	EMoviePipelineShutterTiming                   ShutterTiming;                                     // 0x0099(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OverscanPercentage;                                // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphCameraSettingNode">();
	}
	static class UMovieGraphCameraSettingNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphCameraSettingNode>();
	}
};
static_assert(alignof(UMovieGraphCameraSettingNode) == 0x000008, "Wrong alignment on UMovieGraphCameraSettingNode");
static_assert(sizeof(UMovieGraphCameraSettingNode) == 0x0000A0, "Wrong size on UMovieGraphCameraSettingNode");
static_assert(offsetof(UMovieGraphCameraSettingNode, ShutterTiming) == 0x000099, "Member 'UMovieGraphCameraSettingNode::ShutterTiming' has a wrong offset!");
static_assert(offsetof(UMovieGraphCameraSettingNode, OverscanPercentage) == 0x00009C, "Member 'UMovieGraphCameraSettingNode::OverscanPercentage' has a wrong offset!");

// Class MovieRenderPipelineCore.MovieGraphCollectionNode
// 0x0010 (0x00A8 - 0x0098)
class UMovieGraphCollectionNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_Collection : 1;                          // 0x0098(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMovieGraphCollection*                  Collection;                                        // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphCollectionNode">();
	}
	static class UMovieGraphCollectionNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphCollectionNode>();
	}
};
static_assert(alignof(UMovieGraphCollectionNode) == 0x000008, "Wrong alignment on UMovieGraphCollectionNode");
static_assert(sizeof(UMovieGraphCollectionNode) == 0x0000A8, "Wrong size on UMovieGraphCollectionNode");
static_assert(offsetof(UMovieGraphCollectionNode, Collection) == 0x0000A0, "Member 'UMovieGraphCollectionNode::Collection' has a wrong offset!");

// Class MovieRenderPipelineCore.MovieGraphCommandLineEncoderNode
// 0x00A0 (0x0138 - 0x0098)
class UMovieGraphCommandLineEncoderNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bOverride_FileNameFormat : 1;                      // 0x00A0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bDeleteSourceFiles : 1;                  // 0x00A0(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bSkipEncodeOnRenderCanceled : 1;         // 0x00A0(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_VideoCodec : 1;                          // 0x00A0(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_AudioCodec : 1;                          // 0x00A0(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_OutputFileExtension : 1;                 // 0x00A0(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_CommandLineFormat : 1;                   // 0x00A0(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_VideoInputStringFormat : 1;              // 0x00A0(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_AudioInputStringFormat : 1;              // 0x00A1(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_EncodeSettings : 1;                      // 0x00A1(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bRetainInputTextFiles : 1;               // 0x00A1(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 FileNameFormat;                                    // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeleteSourceFiles;                                // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipEncodeOnRenderCanceled;                       // 0x00B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 VideoCodec;                                        // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AudioCodec;                                        // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutputFileExtension;                               // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CommandLineFormat;                                 // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VideoInputStringFormat;                            // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AudioInputStringFormat;                            // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EncodeSettings;                                    // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRetainInputTextFiles;                             // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphCommandLineEncoderNode">();
	}
	static class UMovieGraphCommandLineEncoderNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphCommandLineEncoderNode>();
	}
};
static_assert(alignof(UMovieGraphCommandLineEncoderNode) == 0x000008, "Wrong alignment on UMovieGraphCommandLineEncoderNode");
static_assert(sizeof(UMovieGraphCommandLineEncoderNode) == 0x000138, "Wrong size on UMovieGraphCommandLineEncoderNode");
static_assert(offsetof(UMovieGraphCommandLineEncoderNode, FileNameFormat) == 0x0000A8, "Member 'UMovieGraphCommandLineEncoderNode::FileNameFormat' has a wrong offset!");
static_assert(offsetof(UMovieGraphCommandLineEncoderNode, bDeleteSourceFiles) == 0x0000B8, "Member 'UMovieGraphCommandLineEncoderNode::bDeleteSourceFiles' has a wrong offset!");
static_assert(offsetof(UMovieGraphCommandLineEncoderNode, bSkipEncodeOnRenderCanceled) == 0x0000B9, "Member 'UMovieGraphCommandLineEncoderNode::bSkipEncodeOnRenderCanceled' has a wrong offset!");
static_assert(offsetof(UMovieGraphCommandLineEncoderNode, VideoCodec) == 0x0000C0, "Member 'UMovieGraphCommandLineEncoderNode::VideoCodec' has a wrong offset!");
static_assert(offsetof(UMovieGraphCommandLineEncoderNode, AudioCodec) == 0x0000D0, "Member 'UMovieGraphCommandLineEncoderNode::AudioCodec' has a wrong offset!");
static_assert(offsetof(UMovieGraphCommandLineEncoderNode, OutputFileExtension) == 0x0000E0, "Member 'UMovieGraphCommandLineEncoderNode::OutputFileExtension' has a wrong offset!");
static_assert(offsetof(UMovieGraphCommandLineEncoderNode, CommandLineFormat) == 0x0000F0, "Member 'UMovieGraphCommandLineEncoderNode::CommandLineFormat' has a wrong offset!");
static_assert(offsetof(UMovieGraphCommandLineEncoderNode, VideoInputStringFormat) == 0x000100, "Member 'UMovieGraphCommandLineEncoderNode::VideoInputStringFormat' has a wrong offset!");
static_assert(offsetof(UMovieGraphCommandLineEncoderNode, AudioInputStringFormat) == 0x000110, "Member 'UMovieGraphCommandLineEncoderNode::AudioInputStringFormat' has a wrong offset!");
static_assert(offsetof(UMovieGraphCommandLineEncoderNode, EncodeSettings) == 0x000120, "Member 'UMovieGraphCommandLineEncoderNode::EncodeSettings' has a wrong offset!");
static_assert(offsetof(UMovieGraphCommandLineEncoderNode, bRetainInputTextFiles) == 0x000130, "Member 'UMovieGraphCommandLineEncoderNode::bRetainInputTextFiles' has a wrong offset!");

// Class MovieRenderPipelineCore.MovieGraphValueContainer
// 0x0018 (0x0040 - 0x0028)
class UMovieGraphValueContainer : public UObject
{
public:
	class FName                                   PropertyName;                                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FInstancedPropertyBag                  Value;                                             // 0x0030(0x0010)(Edit, NativeAccessSpecifierPrivate)

public:
	class FString GetValueSerializedString();
	bool SetValueBool(const bool bInValue);
	bool SetValueByte(const uint8 InValue);
	bool SetValueClass(class UClass* InValue);
	void SetValueContainerType(EMovieGraphContainerType ContainerType);
	bool SetValueDouble(const double InValue);
	bool SetValueEnum(const uint8 InValue, const class UEnum* Enum);
	bool SetValueFloat(const float InValue);
	bool SetValueInt32(const int32 InValue);
	bool SetValueInt64(const int64 InValue);
	bool SetValueName(const class FName InValue);
	bool SetValueObject(class UObject* InValue);
	bool SetValueSerializedString(const class FString& NewValue);
	bool SetValueString(const class FString& InValue);
	bool SetValueText(const class FText& InValue);
	void SetValueType(EMovieGraphValueType ValueType, class UObject* InValueTypeObject);
	void SetValueTypeObject(const class UObject* ValueTypeObject);

	bool GetValueBool(bool* bOutValue) const;
	bool GetValueByte(uint8* OutValue) const;
	bool GetValueClass(class UClass** OutValue) const;
	EMovieGraphContainerType GetValueContainerType() const;
	bool GetValueDouble(double* OutValue) const;
	bool GetValueEnum(uint8* OutValue, const class UEnum* RequestedEnum) const;
	bool GetValueFloat(float* OutValue) const;
	bool GetValueInt32(int32* OutValue) const;
	bool GetValueInt64(int64* OutValue) const;
	bool GetValueName(class FName* OutValue) const;
	bool GetValueObject(class UObject* OutValue, const class UClass* RequestedClass) const;
	bool GetValueString(class FString* OutValue) const;
	bool GetValueText(class FText* OutValue) const;
	EMovieGraphValueType GetValueType() const;
	const class UObject* GetValueTypeObject() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphValueContainer">();
	}
	static class UMovieGraphValueContainer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphValueContainer>();
	}
};
static_assert(alignof(UMovieGraphValueContainer) == 0x000008, "Wrong alignment on UMovieGraphValueContainer");
static_assert(sizeof(UMovieGraphValueContainer) == 0x000040, "Wrong size on UMovieGraphValueContainer");
static_assert(offsetof(UMovieGraphValueContainer, PropertyName) == 0x000028, "Member 'UMovieGraphValueContainer::PropertyName' has a wrong offset!");
static_assert(offsetof(UMovieGraphValueContainer, Value) == 0x000030, "Member 'UMovieGraphValueContainer::Value' has a wrong offset!");

// Class MovieRenderPipelineCore.MovieGraphMember
// 0x0038 (0x0078 - 0x0040)
class UMovieGraphMember : public UMovieGraphValueContainer
{
public:
	class FString                                 Description;                                       // 0x0040(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Name_0;                                            // 0x0050(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  Guid;                                              // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsEditable;                                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool SetMemberName(const class FString& InNewName);

	const struct FGuid GetGuid() const;
	class FString GetMemberName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphMember">();
	}
	static class UMovieGraphMember* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphMember>();
	}
};
static_assert(alignof(UMovieGraphMember) == 0x000008, "Wrong alignment on UMovieGraphMember");
static_assert(sizeof(UMovieGraphMember) == 0x000078, "Wrong size on UMovieGraphMember");
static_assert(offsetof(UMovieGraphMember, Description) == 0x000040, "Member 'UMovieGraphMember::Description' has a wrong offset!");
static_assert(offsetof(UMovieGraphMember, Name_0) == 0x000050, "Member 'UMovieGraphMember::Name_0' has a wrong offset!");
static_assert(offsetof(UMovieGraphMember, Guid) == 0x000060, "Member 'UMovieGraphMember::Guid' has a wrong offset!");
static_assert(offsetof(UMovieGraphMember, bIsEditable) == 0x000070, "Member 'UMovieGraphMember::bIsEditable' has a wrong offset!");

// Class MovieRenderPipelineCore.MovieGraphVariable
// 0x0000 (0x0078 - 0x0078)
class UMovieGraphVariable : public UMovieGraphMember
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphVariable">();
	}
	static class UMovieGraphVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphVariable>();
	}
};
static_assert(alignof(UMovieGraphVariable) == 0x000008, "Wrong alignment on UMovieGraphVariable");
static_assert(sizeof(UMovieGraphVariable) == 0x000078, "Wrong size on UMovieGraphVariable");

// Class MovieRenderPipelineCore.MovieGraphGlobalVariable
// 0x0000 (0x0078 - 0x0078)
class UMovieGraphGlobalVariable : public UMovieGraphVariable
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphGlobalVariable">();
	}
	static class UMovieGraphGlobalVariable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphGlobalVariable>();
	}
};
static_assert(alignof(UMovieGraphGlobalVariable) == 0x000008, "Wrong alignment on UMovieGraphGlobalVariable");
static_assert(sizeof(UMovieGraphGlobalVariable) == 0x000078, "Wrong size on UMovieGraphGlobalVariable");

// Class MovieRenderPipelineCore.MovieGraphGlobalVariable_ShotName
// 0x0000 (0x0078 - 0x0078)
class UMovieGraphGlobalVariable_ShotName final : public UMovieGraphGlobalVariable
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphGlobalVariable_ShotName">();
	}
	static class UMovieGraphGlobalVariable_ShotName* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphGlobalVariable_ShotName>();
	}
};
static_assert(alignof(UMovieGraphGlobalVariable_ShotName) == 0x000008, "Wrong alignment on UMovieGraphGlobalVariable_ShotName");
static_assert(sizeof(UMovieGraphGlobalVariable_ShotName) == 0x000078, "Wrong size on UMovieGraphGlobalVariable_ShotName");

// Class MovieRenderPipelineCore.MovieGraphGlobalVariable_SequenceName
// 0x0000 (0x0078 - 0x0078)
class UMovieGraphGlobalVariable_SequenceName final : public UMovieGraphGlobalVariable
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphGlobalVariable_SequenceName">();
	}
	static class UMovieGraphGlobalVariable_SequenceName* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphGlobalVariable_SequenceName>();
	}
};
static_assert(alignof(UMovieGraphGlobalVariable_SequenceName) == 0x000008, "Wrong alignment on UMovieGraphGlobalVariable_SequenceName");
static_assert(sizeof(UMovieGraphGlobalVariable_SequenceName) == 0x000078, "Wrong size on UMovieGraphGlobalVariable_SequenceName");

// Class MovieRenderPipelineCore.MovieGraphGlobalVariable_FrameNumber
// 0x0000 (0x0078 - 0x0078)
class UMovieGraphGlobalVariable_FrameNumber final : public UMovieGraphGlobalVariable
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphGlobalVariable_FrameNumber">();
	}
	static class UMovieGraphGlobalVariable_FrameNumber* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphGlobalVariable_FrameNumber>();
	}
};
static_assert(alignof(UMovieGraphGlobalVariable_FrameNumber) == 0x000008, "Wrong alignment on UMovieGraphGlobalVariable_FrameNumber");
static_assert(sizeof(UMovieGraphGlobalVariable_FrameNumber) == 0x000078, "Wrong size on UMovieGraphGlobalVariable_FrameNumber");

// Class MovieRenderPipelineCore.MovieGraphGlobalVariable_CameraName
// 0x0000 (0x0078 - 0x0078)
class UMovieGraphGlobalVariable_CameraName final : public UMovieGraphGlobalVariable
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphGlobalVariable_CameraName">();
	}
	static class UMovieGraphGlobalVariable_CameraName* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphGlobalVariable_CameraName>();
	}
};
static_assert(alignof(UMovieGraphGlobalVariable_CameraName) == 0x000008, "Wrong alignment on UMovieGraphGlobalVariable_CameraName");
static_assert(sizeof(UMovieGraphGlobalVariable_CameraName) == 0x000078, "Wrong size on UMovieGraphGlobalVariable_CameraName");

// Class MovieRenderPipelineCore.MovieGraphInterfaceBase
// 0x0008 (0x0080 - 0x0078)
class UMovieGraphInterfaceBase : public UMovieGraphMember
{
public:
	bool                                          bIsBranch;                                         // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphInterfaceBase">();
	}
	static class UMovieGraphInterfaceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphInterfaceBase>();
	}
};
static_assert(alignof(UMovieGraphInterfaceBase) == 0x000008, "Wrong alignment on UMovieGraphInterfaceBase");
static_assert(sizeof(UMovieGraphInterfaceBase) == 0x000080, "Wrong size on UMovieGraphInterfaceBase");
static_assert(offsetof(UMovieGraphInterfaceBase, bIsBranch) == 0x000078, "Member 'UMovieGraphInterfaceBase::bIsBranch' has a wrong offset!");

// Class MovieRenderPipelineCore.MovieGraphInput
// 0x0000 (0x0080 - 0x0080)
class UMovieGraphInput final : public UMovieGraphInterfaceBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphInput">();
	}
	static class UMovieGraphInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphInput>();
	}
};
static_assert(alignof(UMovieGraphInput) == 0x000008, "Wrong alignment on UMovieGraphInput");
static_assert(sizeof(UMovieGraphInput) == 0x000080, "Wrong size on UMovieGraphInput");

// Class MovieRenderPipelineCore.MovieGraphOutput
// 0x0000 (0x0080 - 0x0080)
class UMovieGraphOutput final : public UMovieGraphInterfaceBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphOutput">();
	}
	static class UMovieGraphOutput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphOutput>();
	}
};
static_assert(alignof(UMovieGraphOutput) == 0x000008, "Wrong alignment on UMovieGraphOutput");
static_assert(sizeof(UMovieGraphOutput) == 0x000080, "Wrong size on UMovieGraphOutput");

// Class MovieRenderPipelineCore.MovieGraphEvaluatedConfig
// 0x0050 (0x0078 - 0x0028)
class UMovieGraphEvaluatedConfig final : public UObject
{
public:
	TMap<class FName, struct FMovieGraphEvaluatedBranchConfig> BranchConfigMapping;                  // 0x0028(0x0050)(Transient, NativeAccessSpecifierPublic)

public:
	const TArray<class FName> GetBranchNames() const;
	class UMovieGraphSettingNode* GetSettingForBranch(class UClass* InClass, const class FName InBranchName, bool bIncludeCDOs, bool bExactMatch) const;
	TArray<class UMovieGraphSettingNode*> GetSettingsForBranch(class UClass* InClass, const class FName InBranchName, bool bIncludeCDOs, bool bExactMatch) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphEvaluatedConfig">();
	}
	static class UMovieGraphEvaluatedConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphEvaluatedConfig>();
	}
};
static_assert(alignof(UMovieGraphEvaluatedConfig) == 0x000008, "Wrong alignment on UMovieGraphEvaluatedConfig");
static_assert(sizeof(UMovieGraphEvaluatedConfig) == 0x000078, "Wrong size on UMovieGraphEvaluatedConfig");
static_assert(offsetof(UMovieGraphEvaluatedConfig, BranchConfigMapping) == 0x000028, "Member 'UMovieGraphEvaluatedConfig::BranchConfigMapping' has a wrong offset!");

// Class MovieRenderPipelineCore.MovieGraphTraversableObject
// 0x0000 (0x0000 - 0x0000)
class IMovieGraphTraversableObject final
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphTraversableObject">();
	}
	static class IMovieGraphTraversableObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMovieGraphTraversableObject>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
static_assert(alignof(IMovieGraphTraversableObject) == 0x000001, "Wrong alignment on IMovieGraphTraversableObject");
static_assert(sizeof(IMovieGraphTraversableObject) == 0x000001, "Wrong size on IMovieGraphTraversableObject");

// Class MovieRenderPipelineCore.MovieGraphConfig
// 0x0060 (0x0088 - 0x0028)
class UMovieGraphConfig final : public UObject
{
public:
	TArray<class UMovieGraphNode*>                AllNodes;                                          // 0x0028(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UMovieGraphNode*                        InputNode;                                         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMovieGraphNode*                        OutputNode;                                        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMovieGraphVariable*>            Variables;                                         // 0x0048(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UMovieGraphGlobalVariable*>      GlobalVariables;                                   // 0x0058(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UMovieGraphInput*>               Inputs;                                            // 0x0068(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<class UMovieGraphOutput*>              Outputs;                                           // 0x0078(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)

public:
	class UMovieGraphInput* AddInput();
	bool AddLabeledEdge(class UMovieGraphNode* FromNode, const class FName& FromPinLabel, class UMovieGraphNode* ToNode, const class FName& ToPinLabel);
	class UMovieGraphOutput* AddOutput();
	class UMovieGraphVariable* AddVariable(const class FName InCustomBaseName);
	class UMovieGraphEvaluatedConfig* CreateFlattenedGraph(const struct FMovieGraphTraversalContext& InContext, class FString* OutError);
	class UMovieGraphNode* CreateNodeByClass(const TSubclassOf<class UMovieGraphNode> InClass);
	bool DeleteMember(class UMovieGraphMember* MemberToDelete);
	bool RemoveAllInboundEdges(class UMovieGraphNode* InNode);
	bool RemoveAllOutboundEdges(class UMovieGraphNode* InNode);
	bool RemoveInboundEdges(class UMovieGraphNode* InNode, const class FName& InPinName);
	bool RemoveLabeledEdge(class UMovieGraphNode* FromNode, const class FName& FromPinName, class UMovieGraphNode* ToNode, const class FName& ToPinName);
	bool RemoveNode(class UMovieGraphNode* InNode);
	bool RemoveNodes(const TArray<class UMovieGraphNode*>& InNodes);
	bool RemoveOutboundEdges(class UMovieGraphNode* InNode, const class FName& InPinName);
	void UpdateGlobalVariableValues(const class UMovieGraphPipeline* InPipeline);

	class UMovieGraphNode* GetInputNode() const;
	TArray<class UMovieGraphInput*> GetInputs() const;
	class UMovieGraphNode* GetOutputNode() const;
	TArray<class UMovieGraphOutput*> GetOutputs() const;
	TArray<class UMovieGraphVariable*> GetVariables(const bool bIncludeGlobal) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphConfig">();
	}
	static class UMovieGraphConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphConfig>();
	}
};
static_assert(alignof(UMovieGraphConfig) == 0x000008, "Wrong alignment on UMovieGraphConfig");
static_assert(sizeof(UMovieGraphConfig) == 0x000088, "Wrong size on UMovieGraphConfig");
static_assert(offsetof(UMovieGraphConfig, AllNodes) == 0x000028, "Member 'UMovieGraphConfig::AllNodes' has a wrong offset!");
static_assert(offsetof(UMovieGraphConfig, InputNode) == 0x000038, "Member 'UMovieGraphConfig::InputNode' has a wrong offset!");
static_assert(offsetof(UMovieGraphConfig, OutputNode) == 0x000040, "Member 'UMovieGraphConfig::OutputNode' has a wrong offset!");
static_assert(offsetof(UMovieGraphConfig, Variables) == 0x000048, "Member 'UMovieGraphConfig::Variables' has a wrong offset!");
static_assert(offsetof(UMovieGraphConfig, GlobalVariables) == 0x000058, "Member 'UMovieGraphConfig::GlobalVariables' has a wrong offset!");
static_assert(offsetof(UMovieGraphConfig, Inputs) == 0x000068, "Member 'UMovieGraphConfig::Inputs' has a wrong offset!");
static_assert(offsetof(UMovieGraphConfig, Outputs) == 0x000078, "Member 'UMovieGraphConfig::Outputs' has a wrong offset!");

// Class MovieRenderPipelineCore.MovieGraphTimeStepBase
// 0x0000 (0x0028 - 0x0028)
class UMovieGraphTimeStepBase : public UObject
{
public:
	struct FMovieGraphTimeStepData GetCalculatedTimeData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphTimeStepBase">();
	}
	static class UMovieGraphTimeStepBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphTimeStepBase>();
	}
};
static_assert(alignof(UMovieGraphTimeStepBase) == 0x000008, "Wrong alignment on UMovieGraphTimeStepBase");
static_assert(sizeof(UMovieGraphTimeStepBase) == 0x000028, "Wrong size on UMovieGraphTimeStepBase");

// Class MovieRenderPipelineCore.MovieGraphCoreTimeStep
// 0x0148 (0x0170 - 0x0028)
class UMovieGraphCoreTimeStep : public UMovieGraphTimeStepBase
{
public:
	struct FMovieGraphTimeStepData                CurrentTimeStepData;                               // 0x0028(0x0068)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_90[0xE0];                                      // 0x0090(0x00E0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphCoreTimeStep">();
	}
	static class UMovieGraphCoreTimeStep* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphCoreTimeStep>();
	}
};
static_assert(alignof(UMovieGraphCoreTimeStep) == 0x000008, "Wrong alignment on UMovieGraphCoreTimeStep");
static_assert(sizeof(UMovieGraphCoreTimeStep) == 0x000170, "Wrong size on UMovieGraphCoreTimeStep");
static_assert(offsetof(UMovieGraphCoreTimeStep, CurrentTimeStepData) == 0x000028, "Member 'UMovieGraphCoreTimeStep::CurrentTimeStepData' has a wrong offset!");

// Class MovieRenderPipelineCore.MovieGraphEngineTimeStep
// 0x0018 (0x0040 - 0x0028)
class UMovieGraphEngineTimeStep final : public UEngineCustomTimeStep
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphEngineTimeStep">();
	}
	static class UMovieGraphEngineTimeStep* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphEngineTimeStep>();
	}
};
static_assert(alignof(UMovieGraphEngineTimeStep) == 0x000008, "Wrong alignment on UMovieGraphEngineTimeStep");
static_assert(sizeof(UMovieGraphEngineTimeStep) == 0x000040, "Wrong size on UMovieGraphEngineTimeStep");

// Class MovieRenderPipelineCore.MovieGraphRendererBase
// 0x0000 (0x0028 - 0x0028)
class UMovieGraphRendererBase : public UObject
{
public:
	TArray<struct FMovieGraphImagePreviewData> GetPreviewData() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphRendererBase">();
	}
	static class UMovieGraphRendererBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphRendererBase>();
	}
};
static_assert(alignof(UMovieGraphRendererBase) == 0x000008, "Wrong alignment on UMovieGraphRendererBase");
static_assert(sizeof(UMovieGraphRendererBase) == 0x000028, "Wrong size on UMovieGraphRendererBase");

// Class MovieRenderPipelineCore.MovieGraphDataSourceBase
// 0x0000 (0x0028 - 0x0028)
class UMovieGraphDataSourceBase : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphDataSourceBase">();
	}
	static class UMovieGraphDataSourceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphDataSourceBase>();
	}
};
static_assert(alignof(UMovieGraphDataSourceBase) == 0x000008, "Wrong alignment on UMovieGraphDataSourceBase");
static_assert(sizeof(UMovieGraphDataSourceBase) == 0x000028, "Wrong size on UMovieGraphDataSourceBase");

// Class MovieRenderPipelineCore.MovieGraphAudioRendererBase
// 0x0030 (0x0058 - 0x0028)
class UMovieGraphAudioRendererBase : public UObject
{
public:
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphAudioRendererBase">();
	}
	static class UMovieGraphAudioRendererBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphAudioRendererBase>();
	}
};
static_assert(alignof(UMovieGraphAudioRendererBase) == 0x000008, "Wrong alignment on UMovieGraphAudioRendererBase");
static_assert(sizeof(UMovieGraphAudioRendererBase) == 0x000058, "Wrong size on UMovieGraphAudioRendererBase");

// Class MovieRenderPipelineCore.MovieGraphDebugSettingNode
// 0x0018 (0x00B0 - 0x0098)
class UMovieGraphDebugSettingNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_bCaptureFramesWithRenderDoc : 1;         // 0x0098(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bCaptureUnrealInsightsTrace : 1;         // 0x0098(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_UnrealInsightsTraceFileNameFormat : 1;   // 0x0098(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	bool                                          bCaptureFramesWithRenderDoc;                       // 0x0099(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCaptureUnrealInsightsTrace;                       // 0x009A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9B[0x5];                                       // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UnrealInsightsTraceFileNameFormat;                 // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphDebugSettingNode">();
	}
	static class UMovieGraphDebugSettingNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphDebugSettingNode>();
	}
};
static_assert(alignof(UMovieGraphDebugSettingNode) == 0x000008, "Wrong alignment on UMovieGraphDebugSettingNode");
static_assert(sizeof(UMovieGraphDebugSettingNode) == 0x0000B0, "Wrong size on UMovieGraphDebugSettingNode");
static_assert(offsetof(UMovieGraphDebugSettingNode, bCaptureFramesWithRenderDoc) == 0x000099, "Member 'UMovieGraphDebugSettingNode::bCaptureFramesWithRenderDoc' has a wrong offset!");
static_assert(offsetof(UMovieGraphDebugSettingNode, bCaptureUnrealInsightsTrace) == 0x00009A, "Member 'UMovieGraphDebugSettingNode::bCaptureUnrealInsightsTrace' has a wrong offset!");
static_assert(offsetof(UMovieGraphDebugSettingNode, UnrealInsightsTraceFileNameFormat) == 0x0000A0, "Member 'UMovieGraphDebugSettingNode::UnrealInsightsTraceFileNameFormat' has a wrong offset!");

// Class MovieRenderPipelineCore.MovieGraphDefaultAudioRenderer
// 0x0000 (0x0058 - 0x0058)
class UMovieGraphDefaultAudioRenderer final : public UMovieGraphAudioRendererBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphDefaultAudioRenderer">();
	}
	static class UMovieGraphDefaultAudioRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphDefaultAudioRenderer>();
	}
};
static_assert(alignof(UMovieGraphDefaultAudioRenderer) == 0x000008, "Wrong alignment on UMovieGraphDefaultAudioRenderer");
static_assert(sizeof(UMovieGraphDefaultAudioRenderer) == 0x000058, "Wrong size on UMovieGraphDefaultAudioRenderer");

// Class MovieRenderPipelineCore.MovieGraphDefaultRenderer
// 0x0190 (0x01B8 - 0x0028)
class UMovieGraphDefaultRenderer final : public UMovieGraphRendererBase
{
public:
	TArray<class UMovieGraphRenderPassNode*>      RenderPassesInUse;                                 // 0x0028(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                         Pad_38[0x180];                                     // 0x0038(0x0180)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphDefaultRenderer">();
	}
	static class UMovieGraphDefaultRenderer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphDefaultRenderer>();
	}
};
static_assert(alignof(UMovieGraphDefaultRenderer) == 0x000008, "Wrong alignment on UMovieGraphDefaultRenderer");
static_assert(sizeof(UMovieGraphDefaultRenderer) == 0x0001B8, "Wrong size on UMovieGraphDefaultRenderer");
static_assert(offsetof(UMovieGraphDefaultRenderer, RenderPassesInUse) == 0x000028, "Member 'UMovieGraphDefaultRenderer::RenderPassesInUse' has a wrong offset!");

// Class MovieRenderPipelineCore.MovieGraphEdge
// 0x0010 (0x0038 - 0x0028)
class UMovieGraphEdge final : public UObject
{
public:
	class UMovieGraphPin*                         InputPin;                                          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMovieGraphPin*                         OutputPin;                                         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphEdge">();
	}
	static class UMovieGraphEdge* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphEdge>();
	}
};
static_assert(alignof(UMovieGraphEdge) == 0x000008, "Wrong alignment on UMovieGraphEdge");
static_assert(sizeof(UMovieGraphEdge) == 0x000038, "Wrong size on UMovieGraphEdge");
static_assert(offsetof(UMovieGraphEdge, InputPin) == 0x000028, "Member 'UMovieGraphEdge::InputPin' has a wrong offset!");
static_assert(offsetof(UMovieGraphEdge, OutputPin) == 0x000030, "Member 'UMovieGraphEdge::OutputPin' has a wrong offset!");

// Class MovieRenderPipelineCore.MovieGraphScriptBase
// 0x0000 (0x0028 - 0x0028)
class UMovieGraphScriptBase final : public UObject
{
public:
	void OnJobFinished(class UMoviePipelineExecutorJob* InJobCopy, const struct FMoviePipelineOutputData& InOutputData);
	void OnJobStart(class UMoviePipelineExecutorJob* InJobCopy);
	void OnShotFinished(class UMoviePipelineExecutorJob* InJobCopy, class UMoviePipelineExecutorShot* InShotCopy, const struct FMoviePipelineOutputData& OutputData);
	void OnShotStart(class UMoviePipelineExecutorJob* InJobCopy, class UMoviePipelineExecutorShot* InShotCopy);

	bool IsPerShotCallbackNeeded() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphScriptBase">();
	}
	static class UMovieGraphScriptBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphScriptBase>();
	}
};
static_assert(alignof(UMovieGraphScriptBase) == 0x000008, "Wrong alignment on UMovieGraphScriptBase");
static_assert(sizeof(UMovieGraphScriptBase) == 0x000028, "Wrong size on UMovieGraphScriptBase");

// Class MovieRenderPipelineCore.MovieGraphExecuteScriptNode
// 0x0028 (0x00C0 - 0x0098)
class UMovieGraphExecuteScriptNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_Script : 1;                              // 0x0098(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         Script;                                            // 0x00A0(0x0020)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieGraphExecuteScriptNode">();
	}
	static class UMovieGraphExecuteScriptNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieGraphExecuteScriptNode>();
	}
};
static_assert(alignof(UMovieGraphExecuteScriptNode) == 0x000008, "Wrong alignment on UMovieGraphExecuteScriptNode");
static_assert(sizeof(UMovieGraphExecuteScriptNode) == 0x0000C0, "Wrong size on UMovieGraphExecuteScriptNode");
static_assert(offsetof(UMovieGraphExecuteScriptNode, Script) == 0x0000A0, "Member 'UMovieGraphExecuteScriptNode::Script' has a wrong offset!");

// Class MovieRenderPipelineCore.MovieGraphGlobalGameOverridesNode
// 0x00B8 (0x0150 - 0x0098)
class UMovieGraphGlobalGameOverridesNode final : public UMovieGraphSettingNode
{
public:
	uint8                                         bOverride_GameModeOverride : 1;                    // 0x0098(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_ScalabilityQualityLevel : 1;             // 0x0098(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bDisableTextureStreaming : 1;            // 0x0098(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverride_bDisableLODs : 1;                        // 0x0098(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
