#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PCGGeometryScriptInterop

#include "Basic.hpp"

#include "PCG_classes.hpp"
#include "PCGGeometryScriptInterop_structs.hpp"
#include "GeometryScriptingCore_structs.hpp"


namespace SDK
{

// Class PCGGeometryScriptInterop.PCGMeshSamplerSettings
// 0x00A0 (0x0148 - 0x00A8)
class UPCGMeshSamplerSettings final : public UPCGSettings
{
public:
	EPCGMeshSamplingMethod                        SamplingMethod;                                    // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UStaticMesh>             StaticMesh;                                        // 0x00B0(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseColorChannelAsDensity;                         // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EPCGColorChannel                              ColorChannelAsDensity;                             // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVoxelize;                                         // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         VoxelSize;                                         // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveHiddenTriangles;                            // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGeometryScriptLODType                        RequestedLODType;                                  // 0x00E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RequestedLODIndex;                                 // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometryScriptMeshPointSamplingOptions SamplingOptions;                                  // 0x00F0(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FGeometryScriptNonUniformPointSamplingOptions NonUniformSamplingOptions;                  // 0x0108(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bExtractUVAsAttribute;                             // 0x0120(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   UVAttributeName;                                   // 0x0124(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         UVChannel;                                         // 0x012C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutputTriangleIds;                                // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TriangleIdAttributeName;                           // 0x0134(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PointSteepness;                                    // 0x013C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSynchronousLoad;                                  // 0x0140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PCGMeshSamplerSettings">();
	}
	static class UPCGMeshSamplerSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPCGMeshSamplerSettings>();
	}
};
static_assert(alignof(UPCGMeshSamplerSettings) == 0x000008, "Wrong alignment on UPCGMeshSamplerSettings");
static_assert(sizeof(UPCGMeshSamplerSettings) == 0x000148, "Wrong size on UPCGMeshSamplerSettings");
static_assert(offsetof(UPCGMeshSamplerSettings, SamplingMethod) == 0x0000A8, "Member 'UPCGMeshSamplerSettings::SamplingMethod' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, StaticMesh) == 0x0000B0, "Member 'UPCGMeshSamplerSettings::StaticMesh' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, bUseColorChannelAsDensity) == 0x0000D8, "Member 'UPCGMeshSamplerSettings::bUseColorChannelAsDensity' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, ColorChannelAsDensity) == 0x0000DC, "Member 'UPCGMeshSamplerSettings::ColorChannelAsDensity' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, bVoxelize) == 0x0000E0, "Member 'UPCGMeshSamplerSettings::bVoxelize' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, VoxelSize) == 0x0000E4, "Member 'UPCGMeshSamplerSettings::VoxelSize' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, bRemoveHiddenTriangles) == 0x0000E8, "Member 'UPCGMeshSamplerSettings::bRemoveHiddenTriangles' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, RequestedLODType) == 0x0000E9, "Member 'UPCGMeshSamplerSettings::RequestedLODType' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, RequestedLODIndex) == 0x0000EC, "Member 'UPCGMeshSamplerSettings::RequestedLODIndex' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, SamplingOptions) == 0x0000F0, "Member 'UPCGMeshSamplerSettings::SamplingOptions' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, NonUniformSamplingOptions) == 0x000108, "Member 'UPCGMeshSamplerSettings::NonUniformSamplingOptions' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, bExtractUVAsAttribute) == 0x000120, "Member 'UPCGMeshSamplerSettings::bExtractUVAsAttribute' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, UVAttributeName) == 0x000124, "Member 'UPCGMeshSamplerSettings::UVAttributeName' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, UVChannel) == 0x00012C, "Member 'UPCGMeshSamplerSettings::UVChannel' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, bOutputTriangleIds) == 0x000130, "Member 'UPCGMeshSamplerSettings::bOutputTriangleIds' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, TriangleIdAttributeName) == 0x000134, "Member 'UPCGMeshSamplerSettings::TriangleIdAttributeName' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, PointSteepness) == 0x00013C, "Member 'UPCGMeshSamplerSettings::PointSteepness' has a wrong offset!");
static_assert(offsetof(UPCGMeshSamplerSettings, bSynchronousLoad) == 0x000140, "Member 'UPCGMeshSamplerSettings::bSynchronousLoad' has a wrong offset!");

}

