#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RadialStorm_CoverageBrush

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct RadialStorm_CoverageBrush.RadialStorm_CoverageBrush
// 0x0038 (0x0038 - 0x0000)
struct FRadialStorm_CoverageBrush final
{
public:
	struct FVector                                Location_2_A96EA68347E0CA397E6D0EACC93AF472;       // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Radius_5_E1ED37BB4A0CF30237289B85FB68810F;         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SoftFraction_7_9D9E64B74F82903F14F541A1F37C051F;   // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CoverageLevel_9_7A0C1109448D07FB2CC81CAF6C64F0BB;  // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Alpha_11_0BE1BD674F2496F3B3021E8751BA3E42;         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FRadialStorm_CoverageBrush) == 0x000008, "Wrong alignment on FRadialStorm_CoverageBrush");
static_assert(sizeof(FRadialStorm_CoverageBrush) == 0x000038, "Wrong size on FRadialStorm_CoverageBrush");
static_assert(offsetof(FRadialStorm_CoverageBrush, Location_2_A96EA68347E0CA397E6D0EACC93AF472) == 0x000000, "Member 'FRadialStorm_CoverageBrush::Location_2_A96EA68347E0CA397E6D0EACC93AF472' has a wrong offset!");
static_assert(offsetof(FRadialStorm_CoverageBrush, Radius_5_E1ED37BB4A0CF30237289B85FB68810F) == 0x000018, "Member 'FRadialStorm_CoverageBrush::Radius_5_E1ED37BB4A0CF30237289B85FB68810F' has a wrong offset!");
static_assert(offsetof(FRadialStorm_CoverageBrush, SoftFraction_7_9D9E64B74F82903F14F541A1F37C051F) == 0x000020, "Member 'FRadialStorm_CoverageBrush::SoftFraction_7_9D9E64B74F82903F14F541A1F37C051F' has a wrong offset!");
static_assert(offsetof(FRadialStorm_CoverageBrush, CoverageLevel_9_7A0C1109448D07FB2CC81CAF6C64F0BB) == 0x000028, "Member 'FRadialStorm_CoverageBrush::CoverageLevel_9_7A0C1109448D07FB2CC81CAF6C64F0BB' has a wrong offset!");
static_assert(offsetof(FRadialStorm_CoverageBrush, Alpha_11_0BE1BD674F2496F3B3021E8751BA3E42) == 0x000030, "Member 'FRadialStorm_CoverageBrush::Alpha_11_0BE1BD674F2496F3B3021E8751BA3E42' has a wrong offset!");

}

