#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Random_Weather_Variation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UDS_Season_structs.hpp"
#include "UDS_RandomWeatherTiming_structs.hpp"
#include "UDS_TemperatureType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "RandomWeatherVariation_State_structs.hpp"


namespace SDK::Params
{

// Function Random_Weather_Variation.Random_Weather_Variation_C.Apply State
// 0x0090 (0x0090 - 0x0000)
struct Random_Weather_Variation_C_Apply_State final
{
public:
	struct FRandomWeatherVariation_State          Random_Weather_State;                              // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUDS_Weather_Settings_C*                K2Node_DynamicCast_AsUDS_Weather_Settings;         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUDS_Weather_Settings_C*                K2Node_DynamicCast_AsUDS_Weather_Settings_1;       // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUDS_Weather_Settings_C*                K2Node_DynamicCast_AsUDS_Weather_Settings_2;       // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Random_Weather_Variation_C_Apply_State) == 0x000008, "Wrong alignment on Random_Weather_Variation_C_Apply_State");
static_assert(sizeof(Random_Weather_Variation_C_Apply_State) == 0x000090, "Wrong size on Random_Weather_Variation_C_Apply_State");
static_assert(offsetof(Random_Weather_Variation_C_Apply_State, Random_Weather_State) == 0x000000, "Member 'Random_Weather_Variation_C_Apply_State::Random_Weather_State' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Apply_State, Temp_int_Array_Index_Variable) == 0x000040, "Member 'Random_Weather_Variation_C_Apply_State::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Apply_State, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'Random_Weather_Variation_C_Apply_State::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Apply_State, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'Random_Weather_Variation_C_Apply_State::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Apply_State, CallFunc_Array_Get_Item) == 0x000050, "Member 'Random_Weather_Variation_C_Apply_State::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Apply_State, K2Node_DynamicCast_AsUDS_Weather_Settings) == 0x000058, "Member 'Random_Weather_Variation_C_Apply_State::K2Node_DynamicCast_AsUDS_Weather_Settings' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Apply_State, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'Random_Weather_Variation_C_Apply_State::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Apply_State, K2Node_DynamicCast_AsUDS_Weather_Settings_1) == 0x000068, "Member 'Random_Weather_Variation_C_Apply_State::K2Node_DynamicCast_AsUDS_Weather_Settings_1' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Apply_State, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'Random_Weather_Variation_C_Apply_State::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Apply_State, CallFunc_Array_Add_ReturnValue) == 0x000074, "Member 'Random_Weather_Variation_C_Apply_State::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Apply_State, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'Random_Weather_Variation_C_Apply_State::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Apply_State, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'Random_Weather_Variation_C_Apply_State::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Apply_State, K2Node_DynamicCast_AsUDS_Weather_Settings_2) == 0x000080, "Member 'Random_Weather_Variation_C_Apply_State::K2Node_DynamicCast_AsUDS_Weather_Settings_2' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Apply_State, K2Node_DynamicCast_bSuccess_2) == 0x000088, "Member 'Random_Weather_Variation_C_Apply_State::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function Random_Weather_Variation.Random_Weather_Variation_C.Bind to UDS
// 0x0020 (0x0020 - 0x0000)
struct Random_Weather_Variation_C_Bind_to_UDS final
{
public:
	TDelegate<void(int32 Hour)>                   K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Hour)>                   K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Random_Weather_Variation_C_Bind_to_UDS) == 0x000004, "Wrong alignment on Random_Weather_Variation_C_Bind_to_UDS");
static_assert(sizeof(Random_Weather_Variation_C_Bind_to_UDS) == 0x000020, "Wrong size on Random_Weather_Variation_C_Bind_to_UDS");
static_assert(offsetof(Random_Weather_Variation_C_Bind_to_UDS, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'Random_Weather_Variation_C_Bind_to_UDS::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Bind_to_UDS, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'Random_Weather_Variation_C_Bind_to_UDS::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function Random_Weather_Variation.Random_Weather_Variation_C.Change to Next Random Weather Type
// 0x0080 (0x0080 - 0x0000)
struct Random_Weather_Variation_C_Change_to_Next_Random_Weather_Type final
{
public:
	double                                        Threshold;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Random_Float;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Random_Max_Range;                                  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUDS_Weather_Settings_C*                CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UUDS_Weather_Settings_C*, double>  CallFunc_Create_Composite_Probability_Map_Out;     // 0x0028(0x0050)()
	class UUDS_Weather_Settings_C*                CallFunc_Select_Random_Weather_Type_Out;           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Random_Weather_Variation_C_Change_to_Next_Random_Weather_Type) == 0x000008, "Wrong alignment on Random_Weather_Variation_C_Change_to_Next_Random_Weather_Type");
static_assert(sizeof(Random_Weather_Variation_C_Change_to_Next_Random_Weather_Type) == 0x000080, "Wrong size on Random_Weather_Variation_C_Change_to_Next_Random_Weather_Type");
static_assert(offsetof(Random_Weather_Variation_C_Change_to_Next_Random_Weather_Type, Threshold) == 0x000000, "Member 'Random_Weather_Variation_C_Change_to_Next_Random_Weather_Type::Threshold' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Change_to_Next_Random_Weather_Type, Random_Float) == 0x000008, "Member 'Random_Weather_Variation_C_Change_to_Next_Random_Weather_Type::Random_Float' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Change_to_Next_Random_Weather_Type, Random_Max_Range) == 0x000010, "Member 'Random_Weather_Variation_C_Change_to_Next_Random_Weather_Type::Random_Max_Range' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Change_to_Next_Random_Weather_Type, CallFunc_Array_Get_Item) == 0x000018, "Member 'Random_Weather_Variation_C_Change_to_Next_Random_Weather_Type::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Change_to_Next_Random_Weather_Type, CallFunc_Greater_IntInt_ReturnValue) == 0x000020, "Member 'Random_Weather_Variation_C_Change_to_Next_Random_Weather_Type::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Change_to_Next_Random_Weather_Type, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000021, "Member 'Random_Weather_Variation_C_Change_to_Next_Random_Weather_Type::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Change_to_Next_Random_Weather_Type, CallFunc_Create_Composite_Probability_Map_Out) == 0x000028, "Member 'Random_Weather_Variation_C_Change_to_Next_Random_Weather_Type::CallFunc_Create_Composite_Probability_Map_Out' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Change_to_Next_Random_Weather_Type, CallFunc_Select_Random_Weather_Type_Out) == 0x000078, "Member 'Random_Weather_Variation_C_Change_to_Next_Random_Weather_Type::CallFunc_Select_Random_Weather_Type_Out' has a wrong offset!");

// Function Random_Weather_Variation.Random_Weather_Variation_C.Check For Season Instant Refresh
// 0x0070 (0x0070 - 0x0000)
struct Random_Weather_Variation_C_Check_For_Season_Instant_Refresh final
{
public:
	struct FTimerHandle                           CallFunc_K2_SetTimerForNextTick_ReturnValue;       // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Season_Season;                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUDS_Season                                   CallFunc_Get_Season_Season_Enum;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class UUDS_Weather_Settings_C*, double>  CallFunc_Get_Season_Probability_Map_Map;           // 0x0018(0x0050)()
	bool                                          CallFunc_Map_Contains_ReturnValue;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Random_Weather_Variation_C_Check_For_Season_Instant_Refresh) == 0x000008, "Wrong alignment on Random_Weather_Variation_C_Check_For_Season_Instant_Refresh");
static_assert(sizeof(Random_Weather_Variation_C_Check_For_Season_Instant_Refresh) == 0x000070, "Wrong size on Random_Weather_Variation_C_Check_For_Season_Instant_Refresh");
static_assert(offsetof(Random_Weather_Variation_C_Check_For_Season_Instant_Refresh, CallFunc_K2_SetTimerForNextTick_ReturnValue) == 0x000000, "Member 'Random_Weather_Variation_C_Check_For_Season_Instant_Refresh::CallFunc_K2_SetTimerForNextTick_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Check_For_Season_Instant_Refresh, CallFunc_Get_Season_Season) == 0x000008, "Member 'Random_Weather_Variation_C_Check_For_Season_Instant_Refresh::CallFunc_Get_Season_Season' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Check_For_Season_Instant_Refresh, CallFunc_Get_Season_Season_Enum) == 0x000010, "Member 'Random_Weather_Variation_C_Check_For_Season_Instant_Refresh::CallFunc_Get_Season_Season_Enum' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Check_For_Season_Instant_Refresh, CallFunc_FFloor_ReturnValue) == 0x000014, "Member 'Random_Weather_Variation_C_Check_For_Season_Instant_Refresh::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Check_For_Season_Instant_Refresh, CallFunc_Get_Season_Probability_Map_Map) == 0x000018, "Member 'Random_Weather_Variation_C_Check_For_Season_Instant_Refresh::CallFunc_Get_Season_Probability_Map_Map' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Check_For_Season_Instant_Refresh, CallFunc_Map_Contains_ReturnValue) == 0x000068, "Member 'Random_Weather_Variation_C_Check_For_Season_Instant_Refresh::CallFunc_Map_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Check_For_Season_Instant_Refresh, CallFunc_Not_PreBool_ReturnValue) == 0x000069, "Member 'Random_Weather_Variation_C_Check_For_Season_Instant_Refresh::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function Random_Weather_Variation.Random_Weather_Variation_C.Create Composite Probability Map
// 0x02A8 (0x02A8 - 0x0000)
struct Random_Weather_Variation_C_Create_Composite_Probability_Map final
{
public:
	TMap<class UUDS_Weather_Settings_C*, double>  Out;                                               // 0x0000(0x0050)(Parm, OutParm)
	TArray<double>                                Season_Probability_Totals;                         // 0x0050(0x0010)(Edit, BlueprintVisible)
	TMap<class UUDS_Weather_Settings_C*, double>  Composite_Map;                                     // 0x0060(0x0050)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UUDS_Weather_Settings_C*, double>  CallFunc_Get_Season_Probability_Map_Map;           // 0x00C8(0x0050)()
	TArray<class UUDS_Weather_Settings_C*>        CallFunc_Map_Keys_Keys;                            // 0x0118(0x0010)(ReferenceParm)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUDS_Weather_Settings_C*                CallFunc_Array_Get_Item;                           // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Map_Find_Value;                           // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Array_Get_Item_1;                         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class UUDS_Weather_Settings_C*, double>  CallFunc_Get_Season_Probability_Map_Map_1;         // 0x0168(0x0050)()
	TArray<double>                                CallFunc_Map_Values_Values;                        // 0x01B8(0x0010)(ReferenceParm)
	double                                        CallFunc_Array_Get_Item_2;                         // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item_3;                         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E2[0x2];                                      // 0x01E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item_4;                         // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Get_Season_Season;                        // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUDS_Season                                   CallFunc_Get_Season_Season_Enum;                   // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UUDS_Weather_Settings_C*, double>  CallFunc_Get_Season_Probability_Map_Map_2;         // 0x0210(0x0050)()
	TArray<double>                                K2Node_MakeArray_Array;                            // 0x0260(0x0010)(ReferenceParm)
	double                                        CallFunc_Map_Find_Value_1;                         // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Array_Get_Item_5;                         // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Random_Weather_Variation_C_Create_Composite_Probability_Map) == 0x000008, "Wrong alignment on Random_Weather_Variation_C_Create_Composite_Probability_Map");
static_assert(sizeof(Random_Weather_Variation_C_Create_Composite_Probability_Map) == 0x0002A8, "Wrong size on Random_Weather_Variation_C_Create_Composite_Probability_Map");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, Out) == 0x000000, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::Out' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, Season_Probability_Totals) == 0x000050, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::Season_Probability_Totals' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, Composite_Map) == 0x000060, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::Composite_Map' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, Temp_int_Array_Index_Variable) == 0x0000B0, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, Temp_int_Loop_Counter_Variable) == 0x0000B4, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Add_IntInt_ReturnValue) == 0x0000B8, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, Temp_int_Array_Index_Variable_1) == 0x0000BC, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, Temp_int_Variable) == 0x0000C0, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Get_Season_Probability_Map_Map) == 0x0000C8, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Get_Season_Probability_Map_Map' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Map_Keys_Keys) == 0x000118, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000128, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Array_Get_Item) == 0x000130, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Map_Find_Value) == 0x000138, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Map_Find_ReturnValue) == 0x000140, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Array_Length_ReturnValue) == 0x000144, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Add_IntInt_ReturnValue_1) == 0x000148, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Less_IntInt_ReturnValue) == 0x00014C, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, Temp_int_Loop_Counter_Variable_1) == 0x000150, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Array_Get_Item_1) == 0x000158, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Add_IntInt_ReturnValue_2) == 0x000160, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, Temp_int_Variable_1) == 0x000164, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Get_Season_Probability_Map_Map_1) == 0x000168, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Get_Season_Probability_Map_Map_1' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Map_Values_Values) == 0x0001B8, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Array_Get_Item_2) == 0x0001C8, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Array_Get_Item_3) == 0x0001D0, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0001D8, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Array_Length_ReturnValue_1) == 0x0001DC, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001E0, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0001E1, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Add_IntInt_ReturnValue_3) == 0x0001E4, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Array_Get_Item_4) == 0x0001E8, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Get_Season_Season) == 0x0001F0, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Get_Season_Season' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Get_Season_Season_Enum) == 0x0001F8, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Get_Season_Season_Enum' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000200, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_FFloor_ReturnValue) == 0x000208, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Get_Season_Probability_Map_Map_2) == 0x000210, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Get_Season_Probability_Map_Map_2' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, K2Node_MakeArray_Array) == 0x000260, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Map_Find_Value_1) == 0x000270, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Map_Find_ReturnValue_1) == 0x000278, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Array_Get_Item_5) == 0x000280, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000288, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000290, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_SafeDivide_ReturnValue) == 0x000298, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Create_Composite_Probability_Map, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x0002A0, "Member 'Random_Weather_Variation_C_Create_Composite_Probability_Map::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");

// Function Random_Weather_Variation.Random_Weather_Variation_C.Current Hour Changed
// 0x0018 (0x0018 - 0x0000)
struct Random_Weather_Variation_C_Current_Hour_Changed final
{
public:
	int32                                         Hour;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EUDS_RandomWeatherTiming                      CallFunc_Random_Weather_Mode_Mode;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Random_Weather_Variation_C_Current_Hour_Changed) == 0x000008, "Wrong alignment on Random_Weather_Variation_C_Current_Hour_Changed");
static_assert(sizeof(Random_Weather_Variation_C_Current_Hour_Changed) == 0x000018, "Wrong size on Random_Weather_Variation_C_Current_Hour_Changed");
static_assert(offsetof(Random_Weather_Variation_C_Current_Hour_Changed, Hour) == 0x000000, "Member 'Random_Weather_Variation_C_Current_Hour_Changed::Hour' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Current_Hour_Changed, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'Random_Weather_Variation_C_Current_Hour_Changed::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Current_Hour_Changed, CallFunc_Random_Weather_Mode_Mode) == 0x000010, "Member 'Random_Weather_Variation_C_Current_Hour_Changed::CallFunc_Random_Weather_Mode_Mode' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Current_Hour_Changed, CallFunc_HasAuthority_ReturnValue) == 0x000011, "Member 'Random_Weather_Variation_C_Current_Hour_Changed::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Current_Hour_Changed, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'Random_Weather_Variation_C_Current_Hour_Changed::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function Random_Weather_Variation.Random_Weather_Variation_C.ExecuteUbergraph_Random_Weather_Variation
// 0x0008 (0x0008 - 0x0000)
struct Random_Weather_Variation_C_ExecuteUbergraph_Random_Weather_Variation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Random_Weather_Variation_C_ExecuteUbergraph_Random_Weather_Variation) == 0x000004, "Wrong alignment on Random_Weather_Variation_C_ExecuteUbergraph_Random_Weather_Variation");
static_assert(sizeof(Random_Weather_Variation_C_ExecuteUbergraph_Random_Weather_Variation) == 0x000008, "Wrong size on Random_Weather_Variation_C_ExecuteUbergraph_Random_Weather_Variation");
static_assert(offsetof(Random_Weather_Variation_C_ExecuteUbergraph_Random_Weather_Variation, EntryPoint) == 0x000000, "Member 'Random_Weather_Variation_C_ExecuteUbergraph_Random_Weather_Variation::EntryPoint' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_ExecuteUbergraph_Random_Weather_Variation, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Random_Weather_Variation_C_ExecuteUbergraph_Random_Weather_Variation::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function Random_Weather_Variation.Random_Weather_Variation_C.Fill Weather Forecast
// 0x00D0 (0x00D0 - 0x0000)
struct Random_Weather_Variation_C_Fill_Weather_Forecast final
{
public:
	TMap<class UUDS_Weather_Settings_C*, double>  Current_Probabilities;                             // 0x0000(0x0050)(Edit, BlueprintVisible)
	class UUDS_Weather_Settings_C*                Last_Step_Weather;                                 // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class UUDS_Weather_Settings_C*, double>  CallFunc_Create_Composite_Probability_Map_Out;     // 0x0058(0x0050)()
	class UUDS_Weather_Settings_C*                CallFunc_Select_Random_Weather_Type_Out;           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUDS_Weather_Settings_C*                CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Random_Weather_Variation_C_Fill_Weather_Forecast) == 0x000008, "Wrong alignment on Random_Weather_Variation_C_Fill_Weather_Forecast");
static_assert(sizeof(Random_Weather_Variation_C_Fill_Weather_Forecast) == 0x0000D0, "Wrong size on Random_Weather_Variation_C_Fill_Weather_Forecast");
static_assert(offsetof(Random_Weather_Variation_C_Fill_Weather_Forecast, Current_Probabilities) == 0x000000, "Member 'Random_Weather_Variation_C_Fill_Weather_Forecast::Current_Probabilities' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Fill_Weather_Forecast, Last_Step_Weather) == 0x000050, "Member 'Random_Weather_Variation_C_Fill_Weather_Forecast::Last_Step_Weather' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Fill_Weather_Forecast, CallFunc_Create_Composite_Probability_Map_Out) == 0x000058, "Member 'Random_Weather_Variation_C_Fill_Weather_Forecast::CallFunc_Create_Composite_Probability_Map_Out' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Fill_Weather_Forecast, CallFunc_Select_Random_Weather_Type_Out) == 0x0000A8, "Member 'Random_Weather_Variation_C_Fill_Weather_Forecast::CallFunc_Select_Random_Weather_Type_Out' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Fill_Weather_Forecast, CallFunc_Array_Add_ReturnValue) == 0x0000B0, "Member 'Random_Weather_Variation_C_Fill_Weather_Forecast::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Fill_Weather_Forecast, CallFunc_Array_LastIndex_ReturnValue) == 0x0000B4, "Member 'Random_Weather_Variation_C_Fill_Weather_Forecast::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Fill_Weather_Forecast, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'Random_Weather_Variation_C_Fill_Weather_Forecast::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Fill_Weather_Forecast, CallFunc_Array_IsEmpty_ReturnValue) == 0x0000C0, "Member 'Random_Weather_Variation_C_Fill_Weather_Forecast::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Fill_Weather_Forecast, CallFunc_Array_Length_ReturnValue) == 0x0000C4, "Member 'Random_Weather_Variation_C_Fill_Weather_Forecast::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Fill_Weather_Forecast, CallFunc_Less_IntInt_ReturnValue) == 0x0000C8, "Member 'Random_Weather_Variation_C_Fill_Weather_Forecast::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function Random_Weather_Variation.Random_Weather_Variation_C.Filter Probability Map
// 0x01C0 (0x01C0 - 0x0000)
struct Random_Weather_Variation_C_Filter_Probability_Map final
{
public:
	TMap<class UUDS_Weather_Settings_C*, double>  Probability_Map;                                   // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UUDS_Weather_Settings_C*                Current_Random_Type;                               // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class UUDS_Weather_Settings_C*, double>  Filtered_Probability_Map;                          // 0x0058(0x0050)(Parm, OutParm)
	TMap<class UUDS_Weather_Settings_C*, double>  Map;                                               // 0x00A8(0x0050)(Edit, BlueprintVisible)
	TArray<class UUDS_Weather_Settings_C*>        Weather_Types_to_Filter;                           // 0x00F8(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_126[0x2];                                      // 0x0126(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUDS_Weather_Settings_C*>        CallFunc_Map_Keys_Keys;                            // 0x0130(0x0010)(ReferenceParm)
	class UUDS_Weather_Settings_C*                CallFunc_Array_Get_Item;                           // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_3;       // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A[0x6];                                      // 0x015A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUDS_Weather_Settings_C*>        CallFunc_Map_Keys_Keys_1;                          // 0x0160(0x0010)(ReferenceParm)
	class UUDS_Weather_Settings_C*                CallFunc_Array_Get_Item_1;                         // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_4;       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUDS_Weather_Settings_C*                CallFunc_Array_Get_Item_2;                         // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Random_Weather_Variation_C_Filter_Probability_Map) == 0x000008, "Wrong alignment on Random_Weather_Variation_C_Filter_Probability_Map");
static_assert(sizeof(Random_Weather_Variation_C_Filter_Probability_Map) == 0x0001C0, "Wrong size on Random_Weather_Variation_C_Filter_Probability_Map");
static_assert(offsetof(Random_Weather_Variation_C_Filter_Probability_Map, Probability_Map) == 0x000000, "Member 'Random_Weather_Variation_C_Filter_Probability_Map::Probability_Map' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Filter_Probability_Map, Current_Random_Type) == 0x000050, "Member 'Random_Weather_Variation_C_Filter_Probability_Map::Current_Random_Type' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Filter_Probability_Map, Filtered_Probability_Map) == 0x000058, "Member 'Random_Weather_Variation_C_Filter_Probability_Map::Filtered_Probability_Map' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Filter_Probability_Map, Map) == 0x0000A8, "Member 'Random_Weather_Variation_C_Filter_Probability_Map::Map' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Filter_Probability_Map, Weather_Types_to_Filter) == 0x0000F8, "Member 'Random_Weather_Variation_C_Filter_Probability_Map::Weather_Types_to_Filter' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Filter_Probability_Map, Temp_int_Array_Index_Variable) == 0x000108, "Member 'Random_Weather_Variation_C_Filter_Probability_Map::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Filter_Probability_Map, Temp_int_Loop_Counter_Variable) == 0x00010C, "Member 'Random_Weather_Variation_C_Filter_Probability_Map::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Filter_Probability_Map, Temp_int_Array_Index_Variable_1) == 0x000110, "Member 'Random_Weather_Variation_C_Filter_Probability_Map::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Filter_Probability_Map, CallFunc_Add_IntInt_ReturnValue) == 0x000114, "Member 'Random_Weather_Variation_C_Filter_Probability_Map::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Filter_Probability_Map, Temp_int_Loop_Counter_Variable_1) == 0x000118, "Member 'Random_Weather_Variation_C_Filter_Probability_Map::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Filter_Probability_Map, CallFunc_Add_IntInt_ReturnValue_1) == 0x00011C, "Member 'Random_Weather_Variation_C_Filter_Probability_Map::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Filter_Probability_Map, Temp_int_Array_Index_Variable_2) == 0x000120, "Member 'Random_Weather_Variation_C_Filter_Probability_Map::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Filter_Probability_Map, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000124, "Member 'Random_Weather_Variation_C_Filter_Probability_Map::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Filter_Probability_Map, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000125, "Member 'Random_Weather_Variation_C_Filter_Probability_Map::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Filter_Probability_Map, Temp_int_Loop_Counter_Variable_2) == 0x000128, "Member 'Random_Weather_Variation_C_Filter_Probability_Map::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Filter_Probability_Map, CallFunc_Map_Keys_Keys) == 0x000130, "Member 'Random_Weather_Variation_C_Filter_Probability_Map::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Filter_Probability_Map, CallFunc_Array_Get_Item) == 0x000140, "Member 'Random_Weather_Variation_C_Filter_Probability_Map::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Filter_Probability_Map, CallFunc_Array_Length_ReturnValue) == 0x000148, "Member 'Random_Weather_Variation_C_Filter_Probability_Map::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Filter_Probability_Map, CallFunc_Array_Add_ReturnValue) == 0x00014C, "Member 'Random_Weather_Variation_C_Filter_Probability_Map::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Filter_Probability_Map, CallFunc_Less_IntInt_ReturnValue) == 0x000150, "Member 'Random_Weather_Variation_C_Filter_Probability_Map::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Filter_Probability_Map, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x000151, "Member 'Random_Weather_Variation_C_Filter_Probability_Map::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Random_Weather_Variation_C_Filter_Probability_Map, CallFunc_BooleanAND_ReturnValue) == 0x000152, "Member 'Random_Weather_Variation_C_Filter_Probability_Map::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
