#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RedpointEOSFramework

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// Enum RedpointEOSFramework.ERedpointEOSPartyAttributeType
// NumValues: 0x0005
enum class ERedpointEOSPartyAttributeType : uint8
{
	String                                   = 0,
	Int64                                    = 1,
	Double                                   = 2,
	Bool                                     = 3,
	ERedpointEOSPartyAttributeType_MAX       = 4,
};

// ScriptStruct RedpointEOSFramework.RedpointEOSPartyAttributeValue
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) FRedpointEOSPartyAttributeValue final
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FRedpointEOSPartyAttributeValue) == 0x000008, "Wrong alignment on FRedpointEOSPartyAttributeValue");
static_assert(sizeof(FRedpointEOSPartyAttributeValue) == 0x000030, "Wrong size on FRedpointEOSPartyAttributeValue");

// ScriptStruct RedpointEOSFramework.RedpointEOSPartyMemberInfo
// 0x00E8 (0x00E8 - 0x0000)
struct FRedpointEOSPartyMemberInfo final
{
public:
	bool                                          bHasPartyMember;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUniqueNetIdRepl                       UserId;                                            // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PlayerName;                                        // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            PlayerUserAttributes;                              // 0x0048(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<class FString, struct FRedpointEOSPartyAttributeValue> PartyMemberAttributes;               // 0x0098(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRedpointEOSPartyMemberInfo) == 0x000008, "Wrong alignment on FRedpointEOSPartyMemberInfo");
static_assert(sizeof(FRedpointEOSPartyMemberInfo) == 0x0000E8, "Wrong size on FRedpointEOSPartyMemberInfo");
static_assert(offsetof(FRedpointEOSPartyMemberInfo, bHasPartyMember) == 0x000000, "Member 'FRedpointEOSPartyMemberInfo::bHasPartyMember' has a wrong offset!");
static_assert(offsetof(FRedpointEOSPartyMemberInfo, UserId) == 0x000008, "Member 'FRedpointEOSPartyMemberInfo::UserId' has a wrong offset!");
static_assert(offsetof(FRedpointEOSPartyMemberInfo, PlayerName) == 0x000038, "Member 'FRedpointEOSPartyMemberInfo::PlayerName' has a wrong offset!");
static_assert(offsetof(FRedpointEOSPartyMemberInfo, PlayerUserAttributes) == 0x000048, "Member 'FRedpointEOSPartyMemberInfo::PlayerUserAttributes' has a wrong offset!");
static_assert(offsetof(FRedpointEOSPartyMemberInfo, PartyMemberAttributes) == 0x000098, "Member 'FRedpointEOSPartyMemberInfo::PartyMemberAttributes' has a wrong offset!");

}

