#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RedpointEOSNetworking

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "OnlineSubsystemUtils_classes.hpp"


namespace SDK
{

// Class RedpointEOSNetworking.RedpointEOSControlChannel
// 0x0210 (0x0290 - 0x0080)
class URedpointEOSControlChannel final : public UControlChannel
{
public:
	uint8                                         Pad_80[0x210];                                     // 0x0080(0x0210)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RedpointEOSControlChannel">();
	}
	static class URedpointEOSControlChannel* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointEOSControlChannel>();
	}
};
static_assert(alignof(URedpointEOSControlChannel) == 0x000008, "Wrong alignment on URedpointEOSControlChannel");
static_assert(sizeof(URedpointEOSControlChannel) == 0x000290, "Wrong size on URedpointEOSControlChannel");

// Class RedpointEOSNetworking.RedpointEOSIpNetConnection
// 0x0000 (0x1E90 - 0x1E90)
class URedpointEOSIpNetConnection final : public UIpConnection
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RedpointEOSIpNetConnection">();
	}
	static class URedpointEOSIpNetConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointEOSIpNetConnection>();
	}
};
static_assert(alignof(URedpointEOSIpNetConnection) == 0x000008, "Wrong alignment on URedpointEOSIpNetConnection");
static_assert(sizeof(URedpointEOSIpNetConnection) == 0x001E90, "Wrong size on URedpointEOSIpNetConnection");

// Class RedpointEOSNetworking.RedpointEOSNetConnection
// 0x0010 (0x1E10 - 0x1E00)
class URedpointEOSNetConnection final : public UNetConnection
{
public:
	uint8                                         Pad_1E00[0x10];                                    // 0x1E00(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RedpointEOSNetConnection">();
	}
	static class URedpointEOSNetConnection* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointEOSNetConnection>();
	}
};
static_assert(alignof(URedpointEOSNetConnection) == 0x000008, "Wrong alignment on URedpointEOSNetConnection");
static_assert(sizeof(URedpointEOSNetConnection) == 0x001E10, "Wrong size on URedpointEOSNetConnection");

// Class RedpointEOSNetworking.RedpointEOSNetDriver
// 0x0010 (0x0958 - 0x0948)
class URedpointEOSNetDriver final : public UIpNetDriver
{
public:
	uint8                                         Pad_948[0x10];                                     // 0x0948(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RedpointEOSNetDriver">();
	}
	static class URedpointEOSNetDriver* GetDefaultObj()
	{
		return GetDefaultObjImpl<URedpointEOSNetDriver>();
	}
};
static_assert(alignof(URedpointEOSNetDriver) == 0x000008, "Wrong alignment on URedpointEOSNetDriver");
static_assert(sizeof(URedpointEOSNetDriver) == 0x000958, "Wrong size on URedpointEOSNetDriver");

}

