#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScentIcon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct ScentIcon.ScentIcon
// 0x0040 (0x0040 - 0x0000)
struct FScentIcon final
{
public:
	TScriptInterface<class ITIScentable>          Scentable_22_C2B6DAB347C191B620301BA3F604F48F;     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location_5_A8DFB8A1474FC87F95C798AC3B8A0CE9;       // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_8_C6F557A54B1680E6C541898AC42B7657;          // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ToRemove_10_3F29F0FE4B9642F394878F94AFAFC845;      // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeBeginDistance_19_90BD9E6D461F0A9EAAE10D888510855A; // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeEndDistance_20_3A01BAE04DFB00990197918497B06EB5; // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Pack_24_645DCFB44BF222637120E295C4E6D78B;          // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MigrationLeft_29_789DA58C415EB8E6DF2957AD8319CFE5; // 0x003D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MigrationRight_30_3234C2FB4B2638924A5AC1860D8D24BB; // 0x003E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FScentIcon) == 0x000008, "Wrong alignment on FScentIcon");
static_assert(sizeof(FScentIcon) == 0x000040, "Wrong size on FScentIcon");
static_assert(offsetof(FScentIcon, Scentable_22_C2B6DAB347C191B620301BA3F604F48F) == 0x000000, "Member 'FScentIcon::Scentable_22_C2B6DAB347C191B620301BA3F604F48F' has a wrong offset!");
static_assert(offsetof(FScentIcon, Location_5_A8DFB8A1474FC87F95C798AC3B8A0CE9) == 0x000010, "Member 'FScentIcon::Location_5_A8DFB8A1474FC87F95C798AC3B8A0CE9' has a wrong offset!");
static_assert(offsetof(FScentIcon, Image_8_C6F557A54B1680E6C541898AC42B7657) == 0x000028, "Member 'FScentIcon::Image_8_C6F557A54B1680E6C541898AC42B7657' has a wrong offset!");
static_assert(offsetof(FScentIcon, ToRemove_10_3F29F0FE4B9642F394878F94AFAFC845) == 0x000030, "Member 'FScentIcon::ToRemove_10_3F29F0FE4B9642F394878F94AFAFC845' has a wrong offset!");
static_assert(offsetof(FScentIcon, FadeBeginDistance_19_90BD9E6D461F0A9EAAE10D888510855A) == 0x000034, "Member 'FScentIcon::FadeBeginDistance_19_90BD9E6D461F0A9EAAE10D888510855A' has a wrong offset!");
static_assert(offsetof(FScentIcon, FadeEndDistance_20_3A01BAE04DFB00990197918497B06EB5) == 0x000038, "Member 'FScentIcon::FadeEndDistance_20_3A01BAE04DFB00990197918497B06EB5' has a wrong offset!");
static_assert(offsetof(FScentIcon, Pack_24_645DCFB44BF222637120E295C4E6D78B) == 0x00003C, "Member 'FScentIcon::Pack_24_645DCFB44BF222637120E295C4E6D78B' has a wrong offset!");
static_assert(offsetof(FScentIcon, MigrationLeft_29_789DA58C415EB8E6DF2957AD8319CFE5) == 0x00003D, "Member 'FScentIcon::MigrationLeft_29_789DA58C415EB8E6DF2957AD8319CFE5' has a wrong offset!");
static_assert(offsetof(FScentIcon, MigrationRight_30_3234C2FB4B2638924A5AC1860D8D24BB) == 0x00003E, "Member 'FScentIcon::MigrationRight_30_3234C2FB4B2638924A5AC1860D8D24BB' has a wrong offset!");

}

