#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SmartObjectsModule

#include "Basic.hpp"

#include "SmartObjectsModule_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "TargetingSystem_structs.hpp"
#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.AddMultipleSmartObjects
// 0x0018 (0x0018 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_AddMultipleSmartObjects final
{
public:
	TArray<class AActor*>                         SmartObjectActors;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_AddMultipleSmartObjects) == 0x000008, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_AddMultipleSmartObjects");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_AddMultipleSmartObjects) == 0x000018, "Wrong size on SmartObjectBlueprintFunctionLibrary_AddMultipleSmartObjects");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_AddMultipleSmartObjects, SmartObjectActors) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_AddMultipleSmartObjects::SmartObjectActors' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_AddMultipleSmartObjects, ReturnValue) == 0x000010, "Member 'SmartObjectBlueprintFunctionLibrary_AddMultipleSmartObjects::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.AddOrRemoveMultipleSmartObjects
// 0x0018 (0x0018 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_AddOrRemoveMultipleSmartObjects final
{
public:
	TArray<class AActor*>                         SmartObjectActors;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bAdd;                                              // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_AddOrRemoveMultipleSmartObjects) == 0x000008, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_AddOrRemoveMultipleSmartObjects");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_AddOrRemoveMultipleSmartObjects) == 0x000018, "Wrong size on SmartObjectBlueprintFunctionLibrary_AddOrRemoveMultipleSmartObjects");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_AddOrRemoveMultipleSmartObjects, SmartObjectActors) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_AddOrRemoveMultipleSmartObjects::SmartObjectActors' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_AddOrRemoveMultipleSmartObjects, bAdd) == 0x000010, "Member 'SmartObjectBlueprintFunctionLibrary_AddOrRemoveMultipleSmartObjects::bAdd' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_AddOrRemoveMultipleSmartObjects, ReturnValue) == 0x000011, "Member 'SmartObjectBlueprintFunctionLibrary_AddOrRemoveMultipleSmartObjects::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.AddOrRemoveSmartObject
// 0x0010 (0x0010 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_AddOrRemoveSmartObject final
{
public:
	class AActor*                                 SmartObject;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_AddOrRemoveSmartObject) == 0x000008, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_AddOrRemoveSmartObject");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_AddOrRemoveSmartObject) == 0x000010, "Wrong size on SmartObjectBlueprintFunctionLibrary_AddOrRemoveSmartObject");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_AddOrRemoveSmartObject, SmartObject) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_AddOrRemoveSmartObject::SmartObject' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_AddOrRemoveSmartObject, bEnabled) == 0x000008, "Member 'SmartObjectBlueprintFunctionLibrary_AddOrRemoveSmartObject::bEnabled' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_AddOrRemoveSmartObject, ReturnValue) == 0x000009, "Member 'SmartObjectBlueprintFunctionLibrary_AddOrRemoveSmartObject::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.AddSmartObject
// 0x0010 (0x0010 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_AddSmartObject final
{
public:
	class AActor*                                 SmartObjectActor;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_AddSmartObject) == 0x000008, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_AddSmartObject");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_AddSmartObject) == 0x000010, "Wrong size on SmartObjectBlueprintFunctionLibrary_AddSmartObject");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_AddSmartObject, SmartObjectActor) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_AddSmartObject::SmartObjectActor' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_AddSmartObject, ReturnValue) == 0x000008, "Member 'SmartObjectBlueprintFunctionLibrary_AddSmartObject::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.Conv_SmartObjectClaimHandleToString
// 0x0030 (0x0030 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectClaimHandleToString final
{
public:
	struct FSmartObjectClaimHandle                Result;                                            // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectClaimHandleToString) == 0x000008, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectClaimHandleToString");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectClaimHandleToString) == 0x000030, "Wrong size on SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectClaimHandleToString");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectClaimHandleToString, Result) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectClaimHandleToString::Result' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectClaimHandleToString, ReturnValue) == 0x000020, "Member 'SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectClaimHandleToString::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.Conv_SmartObjectDefinitionToString
// 0x0018 (0x0018 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectDefinitionToString final
{
public:
	const class USmartObjectDefinition*           Definition;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectDefinitionToString) == 0x000008, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectDefinitionToString");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectDefinitionToString) == 0x000018, "Wrong size on SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectDefinitionToString");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectDefinitionToString, Definition) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectDefinitionToString::Definition' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectDefinitionToString, ReturnValue) == 0x000008, "Member 'SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectDefinitionToString::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.Conv_SmartObjectHandleToString
// 0x0018 (0x0018 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectHandleToString final
{
public:
	struct FSmartObjectHandle                     Handle;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectHandleToString) == 0x000008, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectHandleToString");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectHandleToString) == 0x000018, "Wrong size on SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectHandleToString");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectHandleToString, Handle) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectHandleToString::Handle' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectHandleToString, ReturnValue) == 0x000008, "Member 'SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectHandleToString::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.Conv_SmartObjectRequestResultToString
// 0x0028 (0x0028 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectRequestResultToString final
{
public:
	struct FSmartObjectRequestResult              Result;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectRequestResultToString) == 0x000008, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectRequestResultToString");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectRequestResultToString) == 0x000028, "Wrong size on SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectRequestResultToString");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectRequestResultToString, Result) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectRequestResultToString::Result' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectRequestResultToString, ReturnValue) == 0x000018, "Member 'SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectRequestResultToString::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.Conv_SmartObjectSlotHandleToString
// 0x0020 (0x0020 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectSlotHandleToString final
{
public:
	struct FSmartObjectSlotHandle                 Handle;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectSlotHandleToString) == 0x000008, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectSlotHandleToString");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectSlotHandleToString) == 0x000020, "Wrong size on SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectSlotHandleToString");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectSlotHandleToString, Handle) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectSlotHandleToString::Handle' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectSlotHandleToString, ReturnValue) == 0x000010, "Member 'SmartObjectBlueprintFunctionLibrary_Conv_SmartObjectSlotHandleToString::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.Equal_SmartObjectHandleSmartObjectHandle
// 0x0018 (0x0018 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_Equal_SmartObjectHandleSmartObjectHandle final
{
public:
	struct FSmartObjectHandle                     A;                                                 // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSmartObjectHandle                     B;                                                 // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_Equal_SmartObjectHandleSmartObjectHandle) == 0x000008, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_Equal_SmartObjectHandleSmartObjectHandle");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_Equal_SmartObjectHandleSmartObjectHandle) == 0x000018, "Wrong size on SmartObjectBlueprintFunctionLibrary_Equal_SmartObjectHandleSmartObjectHandle");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_Equal_SmartObjectHandleSmartObjectHandle, A) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_Equal_SmartObjectHandleSmartObjectHandle::A' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_Equal_SmartObjectHandleSmartObjectHandle, B) == 0x000008, "Member 'SmartObjectBlueprintFunctionLibrary_Equal_SmartObjectHandleSmartObjectHandle::B' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_Equal_SmartObjectHandleSmartObjectHandle, ReturnValue) == 0x000010, "Member 'SmartObjectBlueprintFunctionLibrary_Equal_SmartObjectHandleSmartObjectHandle::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.Equal_SmartObjectSlotHandleSmartObjectSlotHandle
// 0x0028 (0x0028 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_Equal_SmartObjectSlotHandleSmartObjectSlotHandle final
{
public:
	struct FSmartObjectSlotHandle                 A;                                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSmartObjectSlotHandle                 B;                                                 // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_Equal_SmartObjectSlotHandleSmartObjectSlotHandle) == 0x000008, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_Equal_SmartObjectSlotHandleSmartObjectSlotHandle");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_Equal_SmartObjectSlotHandleSmartObjectSlotHandle) == 0x000028, "Wrong size on SmartObjectBlueprintFunctionLibrary_Equal_SmartObjectSlotHandleSmartObjectSlotHandle");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_Equal_SmartObjectSlotHandleSmartObjectSlotHandle, A) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_Equal_SmartObjectSlotHandleSmartObjectSlotHandle::A' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_Equal_SmartObjectSlotHandleSmartObjectSlotHandle, B) == 0x000010, "Member 'SmartObjectBlueprintFunctionLibrary_Equal_SmartObjectSlotHandleSmartObjectSlotHandle::B' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_Equal_SmartObjectSlotHandleSmartObjectSlotHandle, ReturnValue) == 0x000020, "Member 'SmartObjectBlueprintFunctionLibrary_Equal_SmartObjectSlotHandleSmartObjectSlotHandle::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.FindSmartObjectsInActor
// 0x0120 (0x0120 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInActor final
{
public:
	struct FSmartObjectRequestFilter              Filter;                                            // 0x0000(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class AActor*                                 SearchActor;                                       // 0x00F0(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSmartObjectRequestResult>      OutResults;                                        // 0x00F8(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	const class AActor*                           UserActor;                                         // 0x0108(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0110(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_111[0xF];                                      // 0x0111(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInActor) == 0x000010, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInActor");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInActor) == 0x000120, "Wrong size on SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInActor");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInActor, Filter) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInActor::Filter' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInActor, SearchActor) == 0x0000F0, "Member 'SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInActor::SearchActor' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInActor, OutResults) == 0x0000F8, "Member 'SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInActor::OutResults' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInActor, UserActor) == 0x000108, "Member 'SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInActor::UserActor' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInActor, ReturnValue) == 0x000110, "Member 'SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInActor::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.FindSmartObjectsInComponent
// 0x0120 (0x0120 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInComponent final
{
public:
	struct FSmartObjectRequestFilter              Filter;                                            // 0x0000(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class USmartObjectComponent*                  SmartObjectComponent;                              // 0x00F0(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSmartObjectRequestResult>      OutResults;                                        // 0x00F8(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	const class AActor*                           UserActor;                                         // 0x0108(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0110(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_111[0xF];                                      // 0x0111(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInComponent) == 0x000010, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInComponent");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInComponent) == 0x000120, "Wrong size on SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInComponent");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInComponent, Filter) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInComponent::Filter' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInComponent, SmartObjectComponent) == 0x0000F0, "Member 'SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInComponent::SmartObjectComponent' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInComponent, OutResults) == 0x0000F8, "Member 'SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInComponent::OutResults' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInComponent, UserActor) == 0x000108, "Member 'SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInComponent::UserActor' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInComponent, ReturnValue) == 0x000110, "Member 'SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInComponent::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.FindSmartObjectsInList
// 0x0130 (0x0130 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInList final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSmartObjectRequestFilter              Filter;                                            // 0x0010(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         ActorList;                                         // 0x0100(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FSmartObjectRequestResult>      OutResults;                                        // 0x0110(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	const class AActor*                           UserActor;                                         // 0x0120(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0128(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInList) == 0x000010, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInList");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInList) == 0x000130, "Wrong size on SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInList");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInList, WorldContextObject) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInList::WorldContextObject' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInList, Filter) == 0x000010, "Member 'SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInList::Filter' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInList, ActorList) == 0x000100, "Member 'SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInList::ActorList' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInList, OutResults) == 0x000110, "Member 'SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInList::OutResults' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInList, UserActor) == 0x000120, "Member 'SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInList::UserActor' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInList, ReturnValue) == 0x000128, "Member 'SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInList::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.FindSmartObjectsInTargetingRequest
// 0x0130 (0x0130 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInTargetingRequest final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSmartObjectRequestFilter              Filter;                                            // 0x0010(0x00F0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTargetingRequestHandle                TargetingHandle;                                   // 0x0100(0x0004)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSmartObjectRequestResult>      OutResults;                                        // 0x0108(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	const class AActor*                           UserActor;                                         // 0x0118(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0120(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_121[0xF];                                      // 0x0121(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInTargetingRequest) == 0x000010, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInTargetingRequest");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInTargetingRequest) == 0x000130, "Wrong size on SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInTargetingRequest");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInTargetingRequest, WorldContextObject) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInTargetingRequest::WorldContextObject' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInTargetingRequest, Filter) == 0x000010, "Member 'SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInTargetingRequest::Filter' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInTargetingRequest, TargetingHandle) == 0x000100, "Member 'SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInTargetingRequest::TargetingHandle' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInTargetingRequest, OutResults) == 0x000108, "Member 'SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInTargetingRequest::OutResults' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInTargetingRequest, UserActor) == 0x000118, "Member 'SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInTargetingRequest::UserActor' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInTargetingRequest, ReturnValue) == 0x000120, "Member 'SmartObjectBlueprintFunctionLibrary_FindSmartObjectsInTargetingRequest::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.GetBlackboardValueAsSOClaimHandle
// 0x0050 (0x0050 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_GetBlackboardValueAsSOClaimHandle final
{
public:
	class UBTNode*                                NodeOwner;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 Key;                                               // 0x0008(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSmartObjectClaimHandle                ReturnValue;                                       // 0x0030(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_GetBlackboardValueAsSOClaimHandle) == 0x000008, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_GetBlackboardValueAsSOClaimHandle");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_GetBlackboardValueAsSOClaimHandle) == 0x000050, "Wrong size on SmartObjectBlueprintFunctionLibrary_GetBlackboardValueAsSOClaimHandle");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_GetBlackboardValueAsSOClaimHandle, NodeOwner) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_GetBlackboardValueAsSOClaimHandle::NodeOwner' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_GetBlackboardValueAsSOClaimHandle, Key) == 0x000008, "Member 'SmartObjectBlueprintFunctionLibrary_GetBlackboardValueAsSOClaimHandle::Key' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_GetBlackboardValueAsSOClaimHandle, ReturnValue) == 0x000030, "Member 'SmartObjectBlueprintFunctionLibrary_GetBlackboardValueAsSOClaimHandle::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.GetValueAsSOClaimHandle
// 0x0030 (0x0030 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_GetValueAsSOClaimHandle final
{
public:
	class UBlackboardComponent*                   BlackboardComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   KeyName;                                           // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSmartObjectClaimHandle                ReturnValue;                                       // 0x0010(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_GetValueAsSOClaimHandle) == 0x000008, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_GetValueAsSOClaimHandle");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_GetValueAsSOClaimHandle) == 0x000030, "Wrong size on SmartObjectBlueprintFunctionLibrary_GetValueAsSOClaimHandle");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_GetValueAsSOClaimHandle, BlackboardComponent) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_GetValueAsSOClaimHandle::BlackboardComponent' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_GetValueAsSOClaimHandle, KeyName) == 0x000008, "Member 'SmartObjectBlueprintFunctionLibrary_GetValueAsSOClaimHandle::KeyName' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_GetValueAsSOClaimHandle, ReturnValue) == 0x000010, "Member 'SmartObjectBlueprintFunctionLibrary_GetValueAsSOClaimHandle::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.IsValidSmartObjectClaimHandle
// 0x0028 (0x0028 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectClaimHandle final
{
public:
	struct FSmartObjectClaimHandle                Handle;                                            // 0x0000(0x0020)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectClaimHandle) == 0x000008, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectClaimHandle");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectClaimHandle) == 0x000028, "Wrong size on SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectClaimHandle");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectClaimHandle, Handle) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectClaimHandle::Handle' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectClaimHandle, ReturnValue) == 0x000020, "Member 'SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectClaimHandle::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.IsValidSmartObjectHandle
// 0x0010 (0x0010 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectHandle final
{
public:
	struct FSmartObjectHandle                     Handle;                                            // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectHandle) == 0x000008, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectHandle");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectHandle) == 0x000010, "Wrong size on SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectHandle");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectHandle, Handle) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectHandle::Handle' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectHandle, ReturnValue) == 0x000008, "Member 'SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectHandle::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.IsValidSmartObjectSlotHandle
// 0x0018 (0x0018 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectSlotHandle final
{
public:
	struct FSmartObjectSlotHandle                 Handle;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectSlotHandle) == 0x000008, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectSlotHandle");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectSlotHandle) == 0x000018, "Wrong size on SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectSlotHandle");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectSlotHandle, Handle) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectSlotHandle::Handle' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectSlotHandle, ReturnValue) == 0x000010, "Member 'SmartObjectBlueprintFunctionLibrary_IsValidSmartObjectSlotHandle::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.MarkSmartObjectSlotAsClaimed
// 0x0048 (0x0048 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsClaimed final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSmartObjectSlotHandle                 SlotHandle;                                        // 0x0008(0x0010)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           UserActor;                                         // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESmartObjectClaimPriority                     ClaimPriority;                                     // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSmartObjectClaimHandle                ReturnValue;                                       // 0x0028(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsClaimed) == 0x000008, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsClaimed");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsClaimed) == 0x000048, "Wrong size on SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsClaimed");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsClaimed, WorldContextObject) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsClaimed::WorldContextObject' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsClaimed, SlotHandle) == 0x000008, "Member 'SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsClaimed::SlotHandle' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsClaimed, UserActor) == 0x000018, "Member 'SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsClaimed::UserActor' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsClaimed, ClaimPriority) == 0x000020, "Member 'SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsClaimed::ClaimPriority' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsClaimed, ReturnValue) == 0x000028, "Member 'SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsClaimed::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.MarkSmartObjectSlotAsFree
// 0x0030 (0x0030 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsFree final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSmartObjectClaimHandle                ClaimHandle;                                       // 0x0008(0x0020)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsFree) == 0x000008, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsFree");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsFree) == 0x000030, "Wrong size on SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsFree");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsFree, WorldContextObject) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsFree::WorldContextObject' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsFree, ClaimHandle) == 0x000008, "Member 'SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsFree::ClaimHandle' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsFree, ReturnValue) == 0x000028, "Member 'SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsFree::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.MarkSmartObjectSlotAsOccupied
// 0x0038 (0x0038 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsOccupied final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSmartObjectClaimHandle                ClaimHandle;                                       // 0x0008(0x0020)(ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	TSubclassOf<class USmartObjectBehaviorDefinition> DefinitionClass;                               // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class USmartObjectBehaviorDefinition*   ReturnValue;                                       // 0x0030(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsOccupied) == 0x000008, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsOccupied");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsOccupied) == 0x000038, "Wrong size on SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsOccupied");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsOccupied, WorldContextObject) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsOccupied::WorldContextObject' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsOccupied, ClaimHandle) == 0x000008, "Member 'SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsOccupied::ClaimHandle' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsOccupied, DefinitionClass) == 0x000028, "Member 'SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsOccupied::DefinitionClass' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsOccupied, ReturnValue) == 0x000030, "Member 'SmartObjectBlueprintFunctionLibrary_MarkSmartObjectSlotAsOccupied::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.NotEqual_SmartObjectHandleSmartObjectHandle
// 0x0018 (0x0018 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_NotEqual_SmartObjectHandleSmartObjectHandle final
{
public:
	struct FSmartObjectHandle                     A;                                                 // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSmartObjectHandle                     B;                                                 // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_NotEqual_SmartObjectHandleSmartObjectHandle) == 0x000008, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_NotEqual_SmartObjectHandleSmartObjectHandle");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_NotEqual_SmartObjectHandleSmartObjectHandle) == 0x000018, "Wrong size on SmartObjectBlueprintFunctionLibrary_NotEqual_SmartObjectHandleSmartObjectHandle");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_NotEqual_SmartObjectHandleSmartObjectHandle, A) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_NotEqual_SmartObjectHandleSmartObjectHandle::A' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_NotEqual_SmartObjectHandleSmartObjectHandle, B) == 0x000008, "Member 'SmartObjectBlueprintFunctionLibrary_NotEqual_SmartObjectHandleSmartObjectHandle::B' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_NotEqual_SmartObjectHandleSmartObjectHandle, ReturnValue) == 0x000010, "Member 'SmartObjectBlueprintFunctionLibrary_NotEqual_SmartObjectHandleSmartObjectHandle::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.NotEqual_SmartObjectSlotHandleSmartObjectSlotHandle
// 0x0028 (0x0028 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_NotEqual_SmartObjectSlotHandleSmartObjectSlotHandle final
{
public:
	struct FSmartObjectSlotHandle                 A;                                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSmartObjectSlotHandle                 B;                                                 // 0x0010(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_NotEqual_SmartObjectSlotHandleSmartObjectSlotHandle) == 0x000008, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_NotEqual_SmartObjectSlotHandleSmartObjectSlotHandle");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_NotEqual_SmartObjectSlotHandleSmartObjectSlotHandle) == 0x000028, "Wrong size on SmartObjectBlueprintFunctionLibrary_NotEqual_SmartObjectSlotHandleSmartObjectSlotHandle");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_NotEqual_SmartObjectSlotHandleSmartObjectSlotHandle, A) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_NotEqual_SmartObjectSlotHandleSmartObjectSlotHandle::A' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_NotEqual_SmartObjectSlotHandleSmartObjectSlotHandle, B) == 0x000010, "Member 'SmartObjectBlueprintFunctionLibrary_NotEqual_SmartObjectSlotHandleSmartObjectSlotHandle::B' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_NotEqual_SmartObjectSlotHandleSmartObjectSlotHandle, ReturnValue) == 0x000020, "Member 'SmartObjectBlueprintFunctionLibrary_NotEqual_SmartObjectSlotHandleSmartObjectSlotHandle::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.RemoveMultipleSmartObjects
// 0x0018 (0x0018 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_RemoveMultipleSmartObjects final
{
public:
	TArray<class AActor*>                         SmartObjectActors;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_RemoveMultipleSmartObjects) == 0x000008, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_RemoveMultipleSmartObjects");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_RemoveMultipleSmartObjects) == 0x000018, "Wrong size on SmartObjectBlueprintFunctionLibrary_RemoveMultipleSmartObjects");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_RemoveMultipleSmartObjects, SmartObjectActors) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_RemoveMultipleSmartObjects::SmartObjectActors' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_RemoveMultipleSmartObjects, ReturnValue) == 0x000010, "Member 'SmartObjectBlueprintFunctionLibrary_RemoveMultipleSmartObjects::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.RemoveSmartObject
// 0x0010 (0x0010 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_RemoveSmartObject final
{
public:
	class AActor*                                 SmartObjectActor;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_RemoveSmartObject) == 0x000008, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_RemoveSmartObject");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_RemoveSmartObject) == 0x000010, "Wrong size on SmartObjectBlueprintFunctionLibrary_RemoveSmartObject");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_RemoveSmartObject, SmartObjectActor) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_RemoveSmartObject::SmartObjectActor' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_RemoveSmartObject, ReturnValue) == 0x000008, "Member 'SmartObjectBlueprintFunctionLibrary_RemoveSmartObject::ReturnValue' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.SetBlackboardValueAsSOClaimHandle
// 0x0050 (0x0050 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_SetBlackboardValueAsSOClaimHandle final
{
public:
	class UBTNode*                                NodeOwner;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                 Key;                                               // 0x0008(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSmartObjectClaimHandle                Value;                                             // 0x0030(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_SetBlackboardValueAsSOClaimHandle) == 0x000008, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_SetBlackboardValueAsSOClaimHandle");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_SetBlackboardValueAsSOClaimHandle) == 0x000050, "Wrong size on SmartObjectBlueprintFunctionLibrary_SetBlackboardValueAsSOClaimHandle");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_SetBlackboardValueAsSOClaimHandle, NodeOwner) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_SetBlackboardValueAsSOClaimHandle::NodeOwner' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_SetBlackboardValueAsSOClaimHandle, Key) == 0x000008, "Member 'SmartObjectBlueprintFunctionLibrary_SetBlackboardValueAsSOClaimHandle::Key' has a wrong offset!");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_SetBlackboardValueAsSOClaimHandle, Value) == 0x000030, "Member 'SmartObjectBlueprintFunctionLibrary_SetBlackboardValueAsSOClaimHandle::Value' has a wrong offset!");

// Function SmartObjectsModule.SmartObjectBlueprintFunctionLibrary.SetMultipleSmartObjectsEnabled
// 0x0018 (0x0018 - 0x0000)
struct SmartObjectBlueprintFunctionLibrary_SetMultipleSmartObjectsEnabled final
{
public:
	TArray<class AActor*>                         SmartObjectActors;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bEnabled;                                          // 0x0010(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SmartObjectBlueprintFunctionLibrary_SetMultipleSmartObjectsEnabled) == 0x000008, "Wrong alignment on SmartObjectBlueprintFunctionLibrary_SetMultipleSmartObjectsEnabled");
static_assert(sizeof(SmartObjectBlueprintFunctionLibrary_SetMultipleSmartObjectsEnabled) == 0x000018, "Wrong size on SmartObjectBlueprintFunctionLibrary_SetMultipleSmartObjectsEnabled");
static_assert(offsetof(SmartObjectBlueprintFunctionLibrary_SetMultipleSmartObjectsEnabled, SmartObjectActors) == 0x000000, "Member 'SmartObjectBlueprintFunctionLibrary_SetMultipleSmartObjectsEnabled::SmartObjectActors' has a wrong offset!");
