#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_WatermarkSetting

#include "Basic.hpp"

#include "E_WatermarkSetting_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_WatermarkSetting.ST_WatermarkSetting
// 0x0018 (0x0018 - 0x0000)
struct FST_WatermarkSetting final
{
public:
	E_WatermarkSetting                            Selected_10_14889B0647C1ED276D93FD817DDAC582;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Opacity_8_35DBF7214EE98822CB5D9AB09478978A;        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WatermarkAnim_12_BDD32BA64A56ED4EDB86FDA67D1C244A; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FST_WatermarkSetting) == 0x000008, "Wrong alignment on FST_WatermarkSetting");
static_assert(sizeof(FST_WatermarkSetting) == 0x000018, "Wrong size on FST_WatermarkSetting");
static_assert(offsetof(FST_WatermarkSetting, Selected_10_14889B0647C1ED276D93FD817DDAC582) == 0x000000, "Member 'FST_WatermarkSetting::Selected_10_14889B0647C1ED276D93FD817DDAC582' has a wrong offset!");
static_assert(offsetof(FST_WatermarkSetting, Opacity_8_35DBF7214EE98822CB5D9AB09478978A) == 0x000008, "Member 'FST_WatermarkSetting::Opacity_8_35DBF7214EE98822CB5D9AB09478978A' has a wrong offset!");
static_assert(offsetof(FST_WatermarkSetting, WatermarkAnim_12_BDD32BA64A56ED4EDB86FDA67D1C244A) == 0x000010, "Member 'FST_WatermarkSetting::WatermarkAnim_12_BDD32BA64A56ED4EDB86FDA67D1C244A' has a wrong offset!");

}

