#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_AttachRiver

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_AttachRiver.Struct_AttachRiver
// 0x0020 (0x0020 - 0x0000)
struct FStruct_AttachRiver final
{
public:
	class ABP_FlowmapRiverSystem_C*               AttachBeginning_12_C382435048719A7D80BF9288E4A7D726; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         AttachBeginningIndex_14_F8A286C74B6A9E65EB3228B6DA6BCACF; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FlowmapRiverSystem_C*               AttachEnd_13_E51A7D1B4C23E5E524860489748283C9;     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         AttachEndIndex_17_85951667434FF824BE65D6B01AB0D21F; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_AttachRiver) == 0x000008, "Wrong alignment on FStruct_AttachRiver");
static_assert(sizeof(FStruct_AttachRiver) == 0x000020, "Wrong size on FStruct_AttachRiver");
static_assert(offsetof(FStruct_AttachRiver, AttachBeginning_12_C382435048719A7D80BF9288E4A7D726) == 0x000000, "Member 'FStruct_AttachRiver::AttachBeginning_12_C382435048719A7D80BF9288E4A7D726' has a wrong offset!");
static_assert(offsetof(FStruct_AttachRiver, AttachBeginningIndex_14_F8A286C74B6A9E65EB3228B6DA6BCACF) == 0x000008, "Member 'FStruct_AttachRiver::AttachBeginningIndex_14_F8A286C74B6A9E65EB3228B6DA6BCACF' has a wrong offset!");
static_assert(offsetof(FStruct_AttachRiver, AttachEnd_13_E51A7D1B4C23E5E524860489748283C9) == 0x000010, "Member 'FStruct_AttachRiver::AttachEnd_13_E51A7D1B4C23E5E524860489748283C9' has a wrong offset!");
static_assert(offsetof(FStruct_AttachRiver, AttachEndIndex_17_85951667434FF824BE65D6B01AB0D21F) == 0x000018, "Member 'FStruct_AttachRiver::AttachEndIndex_17_85951667434FF824BE65D6B01AB0D21F' has a wrong offset!");

}

