#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TargetingSystem

#include "Basic.hpp"

#include "TargetingSystem_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class TargetingSystem.AbilityTask_PerformTargeting
// 0x0030 (0x00B0 - 0x0080)
class UAbilityTask_PerformTargeting final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(const struct FTargetingRequestHandle& TargetingRequestHandle)> OnTargetReady; // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x20];                                      // 0x0090(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_PerformTargeting* PerformFilteringRequest(class UGameplayAbility* OwningAbility, class UTargetingPreset* TargetingPreset, const TArray<class AActor*>& InTargets, bool bAllowAsync);
	static class UAbilityTask_PerformTargeting* PerformTargetingRequest(class UGameplayAbility* OwningAbility, class UTargetingPreset* InTargetingPreset, bool bAllowAsync);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbilityTask_PerformTargeting">();
	}
	static class UAbilityTask_PerformTargeting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_PerformTargeting>();
	}
};
static_assert(alignof(UAbilityTask_PerformTargeting) == 0x000008, "Wrong alignment on UAbilityTask_PerformTargeting");
static_assert(sizeof(UAbilityTask_PerformTargeting) == 0x0000B0, "Wrong size on UAbilityTask_PerformTargeting");
static_assert(offsetof(UAbilityTask_PerformTargeting, OnTargetReady) == 0x000080, "Member 'UAbilityTask_PerformTargeting::OnTargetReady' has a wrong offset!");

// Class TargetingSystem.AsyncAction_PerformTargeting
// 0x0038 (0x0068 - 0x0030)
class UAsyncAction_PerformTargeting final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FTargetingRequestHandle& TargetingHandle)> Targeted;  // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UTargetingPreset*                       TargetingPreset;                                   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class AActor>                  WeakSourceActor;                                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                         InitialTargets;                                    // 0x0050(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FTargetingRequestHandle                TargetingHandle;                                   // 0x0060(0x0004)(NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         bUseAsyncTargeting : 1;                            // 0x0064(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncAction_PerformTargeting* PerformFilteringRequest(class AActor* SourceActor, class UTargetingPreset* TargetingPreset_0, bool bUseAsyncTargeting_0, const TArray<class AActor*>& InTargets);
	static class UAsyncAction_PerformTargeting* PerformTargetingRequest(class AActor* SourceActor, class UTargetingPreset* TargetingPreset_0, bool bUseAsyncTargeting_0);

	struct FTargetingRequestHandle GetTargetingHandle() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AsyncAction_PerformTargeting">();
	}
	static class UAsyncAction_PerformTargeting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAction_PerformTargeting>();
	}
};
static_assert(alignof(UAsyncAction_PerformTargeting) == 0x000008, "Wrong alignment on UAsyncAction_PerformTargeting");
static_assert(sizeof(UAsyncAction_PerformTargeting) == 0x000068, "Wrong size on UAsyncAction_PerformTargeting");
static_assert(offsetof(UAsyncAction_PerformTargeting, Targeted) == 0x000030, "Member 'UAsyncAction_PerformTargeting::Targeted' has a wrong offset!");
static_assert(offsetof(UAsyncAction_PerformTargeting, TargetingPreset) == 0x000040, "Member 'UAsyncAction_PerformTargeting::TargetingPreset' has a wrong offset!");
static_assert(offsetof(UAsyncAction_PerformTargeting, WeakSourceActor) == 0x000048, "Member 'UAsyncAction_PerformTargeting::WeakSourceActor' has a wrong offset!");
static_assert(offsetof(UAsyncAction_PerformTargeting, InitialTargets) == 0x000050, "Member 'UAsyncAction_PerformTargeting::InitialTargets' has a wrong offset!");
static_assert(offsetof(UAsyncAction_PerformTargeting, TargetingHandle) == 0x000060, "Member 'UAsyncAction_PerformTargeting::TargetingHandle' has a wrong offset!");

// Class TargetingSystem.TargetingTask
// 0x0000 (0x0028 - 0x0028)
class UTargetingTask : public UObject
{
public:
	class UTargetingSubsystem* GetTargetingSubsystem(const struct FTargetingRequestHandle& TargetingHandle) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingTask">();
	}
	static class UTargetingTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingTask>();
	}
};
static_assert(alignof(UTargetingTask) == 0x000008, "Wrong alignment on UTargetingTask");
static_assert(sizeof(UTargetingTask) == 0x000028, "Wrong size on UTargetingTask");

// Class TargetingSystem.TargetingFilterTask_BasicFilterTemplate
// 0x0000 (0x0028 - 0x0028)
class UTargetingFilterTask_BasicFilterTemplate : public UTargetingTask
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingFilterTask_BasicFilterTemplate">();
	}
	static class UTargetingFilterTask_BasicFilterTemplate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingFilterTask_BasicFilterTemplate>();
	}
};
static_assert(alignof(UTargetingFilterTask_BasicFilterTemplate) == 0x000008, "Wrong alignment on UTargetingFilterTask_BasicFilterTemplate");
static_assert(sizeof(UTargetingFilterTask_BasicFilterTemplate) == 0x000028, "Wrong size on UTargetingFilterTask_BasicFilterTemplate");

// Class TargetingSystem.SimpleTargetingFilterTask
// 0x0000 (0x0028 - 0x0028)
class USimpleTargetingFilterTask final : public UTargetingFilterTask_BasicFilterTemplate
{
public:
	bool BP_ShouldFilterTarget(const struct FTargetingRequestHandle& TargetingHandle, const struct FTargetingDefaultResultData& TargetData) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimpleTargetingFilterTask">();
	}
	static class USimpleTargetingFilterTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleTargetingFilterTask>();
	}
};
static_assert(alignof(USimpleTargetingFilterTask) == 0x000008, "Wrong alignment on USimpleTargetingFilterTask");
static_assert(sizeof(USimpleTargetingFilterTask) == 0x000028, "Wrong size on USimpleTargetingFilterTask");

// Class TargetingSystem.SimpleTargetingSelectionTask
// 0x0000 (0x0028 - 0x0028)
class USimpleTargetingSelectionTask final : public UTargetingTask
{
public:
	bool AddHitResult(const struct FTargetingRequestHandle& TargetingHandle, const struct FHitResult& HitResult) const;
	bool AddTargetActor(const struct FTargetingRequestHandle& TargetingHandle, class AActor* Actor) const;
	void SelectTargets(const struct FTargetingRequestHandle& TargetingHandle, const struct FTargetingSourceContext& SourceContext) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimpleTargetingSelectionTask">();
	}
	static class USimpleTargetingSelectionTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleTargetingSelectionTask>();
	}
};
static_assert(alignof(USimpleTargetingSelectionTask) == 0x000008, "Wrong alignment on USimpleTargetingSelectionTask");
static_assert(sizeof(USimpleTargetingSelectionTask) == 0x000028, "Wrong size on USimpleTargetingSelectionTask");

// Class TargetingSystem.TargetingSortTask_Base
// 0x0008 (0x0030 - 0x0028)
class UTargetingSortTask_Base : public UTargetingTask
{
public:
	uint8                                         bAscending : 1;                                    // 0x0028(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingSortTask_Base">();
	}
	static class UTargetingSortTask_Base* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingSortTask_Base>();
	}
};
static_assert(alignof(UTargetingSortTask_Base) == 0x000008, "Wrong alignment on UTargetingSortTask_Base");
static_assert(sizeof(UTargetingSortTask_Base) == 0x000030, "Wrong size on UTargetingSortTask_Base");

// Class TargetingSystem.SimpleTargetingSortTask
// 0x0000 (0x0030 - 0x0030)
class USimpleTargetingSortTask final : public UTargetingSortTask_Base
{
public:
	float BP_GetScoreForTarget(const struct FTargetingRequestHandle& TargetingHandle, const struct FTargetingDefaultResultData& TargetData) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SimpleTargetingSortTask">();
	}
	static class USimpleTargetingSortTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleTargetingSortTask>();
	}
};
static_assert(alignof(USimpleTargetingSortTask) == 0x000008, "Wrong alignment on USimpleTargetingSortTask");
static_assert(sizeof(USimpleTargetingSortTask) == 0x000030, "Wrong size on USimpleTargetingSortTask");

// Class TargetingSystem.TargetingFilterTask_ActorClass
// 0x0020 (0x0048 - 0x0028)
class UTargetingFilterTask_ActorClass final : public UTargetingFilterTask_BasicFilterTemplate
{
public:
	TArray<TSubclassOf<class UObject>>            RequiredActorClassFilters;                         // 0x0028(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class UObject>>            IgnoredActorClassFilters;                          // 0x0038(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingFilterTask_ActorClass">();
	}
	static class UTargetingFilterTask_ActorClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingFilterTask_ActorClass>();
	}
};
static_assert(alignof(UTargetingFilterTask_ActorClass) == 0x000008, "Wrong alignment on UTargetingFilterTask_ActorClass");
static_assert(sizeof(UTargetingFilterTask_ActorClass) == 0x000048, "Wrong size on UTargetingFilterTask_ActorClass");
static_assert(offsetof(UTargetingFilterTask_ActorClass, RequiredActorClassFilters) == 0x000028, "Member 'UTargetingFilterTask_ActorClass::RequiredActorClassFilters' has a wrong offset!");
static_assert(offsetof(UTargetingFilterTask_ActorClass, IgnoredActorClassFilters) == 0x000038, "Member 'UTargetingFilterTask_ActorClass::IgnoredActorClassFilters' has a wrong offset!");

// Class TargetingSystem.TargetingPreset
// 0x0010 (0x0040 - 0x0030)
class UTargetingPreset final : public UDataAsset
{
public:
	struct FTargetingTaskSet                      TargetingTaskSet;                                  // 0x0030(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingPreset">();
	}
	static class UTargetingPreset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingPreset>();
	}
};
static_assert(alignof(UTargetingPreset) == 0x000008, "Wrong alignment on UTargetingPreset");
static_assert(sizeof(UTargetingPreset) == 0x000040, "Wrong size on UTargetingPreset");
static_assert(offsetof(UTargetingPreset, TargetingTaskSet) == 0x000030, "Member 'UTargetingPreset::TargetingTaskSet' has a wrong offset!");

// Class TargetingSystem.TargetingSelectionTask_AOE
// 0x00B0 (0x00D8 - 0x0028)
class UTargetingSelectionTask_AOE final : public UTargetingTask
{
public:
	ETargetingAOEShape                            ShapeType;                                         // 0x0028(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECollisionChannel                             CollisionChannel;                                  // 0x0029(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCollisionProfileName                  CollisionProfileName;                              // 0x002C(0x0008)(Edit, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      CollisionObjectTypes;                              // 0x0038(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FVector                                DefaultSourceOffset;                               // 0x0048(0x0018)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bUseRelativeOffset : 1;                            // 0x0060(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bIgnoreSourceActor : 1;                            // 0x0060(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bIgnoreInstigatorActor : 1;                        // 0x0060(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bTraceComplex : 1;                                 // 0x0060(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HalfExtent;                                        // 0x0068(0x0018)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FScalableFloat                         Radius;                                            // 0x0080(0x0028)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         HalfHeight;                                        // 0x00A8(0x0028)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FName                                   ComponentTag;                                      // 0x00D0(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	struct FVector GetSourceLocation(const struct FTargetingRequestHandle& TargetingHandle) const;
	struct FVector GetSourceOffset(const struct FTargetingRequestHandle& TargetingHandle) const;
	struct FQuat GetSourceRotation(const struct FTargetingRequestHandle& TargetingHandle) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingSelectionTask_AOE">();
	}
	static class UTargetingSelectionTask_AOE* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingSelectionTask_AOE>();
	}
};
static_assert(alignof(UTargetingSelectionTask_AOE) == 0x000008, "Wrong alignment on UTargetingSelectionTask_AOE");
static_assert(sizeof(UTargetingSelectionTask_AOE) == 0x0000D8, "Wrong size on UTargetingSelectionTask_AOE");
static_assert(offsetof(UTargetingSelectionTask_AOE, ShapeType) == 0x000028, "Member 'UTargetingSelectionTask_AOE::ShapeType' has a wrong offset!");
static_assert(offsetof(UTargetingSelectionTask_AOE, CollisionChannel) == 0x000029, "Member 'UTargetingSelectionTask_AOE::CollisionChannel' has a wrong offset!");
static_assert(offsetof(UTargetingSelectionTask_AOE, CollisionProfileName) == 0x00002C, "Member 'UTargetingSelectionTask_AOE::CollisionProfileName' has a wrong offset!");
static_assert(offsetof(UTargetingSelectionTask_AOE, CollisionObjectTypes) == 0x000038, "Member 'UTargetingSelectionTask_AOE::CollisionObjectTypes' has a wrong offset!");
static_assert(offsetof(UTargetingSelectionTask_AOE, DefaultSourceOffset) == 0x000048, "Member 'UTargetingSelectionTask_AOE::DefaultSourceOffset' has a wrong offset!");
static_assert(offsetof(UTargetingSelectionTask_AOE, HalfExtent) == 0x000068, "Member 'UTargetingSelectionTask_AOE::HalfExtent' has a wrong offset!");
static_assert(offsetof(UTargetingSelectionTask_AOE, Radius) == 0x000080, "Member 'UTargetingSelectionTask_AOE::Radius' has a wrong offset!");
static_assert(offsetof(UTargetingSelectionTask_AOE, HalfHeight) == 0x0000A8, "Member 'UTargetingSelectionTask_AOE::HalfHeight' has a wrong offset!");
static_assert(offsetof(UTargetingSelectionTask_AOE, ComponentTag) == 0x0000D0, "Member 'UTargetingSelectionTask_AOE::ComponentTag' has a wrong offset!");

// Class TargetingSystem.TargetingSelectionTask_SourceActor
// 0x0000 (0x0028 - 0x0028)
class UTargetingSelectionTask_SourceActor final : public UTargetingTask
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingSelectionTask_SourceActor">();
	}
	static class UTargetingSelectionTask_SourceActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingSelectionTask_SourceActor>();
	}
};
static_assert(alignof(UTargetingSelectionTask_SourceActor) == 0x000008, "Wrong alignment on UTargetingSelectionTask_SourceActor");
static_assert(sizeof(UTargetingSelectionTask_SourceActor) == 0x000028, "Wrong size on UTargetingSelectionTask_SourceActor");

// Class TargetingSystem.TargetingSelectionTask_Trace
// 0x0150 (0x0178 - 0x0028)
class UTargetingSelectionTask_Trace final : public UTargetingTask
{
public:
	ETargetingTraceType                           TraceType;                                         // 0x0028(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ETraceTypeQuery                               TraceChannel;                                      // 0x0029(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCollisionProfileName                  CollisionProfileName;                              // 0x002C(0x0008)(Edit, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         DefaultSweptTraceRadius;                           // 0x0038(0x0028)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DefaultSweptTraceCapsuleHalfHeight;                // 0x0060(0x0028)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DefaultSweptTraceBoxHalfExtentX;                   // 0x0088(0x0028)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DefaultSweptTraceBoxHalfExtentY;                   // 0x00B0(0x0028)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DefaultSweptTraceBoxHalfExtentZ;                   // 0x00D8(0x0028)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FRotator                               DefaultSweptTraceRotation;                         // 0x0100(0x0018)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FScalableFloat                         DefaultTraceLength;                                // 0x0118(0x0028)(Edit, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FVector                                DefaultSourceOffset;                               // 0x0140(0x0018)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                ExplicitTraceDirection;                            // 0x0158(0x0018)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bComplexTrace : 1;                                 // 0x0170(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bIgnoreSourceActor : 1;                            // 0x0170(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bIgnoreInstigatorActor : 1;                        // 0x0170(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void GetAdditionalActorsToIgnore(const struct FTargetingRequestHandle& TargetingHandle, TArray<class AActor*>* OutAdditionalActorsToIgnore) const;
	struct FVector GetSourceLocation(const struct FTargetingRequestHandle& TargetingHandle) const;
	struct FVector GetSourceOffset(const struct FTargetingRequestHandle& TargetingHandle) const;
	struct FVector GetSweptTraceBoxHalfExtents(const struct FTargetingRequestHandle& TargetingHandle) const;
	float GetSweptTraceCapsuleHalfHeight(const struct FTargetingRequestHandle& TargetingHandle) const;
	float GetSweptTraceRadius(const struct FTargetingRequestHandle& TargetingHandle) const;
	struct FRotator GetSweptTraceRotation(const struct FTargetingRequestHandle& TargetingHandle) const;
	struct FVector GetTraceDirection(const struct FTargetingRequestHandle& TargetingHandle) const;
	float GetTraceLength(const struct FTargetingRequestHandle& TargetingHandle) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingSelectionTask_Trace">();
	}
	static class UTargetingSelectionTask_Trace* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingSelectionTask_Trace>();
	}
};
static_assert(alignof(UTargetingSelectionTask_Trace) == 0x000008, "Wrong alignment on UTargetingSelectionTask_Trace");
static_assert(sizeof(UTargetingSelectionTask_Trace) == 0x000178, "Wrong size on UTargetingSelectionTask_Trace");
static_assert(offsetof(UTargetingSelectionTask_Trace, TraceType) == 0x000028, "Member 'UTargetingSelectionTask_Trace::TraceType' has a wrong offset!");
static_assert(offsetof(UTargetingSelectionTask_Trace, TraceChannel) == 0x000029, "Member 'UTargetingSelectionTask_Trace::TraceChannel' has a wrong offset!");
static_assert(offsetof(UTargetingSelectionTask_Trace, CollisionProfileName) == 0x00002C, "Member 'UTargetingSelectionTask_Trace::CollisionProfileName' has a wrong offset!");
static_assert(offsetof(UTargetingSelectionTask_Trace, DefaultSweptTraceRadius) == 0x000038, "Member 'UTargetingSelectionTask_Trace::DefaultSweptTraceRadius' has a wrong offset!");
static_assert(offsetof(UTargetingSelectionTask_Trace, DefaultSweptTraceCapsuleHalfHeight) == 0x000060, "Member 'UTargetingSelectionTask_Trace::DefaultSweptTraceCapsuleHalfHeight' has a wrong offset!");
static_assert(offsetof(UTargetingSelectionTask_Trace, DefaultSweptTraceBoxHalfExtentX) == 0x000088, "Member 'UTargetingSelectionTask_Trace::DefaultSweptTraceBoxHalfExtentX' has a wrong offset!");
static_assert(offsetof(UTargetingSelectionTask_Trace, DefaultSweptTraceBoxHalfExtentY) == 0x0000B0, "Member 'UTargetingSelectionTask_Trace::DefaultSweptTraceBoxHalfExtentY' has a wrong offset!");
static_assert(offsetof(UTargetingSelectionTask_Trace, DefaultSweptTraceBoxHalfExtentZ) == 0x0000D8, "Member 'UTargetingSelectionTask_Trace::DefaultSweptTraceBoxHalfExtentZ' has a wrong offset!");
static_assert(offsetof(UTargetingSelectionTask_Trace, DefaultSweptTraceRotation) == 0x000100, "Member 'UTargetingSelectionTask_Trace::DefaultSweptTraceRotation' has a wrong offset!");
static_assert(offsetof(UTargetingSelectionTask_Trace, DefaultTraceLength) == 0x000118, "Member 'UTargetingSelectionTask_Trace::DefaultTraceLength' has a wrong offset!");
static_assert(offsetof(UTargetingSelectionTask_Trace, DefaultSourceOffset) == 0x000140, "Member 'UTargetingSelectionTask_Trace::DefaultSourceOffset' has a wrong offset!");
static_assert(offsetof(UTargetingSelectionTask_Trace, ExplicitTraceDirection) == 0x000158, "Member 'UTargetingSelectionTask_Trace::ExplicitTraceDirection' has a wrong offset!");

// Class TargetingSystem.TargetingSubsystem
// 0x0048 (0x0078 - 0x0030)
class UTargetingSubsystem final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTargetingRequestHandle>        AsyncTargetingRequests;                            // 0x0040(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_50[0x28];                                      // 0x0050(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void OverrideCollisionQueryTaskData(const struct FTargetingRequestHandle& TargetingHandle, const struct FCollisionQueryTaskData& CollisionQueryDataOverride);

	void ExecuteTargetingRequest(const class UTargetingPreset* TargetingPreset, const struct FTargetingSourceContext& InSourceContext, TDelegate<void(const struct FTargetingRequestHandle& TargetingRequestHandle)> CompletionDynamicDelegate);
	void RemoveAsyncTargetingRequestWithHandle(struct FTargetingRequestHandle& TargetingHandle);
	struct FTargetingRequestHandle StartAsyncTargetingRequest(const class UTargetingPreset* TargetingPreset, const struct FTargetingSourceContext& InSourceContext, TDelegate<void(const struct FTargetingRequestHandle& TargetingRequestHandle)> CompletionDynamicDelegate);

	void GetTargetingResults(const struct FTargetingRequestHandle& TargetingHandle, TArray<struct FHitResult>* OutTargets) const;
	void GetTargetingResultsActors(const struct FTargetingRequestHandle& TargetingHandle, TArray<class AActor*>* Targets) const;
	struct FTargetingSourceContext GetTargetingSourceContext(const struct FTargetingRequestHandle& TargetingHandle) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingSubsystem">();
	}
	static class UTargetingSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingSubsystem>();
	}
};
static_assert(alignof(UTargetingSubsystem) == 0x000008, "Wrong alignment on UTargetingSubsystem");
static_assert(sizeof(UTargetingSubsystem) == 0x000078, "Wrong size on UTargetingSubsystem");
static_assert(offsetof(UTargetingSubsystem, AsyncTargetingRequests) == 0x000040, "Member 'UTargetingSubsystem::AsyncTargetingRequests' has a wrong offset!");

// Class TargetingSystem.TargetingFilterTask_SortByDistance
// 0x0008 (0x0038 - 0x0030)
class UTargetingFilterTask_SortByDistance final : public UTargetingSortTask_Base
{
public:
	bool                                          bUseDistanceToNearestBlockingCollider;             // 0x0030(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECollisionChannel                             DistanceToCollisionChannel;                        // 0x0031(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TargetingFilterTask_SortByDistance">();
	}
	static class UTargetingFilterTask_SortByDistance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTargetingFilterTask_SortByDistance>();
	}
};
static_assert(alignof(UTargetingFilterTask_SortByDistance) == 0x000008, "Wrong alignment on UTargetingFilterTask_SortByDistance");
static_assert(sizeof(UTargetingFilterTask_SortByDistance) == 0x000038, "Wrong size on UTargetingFilterTask_SortByDistance");
static_assert(offsetof(UTargetingFilterTask_SortByDistance, bUseDistanceToNearestBlockingCollider) == 0x000030, "Member 'UTargetingFilterTask_SortByDistance::bUseDistanceToNearestBlockingCollider' has a wrong offset!");
