#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TitleMap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TitleMap.TitleMap_C
// 0x0058 (0x02F0 - 0x0298)
class ATitleMap_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class FString>                         Evrima;                                            // 0x02A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         BlackListedIps;                                    // 0x02B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         BlackListedNames;                                  // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 ServerIP;                                          // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 MapName;                                           // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void CheckAgainstBlacklist(const class FString& ServerName, const class FString& ServerIP_0);
	void ExecuteUbergraph_TitleMap(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TitleMap_C">();
	}
	static class ATitleMap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATitleMap_C>();
	}
};
static_assert(alignof(ATitleMap_C) == 0x000008, "Wrong alignment on ATitleMap_C");
static_assert(sizeof(ATitleMap_C) == 0x0002F0, "Wrong size on ATitleMap_C");
static_assert(offsetof(ATitleMap_C, UberGraphFrame) == 0x000298, "Member 'ATitleMap_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATitleMap_C, Evrima) == 0x0002A0, "Member 'ATitleMap_C::Evrima' has a wrong offset!");
static_assert(offsetof(ATitleMap_C, BlackListedIps) == 0x0002B0, "Member 'ATitleMap_C::BlackListedIps' has a wrong offset!");
static_assert(offsetof(ATitleMap_C, BlackListedNames) == 0x0002C0, "Member 'ATitleMap_C::BlackListedNames' has a wrong offset!");
static_assert(offsetof(ATitleMap_C, ServerIP) == 0x0002D0, "Member 'ATitleMap_C::ServerIP' has a wrong offset!");
static_assert(offsetof(ATitleMap_C, MapName) == 0x0002E0, "Member 'ATitleMap_C::MapName' has a wrong offset!");

}

