#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDS_Climate_Preset

#include "Basic.hpp"

#include "UDS_TemperatureType_structs.hpp"


namespace SDK::Params
{

// Function UDS_Climate_Preset.UDS_Climate_Preset_C.Return Temperature Range in Scale
// 0x0080 (0x0080 - 0x0000)
struct UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale final
{
public:
	EUDS_TemperatureType                          Scale;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Season;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Low;                                               // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        High;                                              // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUDS_TemperatureType                          Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUDS_TemperatureType                          Temp_byte_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
	double                                        CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<double>                                K2Node_MakeArray_Array_1;                          // 0x0050(0x0010)(ReferenceParm)
	double                                        CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_1;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale) == 0x000008, "Wrong alignment on UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale");
static_assert(sizeof(UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale) == 0x000080, "Wrong size on UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale");
static_assert(offsetof(UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale, Scale) == 0x000000, "Member 'UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale::Scale' has a wrong offset!");
static_assert(offsetof(UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale, Season) == 0x000004, "Member 'UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale::Season' has a wrong offset!");
static_assert(offsetof(UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale, Low) == 0x000008, "Member 'UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale::Low' has a wrong offset!");
static_assert(offsetof(UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale, High) == 0x000010, "Member 'UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale::High' has a wrong offset!");
static_assert(offsetof(UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale, Temp_byte_Variable) == 0x000018, "Member 'UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale, Temp_byte_Variable_1) == 0x000019, "Member 'UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale, K2Node_MakeArray_Array) == 0x000020, "Member 'UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale, CallFunc_Array_Get_Item) == 0x000030, "Member 'UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000038, "Member 'UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000040, "Member 'UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale, K2Node_Select_Default) == 0x000048, "Member 'UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale, K2Node_MakeArray_Array_1) == 0x000050, "Member 'UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000070, "Member 'UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale, K2Node_Select_Default_1) == 0x000078, "Member 'UDS_Climate_Preset_C_Return_Temperature_Range_in_Scale::K2Node_Select_Default_1' has a wrong offset!");

}

