#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDS_PlayerOcclusion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass UDS_PlayerOcclusion.UDS_PlayerOcclusion_C
// 0x0080 (0x02B0 - 0x0230)
class UUDS_PlayerOcclusion_C final : public USceneComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUDS_OcclusionSettings_C*               Occlusion_Settings;                                // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Force_Full_Occlusion;                              // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Calculate_Directional_Occlusion;                   // 0x0241(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Ignored_Actors;                                    // 0x0248(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          Hard_Update;                                       // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Tick_Period;                                       // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Sample_Location;                                   // 0x0268(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Hard_Occlusion_Change;                             // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UUDS_OcclusionState_C*                  State;                                             // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UUDS_Occlusion_Portal_C*>        Portal_Components;                                 // 0x0298(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Check_For_Portal_Components();
	void Delayed_Startup();
	void Editor_Tick(const struct FVector& Occlusion_Location);
	void ExecuteUbergraph_UDS_PlayerOcclusion(int32 EntryPoint);
	void Get_Sample_Location();
	void Incremental_Occlusion_Traces();
	void Initialize();
	void Periodic_Context_Checks();
	void Portal_Direction_Mask(const struct FVector& Direction, struct FLinearColor* Mask);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void Runtime_Tick();
	EDrawDebugTrace Trace_Debugs();
	void Update_Current_Occlusion();
	void Update_Ignored_Actors();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UDS_PlayerOcclusion_C">();
	}
	static class UUDS_PlayerOcclusion_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUDS_PlayerOcclusion_C>();
	}
};
static_assert(alignof(UUDS_PlayerOcclusion_C) == 0x000010, "Wrong alignment on UUDS_PlayerOcclusion_C");
static_assert(sizeof(UUDS_PlayerOcclusion_C) == 0x0002B0, "Wrong size on UUDS_PlayerOcclusion_C");
static_assert(offsetof(UUDS_PlayerOcclusion_C, UberGraphFrame) == 0x000230, "Member 'UUDS_PlayerOcclusion_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUDS_PlayerOcclusion_C, Occlusion_Settings) == 0x000238, "Member 'UUDS_PlayerOcclusion_C::Occlusion_Settings' has a wrong offset!");
static_assert(offsetof(UUDS_PlayerOcclusion_C, Force_Full_Occlusion) == 0x000240, "Member 'UUDS_PlayerOcclusion_C::Force_Full_Occlusion' has a wrong offset!");
static_assert(offsetof(UUDS_PlayerOcclusion_C, Calculate_Directional_Occlusion) == 0x000241, "Member 'UUDS_PlayerOcclusion_C::Calculate_Directional_Occlusion' has a wrong offset!");
static_assert(offsetof(UUDS_PlayerOcclusion_C, Ignored_Actors) == 0x000248, "Member 'UUDS_PlayerOcclusion_C::Ignored_Actors' has a wrong offset!");
static_assert(offsetof(UUDS_PlayerOcclusion_C, Hard_Update) == 0x000258, "Member 'UUDS_PlayerOcclusion_C::Hard_Update' has a wrong offset!");
static_assert(offsetof(UUDS_PlayerOcclusion_C, Tick_Period) == 0x000260, "Member 'UUDS_PlayerOcclusion_C::Tick_Period' has a wrong offset!");
static_assert(offsetof(UUDS_PlayerOcclusion_C, Sample_Location) == 0x000268, "Member 'UUDS_PlayerOcclusion_C::Sample_Location' has a wrong offset!");
static_assert(offsetof(UUDS_PlayerOcclusion_C, Hard_Occlusion_Change) == 0x000280, "Member 'UUDS_PlayerOcclusion_C::Hard_Occlusion_Change' has a wrong offset!");
static_assert(offsetof(UUDS_PlayerOcclusion_C, State) == 0x000290, "Member 'UUDS_PlayerOcclusion_C::State' has a wrong offset!");
static_assert(offsetof(UUDS_PlayerOcclusion_C, Portal_Components) == 0x000298, "Member 'UUDS_PlayerOcclusion_C::Portal_Components' has a wrong offset!");

}

