#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDS_Occlusion_Volume

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UDS_Occlusion_Volume.UDS_Occlusion_Volume_C.Configure Weather Particle Blocking
// 0x0018 (0x0018 - 0x0000)
struct UDS_Occlusion_Volume_C_Configure_Weather_Particle_Blocking final
{
public:
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Round_A_ImplicitCast;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDS_Occlusion_Volume_C_Configure_Weather_Particle_Blocking) == 0x000008, "Wrong alignment on UDS_Occlusion_Volume_C_Configure_Weather_Particle_Blocking");
static_assert(sizeof(UDS_Occlusion_Volume_C_Configure_Weather_Particle_Blocking) == 0x000018, "Wrong size on UDS_Occlusion_Volume_C_Configure_Weather_Particle_Blocking");
static_assert(offsetof(UDS_Occlusion_Volume_C_Configure_Weather_Particle_Blocking, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000000, "Member 'UDS_Occlusion_Volume_C_Configure_Weather_Particle_Blocking::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_Occlusion_Volume_C_Configure_Weather_Particle_Blocking, CallFunc_Round_ReturnValue) == 0x000004, "Member 'UDS_Occlusion_Volume_C_Configure_Weather_Particle_Blocking::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_Occlusion_Volume_C_Configure_Weather_Particle_Blocking, CallFunc_Conv_IntToByte_ReturnValue) == 0x000008, "Member 'UDS_Occlusion_Volume_C_Configure_Weather_Particle_Blocking::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_Occlusion_Volume_C_Configure_Weather_Particle_Blocking, CallFunc_GetValidValue_ReturnValue) == 0x000009, "Member 'UDS_Occlusion_Volume_C_Configure_Weather_Particle_Blocking::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_Occlusion_Volume_C_Configure_Weather_Particle_Blocking, CallFunc_Round_A_ImplicitCast) == 0x000010, "Member 'UDS_Occlusion_Volume_C_Configure_Weather_Particle_Blocking::CallFunc_Round_A_ImplicitCast' has a wrong offset!");

// Function UDS_Occlusion_Volume.UDS_Occlusion_Volume_C.ExecuteUbergraph_UDS_Occlusion_Volume
// 0x0004 (0x0004 - 0x0000)
struct UDS_Occlusion_Volume_C_ExecuteUbergraph_UDS_Occlusion_Volume final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDS_Occlusion_Volume_C_ExecuteUbergraph_UDS_Occlusion_Volume) == 0x000004, "Wrong alignment on UDS_Occlusion_Volume_C_ExecuteUbergraph_UDS_Occlusion_Volume");
static_assert(sizeof(UDS_Occlusion_Volume_C_ExecuteUbergraph_UDS_Occlusion_Volume) == 0x000004, "Wrong size on UDS_Occlusion_Volume_C_ExecuteUbergraph_UDS_Occlusion_Volume");
static_assert(offsetof(UDS_Occlusion_Volume_C_ExecuteUbergraph_UDS_Occlusion_Volume, EntryPoint) == 0x000000, "Member 'UDS_Occlusion_Volume_C_ExecuteUbergraph_UDS_Occlusion_Volume::EntryPoint' has a wrong offset!");

// Function UDS_Occlusion_Volume.UDS_Occlusion_Volume_C.UserConstructionScript
// 0x0150 (0x0150 - 0x0000)
struct UDS_Occlusion_Volume_C_UserConstructionScript final
{
public:
	struct FTransform                             Temp_struct_Variable;                              // 0x0000(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable_1;                            // 0x0060(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          CallFunc_AddComponent_ReturnValue;                 // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CallFunc_AddComponent_ReturnValue_1;               // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable_2;                            // 0x00D0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      CallFunc_AddComponent_ReturnValue_2;               // 0x0130(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetCapsuleRadius_Radius_ImplicitCast;     // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast; // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDS_Occlusion_Volume_C_UserConstructionScript) == 0x000010, "Wrong alignment on UDS_Occlusion_Volume_C_UserConstructionScript");
static_assert(sizeof(UDS_Occlusion_Volume_C_UserConstructionScript) == 0x000150, "Wrong size on UDS_Occlusion_Volume_C_UserConstructionScript");
static_assert(offsetof(UDS_Occlusion_Volume_C_UserConstructionScript, Temp_struct_Variable) == 0x000000, "Member 'UDS_Occlusion_Volume_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UDS_Occlusion_Volume_C_UserConstructionScript, Temp_struct_Variable_1) == 0x000060, "Member 'UDS_Occlusion_Volume_C_UserConstructionScript::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UDS_Occlusion_Volume_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x0000C0, "Member 'UDS_Occlusion_Volume_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_Occlusion_Volume_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue_1) == 0x0000C8, "Member 'UDS_Occlusion_Volume_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_Occlusion_Volume_C_UserConstructionScript, Temp_struct_Variable_2) == 0x0000D0, "Member 'UDS_Occlusion_Volume_C_UserConstructionScript::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(UDS_Occlusion_Volume_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue_2) == 0x000130, "Member 'UDS_Occlusion_Volume_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UDS_Occlusion_Volume_C_UserConstructionScript, K2Node_SwitchEnum_CmpSuccess) == 0x000138, "Member 'UDS_Occlusion_Volume_C_UserConstructionScript::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UDS_Occlusion_Volume_C_UserConstructionScript, CallFunc_SetCapsuleRadius_Radius_ImplicitCast) == 0x00013C, "Member 'UDS_Occlusion_Volume_C_UserConstructionScript::CallFunc_SetCapsuleRadius_Radius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UDS_Occlusion_Volume_C_UserConstructionScript, CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast) == 0x000140, "Member 'UDS_Occlusion_Volume_C_UserConstructionScript::CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast' has a wrong offset!");

}

