#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDS_Weather_Settings

#include "Basic.hpp"


namespace SDK::Params
{

// Function UDS_Weather_Settings.UDS_Weather_Settings_C.Get State Sources
// 0x00A8 (0x00A8 - 0x0000)
struct UDS_Weather_Settings_C_Get_State_Sources final
{
public:
	TMap<class UUDS_Weather_Settings_C*, double>  Sources;                                           // 0x0000(0x0050)(Parm, OutParm)
	bool                                          CallFunc_Map_IsEmpty_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UUDS_Weather_Settings_C*, double>  K2Node_MakeMap_Map;                                // 0x0058(0x0050)()
};
static_assert(alignof(UDS_Weather_Settings_C_Get_State_Sources) == 0x000008, "Wrong alignment on UDS_Weather_Settings_C_Get_State_Sources");
static_assert(sizeof(UDS_Weather_Settings_C_Get_State_Sources) == 0x0000A8, "Wrong size on UDS_Weather_Settings_C_Get_State_Sources");
static_assert(offsetof(UDS_Weather_Settings_C_Get_State_Sources, Sources) == 0x000000, "Member 'UDS_Weather_Settings_C_Get_State_Sources::Sources' has a wrong offset!");
static_assert(offsetof(UDS_Weather_Settings_C_Get_State_Sources, CallFunc_Map_IsEmpty_ReturnValue) == 0x000050, "Member 'UDS_Weather_Settings_C_Get_State_Sources::CallFunc_Map_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_Weather_Settings_C_Get_State_Sources, K2Node_MakeMap_Map) == 0x000058, "Member 'UDS_Weather_Settings_C_Get_State_Sources::K2Node_MakeMap_Map' has a wrong offset!");

// Function UDS_Weather_Settings.UDS_Weather_Settings_C.Custom Weather Behavior
// 0x0018 (0x0018 - 0x0000)
struct UDS_Weather_Settings_C_Custom_Weather_Behavior final
{
public:
	double                                        Alpha;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AUltra_Dynamic_Sky_C*                   UDS;                                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AUltra_Dynamic_Weather_C*               UDW;                                               // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDS_Weather_Settings_C_Custom_Weather_Behavior) == 0x000008, "Wrong alignment on UDS_Weather_Settings_C_Custom_Weather_Behavior");
static_assert(sizeof(UDS_Weather_Settings_C_Custom_Weather_Behavior) == 0x000018, "Wrong size on UDS_Weather_Settings_C_Custom_Weather_Behavior");
static_assert(offsetof(UDS_Weather_Settings_C_Custom_Weather_Behavior, Alpha) == 0x000000, "Member 'UDS_Weather_Settings_C_Custom_Weather_Behavior::Alpha' has a wrong offset!");
static_assert(offsetof(UDS_Weather_Settings_C_Custom_Weather_Behavior, UDS) == 0x000008, "Member 'UDS_Weather_Settings_C_Custom_Weather_Behavior::UDS' has a wrong offset!");
static_assert(offsetof(UDS_Weather_Settings_C_Custom_Weather_Behavior, UDW) == 0x000010, "Member 'UDS_Weather_Settings_C_Custom_Weather_Behavior::UDW' has a wrong offset!");

}

