#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDS_Cloud_Paint_Container

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass UDS_Cloud_Paint_Container.UDS_Cloud_Paint_Container_C
// 0x00C0 (0x0350 - 0x0290)
class AUDS_Cloud_Paint_Container_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneCaptureComponent2D*               SceneCaptureComponent2D;                           // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<struct FIntPoint, class UUDS_Cloud_Paint_Cell_C*> Cloud_Painting_Cell_Data;                 // 0x02A8(0x0050)(Edit, BlueprintVisible)
	int32                                         Cloud_Painting_Cell_Size;                          // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Cloud_Painting_Cell_Resolution;                    // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FIntPoint, class UTextureRenderTarget2D*> Cell_Render_Targets;                       // 0x0300(0x0050)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_UDS_Cloud_Paint_Container(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UDS_Cloud_Paint_Container_C">();
	}
	static class AUDS_Cloud_Paint_Container_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUDS_Cloud_Paint_Container_C>();
	}
};
static_assert(alignof(AUDS_Cloud_Paint_Container_C) == 0x000008, "Wrong alignment on AUDS_Cloud_Paint_Container_C");
static_assert(sizeof(AUDS_Cloud_Paint_Container_C) == 0x000350, "Wrong size on AUDS_Cloud_Paint_Container_C");
static_assert(offsetof(AUDS_Cloud_Paint_Container_C, UberGraphFrame) == 0x000290, "Member 'AUDS_Cloud_Paint_Container_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AUDS_Cloud_Paint_Container_C, Billboard) == 0x000298, "Member 'AUDS_Cloud_Paint_Container_C::Billboard' has a wrong offset!");
static_assert(offsetof(AUDS_Cloud_Paint_Container_C, SceneCaptureComponent2D) == 0x0002A0, "Member 'AUDS_Cloud_Paint_Container_C::SceneCaptureComponent2D' has a wrong offset!");
static_assert(offsetof(AUDS_Cloud_Paint_Container_C, Cloud_Painting_Cell_Data) == 0x0002A8, "Member 'AUDS_Cloud_Paint_Container_C::Cloud_Painting_Cell_Data' has a wrong offset!");
static_assert(offsetof(AUDS_Cloud_Paint_Container_C, Cloud_Painting_Cell_Size) == 0x0002F8, "Member 'AUDS_Cloud_Paint_Container_C::Cloud_Painting_Cell_Size' has a wrong offset!");
static_assert(offsetof(AUDS_Cloud_Paint_Container_C, Cloud_Painting_Cell_Resolution) == 0x0002FC, "Member 'AUDS_Cloud_Paint_Container_C::Cloud_Painting_Cell_Resolution' has a wrong offset!");
static_assert(offsetof(AUDS_Cloud_Paint_Container_C, Cell_Render_Targets) == 0x000300, "Member 'AUDS_Cloud_Paint_Container_C::Cell_Render_Targets' has a wrong offset!");

}

