#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDS_PlayerOcclusion

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UDS_PlayerOcclusion.UDS_PlayerOcclusion_C.Check For Portal Components
// 0x0240 (0x0240 - 0x0000)
struct UDS_PlayerOcclusion_C_Check_For_Portal_Components final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ConstParm, ReferenceParm)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHitResult>                     CallFunc_LineTraceMultiForObjects_OutHits;         // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceMultiForObjects_ReturnValue;     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0058(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_156[0x2];                                      // 0x0156(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUDS_Occlusion_Portal_C*                K2Node_DynamicCast_AsUDS_Occlusion_Portal;         // 0x0230(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x3];                                      // 0x0239(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDS_PlayerOcclusion_C_Check_For_Portal_Components) == 0x000008, "Wrong alignment on UDS_PlayerOcclusion_C_Check_For_Portal_Components");
static_assert(sizeof(UDS_PlayerOcclusion_C_Check_For_Portal_Components) == 0x000240, "Wrong size on UDS_PlayerOcclusion_C_Check_For_Portal_Components");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, K2Node_MakeArray_Array) == 0x000010, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000020, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000028, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_LineTraceMultiForObjects_OutHits) == 0x000040, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_LineTraceMultiForObjects_OutHits' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_LineTraceMultiForObjects_ReturnValue) == 0x000050, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_LineTraceMultiForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_Array_Get_Item) == 0x000058, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_Array_Length_ReturnValue) == 0x000150, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_BreakHitResult_bBlockingHit) == 0x000154, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_BreakHitResult_bInitialOverlap) == 0x000155, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_BreakHitResult_Time) == 0x000158, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_BreakHitResult_Distance) == 0x00015C, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_BreakHitResult_Location) == 0x000160, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_BreakHitResult_ImpactPoint) == 0x000178, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_BreakHitResult_Normal) == 0x000190, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_BreakHitResult_ImpactNormal) == 0x0001A8, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_BreakHitResult_PhysMat) == 0x0001C0, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_BreakHitResult_HitActor) == 0x0001C8, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_BreakHitResult_HitComponent) == 0x0001D0, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_BreakHitResult_HitBoneName) == 0x0001D8, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_BreakHitResult_BoneName) == 0x0001E0, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_BreakHitResult_HitItem) == 0x0001E8, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_BreakHitResult_ElementIndex) == 0x0001EC, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_BreakHitResult_FaceIndex) == 0x0001F0, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_BreakHitResult_TraceStart) == 0x0001F8, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_BreakHitResult_TraceEnd) == 0x000210, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_Less_IntInt_ReturnValue) == 0x000228, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, K2Node_DynamicCast_AsUDS_Occlusion_Portal) == 0x000230, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::K2Node_DynamicCast_AsUDS_Occlusion_Portal' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, K2Node_DynamicCast_bSuccess) == 0x000238, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Check_For_Portal_Components, CallFunc_Array_Add_ReturnValue) == 0x00023C, "Member 'UDS_PlayerOcclusion_C_Check_For_Portal_Components::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function UDS_PlayerOcclusion.UDS_PlayerOcclusion_C.Delayed Startup
// 0x0030 (0x0030 - 0x0000)
struct UDS_PlayerOcclusion_C_Delayed_Startup final
{
public:
	bool                                          CallFunc_EqualExactly_VectorVector_ReturnValue;    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerForNextTick_ReturnValue;       // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_2;                // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDS_PlayerOcclusion_C_Delayed_Startup) == 0x000008, "Wrong alignment on UDS_PlayerOcclusion_C_Delayed_Startup");
static_assert(sizeof(UDS_PlayerOcclusion_C_Delayed_Startup) == 0x000030, "Wrong size on UDS_PlayerOcclusion_C_Delayed_Startup");
static_assert(offsetof(UDS_PlayerOcclusion_C_Delayed_Startup, CallFunc_EqualExactly_VectorVector_ReturnValue) == 0x000000, "Member 'UDS_PlayerOcclusion_C_Delayed_Startup::CallFunc_EqualExactly_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Delayed_Startup, CallFunc_K2_SetTimerForNextTick_ReturnValue) == 0x000008, "Member 'UDS_PlayerOcclusion_C_Delayed_Startup::CallFunc_K2_SetTimerForNextTick_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Delayed_Startup, CallFunc_K2_SetTimer_ReturnValue) == 0x000010, "Member 'UDS_PlayerOcclusion_C_Delayed_Startup::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Delayed_Startup, CallFunc_K2_SetTimer_ReturnValue_1) == 0x000018, "Member 'UDS_PlayerOcclusion_C_Delayed_Startup::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Delayed_Startup, CallFunc_K2_SetTimer_ReturnValue_2) == 0x000020, "Member 'UDS_PlayerOcclusion_C_Delayed_Startup::CallFunc_K2_SetTimer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Delayed_Startup, CallFunc_K2_SetTimer_Time_ImplicitCast) == 0x000028, "Member 'UDS_PlayerOcclusion_C_Delayed_Startup::CallFunc_K2_SetTimer_Time_ImplicitCast' has a wrong offset!");

// Function UDS_PlayerOcclusion.UDS_PlayerOcclusion_C.Editor Tick
// 0x0068 (0x0068 - 0x0000)
struct UDS_PlayerOcclusion_C_Editor_Tick final
{
public:
	struct FVector                                Occlusion_Location;                                // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue_2;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue_3;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_2;       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDS_PlayerOcclusion_C_Editor_Tick) == 0x000008, "Wrong alignment on UDS_PlayerOcclusion_C_Editor_Tick");
static_assert(sizeof(UDS_PlayerOcclusion_C_Editor_Tick) == 0x000068, "Wrong size on UDS_PlayerOcclusion_C_Editor_Tick");
static_assert(offsetof(UDS_PlayerOcclusion_C_Editor_Tick, Occlusion_Location) == 0x000000, "Member 'UDS_PlayerOcclusion_C_Editor_Tick::Occlusion_Location' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Editor_Tick, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000018, "Member 'UDS_PlayerOcclusion_C_Editor_Tick::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Editor_Tick, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x000020, "Member 'UDS_PlayerOcclusion_C_Editor_Tick::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Editor_Tick, CallFunc_GetGameTimeInSeconds_ReturnValue_2) == 0x000028, "Member 'UDS_PlayerOcclusion_C_Editor_Tick::CallFunc_GetGameTimeInSeconds_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Editor_Tick, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000030, "Member 'UDS_PlayerOcclusion_C_Editor_Tick::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Editor_Tick, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000038, "Member 'UDS_PlayerOcclusion_C_Editor_Tick::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Editor_Tick, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'UDS_PlayerOcclusion_C_Editor_Tick::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Editor_Tick, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000048, "Member 'UDS_PlayerOcclusion_C_Editor_Tick::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Editor_Tick, CallFunc_GetGameTimeInSeconds_ReturnValue_3) == 0x000050, "Member 'UDS_PlayerOcclusion_C_Editor_Tick::CallFunc_GetGameTimeInSeconds_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Editor_Tick, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000058, "Member 'UDS_PlayerOcclusion_C_Editor_Tick::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Editor_Tick, CallFunc_Greater_DoubleDouble_ReturnValue_2) == 0x000060, "Member 'UDS_PlayerOcclusion_C_Editor_Tick::CallFunc_Greater_DoubleDouble_ReturnValue_2' has a wrong offset!");

// Function UDS_PlayerOcclusion.UDS_PlayerOcclusion_C.ExecuteUbergraph_UDS_PlayerOcclusion
// 0x0008 (0x0008 - 0x0000)
struct UDS_PlayerOcclusion_C_ExecuteUbergraph_UDS_PlayerOcclusion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDS_PlayerOcclusion_C_ExecuteUbergraph_UDS_PlayerOcclusion) == 0x000004, "Wrong alignment on UDS_PlayerOcclusion_C_ExecuteUbergraph_UDS_PlayerOcclusion");
static_assert(sizeof(UDS_PlayerOcclusion_C_ExecuteUbergraph_UDS_PlayerOcclusion) == 0x000008, "Wrong size on UDS_PlayerOcclusion_C_ExecuteUbergraph_UDS_PlayerOcclusion");
static_assert(offsetof(UDS_PlayerOcclusion_C_ExecuteUbergraph_UDS_PlayerOcclusion, EntryPoint) == 0x000000, "Member 'UDS_PlayerOcclusion_C_ExecuteUbergraph_UDS_PlayerOcclusion::EntryPoint' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_ExecuteUbergraph_UDS_PlayerOcclusion, K2Node_Event_EndPlayReason) == 0x000004, "Member 'UDS_PlayerOcclusion_C_ExecuteUbergraph_UDS_PlayerOcclusion::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function UDS_PlayerOcclusion.UDS_PlayerOcclusion_C.Get Sample Location
// 0x0068 (0x0068 - 0x0000)
struct UDS_PlayerOcclusion_C_Get_Sample_Location final
{
public:
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDS_PlayerOcclusion_C_Get_Sample_Location) == 0x000008, "Wrong alignment on UDS_PlayerOcclusion_C_Get_Sample_Location");
static_assert(sizeof(UDS_PlayerOcclusion_C_Get_Sample_Location) == 0x000068, "Wrong size on UDS_PlayerOcclusion_C_Get_Sample_Location");
static_assert(offsetof(UDS_PlayerOcclusion_C_Get_Sample_Location, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000000, "Member 'UDS_PlayerOcclusion_C_Get_Sample_Location::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Get_Sample_Location, CallFunc_GetPlayerPawn_ReturnValue) == 0x000018, "Member 'UDS_PlayerOcclusion_C_Get_Sample_Location::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Get_Sample_Location, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'UDS_PlayerOcclusion_C_Get_Sample_Location::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Get_Sample_Location, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'UDS_PlayerOcclusion_C_Get_Sample_Location::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Get_Sample_Location, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000040, "Member 'UDS_PlayerOcclusion_C_Get_Sample_Location::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Get_Sample_Location, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'UDS_PlayerOcclusion_C_Get_Sample_Location::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Get_Sample_Location, K2Node_SwitchEnum_CmpSuccess) == 0x000049, "Member 'UDS_PlayerOcclusion_C_Get_Sample_Location::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Get_Sample_Location, CallFunc_GetCameraLocation_ReturnValue) == 0x000050, "Member 'UDS_PlayerOcclusion_C_Get_Sample_Location::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");

// Function UDS_PlayerOcclusion.UDS_PlayerOcclusion_C.Incremental Occlusion Traces
// 0x0280 (0x0280 - 0x0000)
struct UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces final
{
public:
	double                                        Upward_Total_Contribution;                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Traces_This_Frame;                                 // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Directional_Total_Contribution;                    // 0x000C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Current_Trace_Occlusion;                           // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Array_Get_Item_1;                         // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item_2;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Array_Get_Item_3;                         // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item_4;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Array_Get_Item_5;                         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDrawDebugTrace                               CallFunc_Trace_Debugs_ReturnValue;                 // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Vector_Distance_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0120(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Add_LinearColorLinearColor_ReturnValue;   // 0x022C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Subtract_LinearColorLinearColor_ReturnValue; // 0x023C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x024C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorLinearColor_ReturnValue; // 0x025C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LineTraceSingle_DrawTime_ImplicitCast;    // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_R_ImplicitCast;                  // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_G_ImplicitCast;                  // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_B_ImplicitCast;                  // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_A_ImplicitCast;                  // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces) == 0x000008, "Wrong alignment on UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces");
static_assert(sizeof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces) == 0x000280, "Wrong size on UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, Upward_Total_Contribution) == 0x000000, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::Upward_Total_Contribution' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, Traces_This_Frame) == 0x000008, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::Traces_This_Frame' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, Directional_Total_Contribution) == 0x00000C, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::Directional_Total_Contribution' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, Current_Trace_Occlusion) == 0x000020, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::Current_Trace_Occlusion' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Array_Get_Item) == 0x000030, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Array_Get_Item_2) == 0x000058, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Array_Get_Item_3) == 0x000060, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Array_Get_Item_4) == 0x000070, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Array_Get_Item_5) == 0x000078, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Percent_IntInt_ReturnValue) == 0x000080, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Trace_Debugs_ReturnValue) == 0x000084, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Trace_Debugs_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000088, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Add_VectorVector_ReturnValue) == 0x000090, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Vector_Distance_ReturnValue) == 0x0000A8, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x0000B8, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_GetGameTimeInSeconds_ReturnValue_1) == 0x0000C0, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_GetGameTimeInSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000D0, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Round_ReturnValue) == 0x0000D8, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Max_ReturnValue) == 0x0000DC, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Min_ReturnValue) == 0x0000E0, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_SelectInt_ReturnValue) == 0x0000E4, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, Temp_int_Variable) == 0x0000E8, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000EC, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000F0, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000F8, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000100, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000108, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000110, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000118, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_LineTraceSingle_OutHit) == 0x000120, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_LineTraceSingle_ReturnValue) == 0x000218, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_SelectFloat_ReturnValue) == 0x000220, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Greater_IntInt_ReturnValue) == 0x000228, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Add_LinearColorLinearColor_ReturnValue) == 0x00022C, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Add_LinearColorLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Subtract_LinearColorLinearColor_ReturnValue) == 0x00023C, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Subtract_LinearColorLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, K2Node_MakeStruct_LinearColor) == 0x00024C, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_Multiply_LinearColorLinearColor_ReturnValue) == 0x00025C, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_Multiply_LinearColorLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, CallFunc_LineTraceSingle_DrawTime_ImplicitCast) == 0x00026C, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::CallFunc_LineTraceSingle_DrawTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, K2Node_MakeStruct_R_ImplicitCast) == 0x000270, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::K2Node_MakeStruct_R_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, K2Node_MakeStruct_G_ImplicitCast) == 0x000274, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::K2Node_MakeStruct_G_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, K2Node_MakeStruct_B_ImplicitCast) == 0x000278, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::K2Node_MakeStruct_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces, K2Node_MakeStruct_A_ImplicitCast) == 0x00027C, "Member 'UDS_PlayerOcclusion_C_Incremental_Occlusion_Traces::K2Node_MakeStruct_A_ImplicitCast' has a wrong offset!");

// Function UDS_PlayerOcclusion.UDS_PlayerOcclusion_C.Initialize
// 0x0001 (0x0001 - 0x0000)
struct UDS_PlayerOcclusion_C_Initialize final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDS_PlayerOcclusion_C_Initialize) == 0x000001, "Wrong alignment on UDS_PlayerOcclusion_C_Initialize");
static_assert(sizeof(UDS_PlayerOcclusion_C_Initialize) == 0x000001, "Wrong size on UDS_PlayerOcclusion_C_Initialize");
static_assert(offsetof(UDS_PlayerOcclusion_C_Initialize, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'UDS_PlayerOcclusion_C_Initialize::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UDS_PlayerOcclusion.UDS_PlayerOcclusion_C.Periodic Context Checks
// 0x05E0 (0x05E0 - 0x0000)
struct UDS_PlayerOcclusion_C_Periodic_Context_Checks final
{
public:
	double                                        Portal_Distance_Mask;                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Portal_Direction;                                  // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUDS_Occlusion_Portal_C*                Current_Portal;                                    // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUDS_Occlusion_Portal_C*                CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ConstParm, ReferenceParm)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHitResult>                     CallFunc_LineTraceMultiForObjects_OutHits;         // 0x0098(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceMultiForObjects_ReturnValue;     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item_1;                         // 0x00B0(0x00F8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AE[0x2];                                      // 0x01AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0228(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0268(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AUDS_Occlusion_Volume_C*                K2Node_DynamicCast_AsUDS_Occlusion_Volume;         // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
