#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDS_and_UDW_State

#include "Basic.hpp"

#include "UDW_WeatherState_Structure_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "RandomWeatherVariation_State_structs.hpp"
#include "UDW_WOV_State_structs.hpp"


namespace SDK
{

// UserDefinedStruct UDS_and_UDW_State.UDS_and_UDW_State
// 0x0200 (0x0200 - 0x0000)
struct FUDS_and_UDW_State final
{
public:
	struct FDateTime                              CurrentTime_142_A8A3081E448DDADDE3E0AE9D48603236;  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              StartingDate_195_8B4AC69C4C757F9C8F3B599C85B79B12; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CloudPosition_207_9D83C0B849A3B5BFB9C3DD9DA20CE0F7; // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SimulationLocation_179_82C5772A4C1B679691D865B904365DF3; // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IncludesWeatherState_151_B8E4960C4B89E69E587CAD9E453AF85E; // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUDW_WeatherState_Structure            ManualWeatherState_154_43B336E740485E3BE53E9FA913B750CE; // 0x0048(0x0050)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUDW_WeatherState_Structure            GlobalWeatherState_156_ABD7EF5F45579C1C5FEF3B8751C4EB86; // 0x0098(0x0050)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Weather_159_65D3DE2946AD276E7F18E484BA19512B;      // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FUDW_WeatherState_Structure            OldWeatherState_162_4D413F1E4B69542295AF849DC9D77387; // 0x00F0(0x0050)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TransitionActive_165_BB1BA4AE49DC610D61D5938033CE5706; // 0x0140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TransitionDuration_168_0ADED53C458AAF00B34A5E84027E329B; // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TransitionTimer_170_D52B116947119ECE68EDEFAF45877D80; // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WindDirection_176_C27727CA49EA2613308F638F36486960; // 0x0158(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUDS_Modifier_C*>                Modifiers_183_9106119B46CD83CAFE40DAA85329A736;    // 0x0160(0x0010)(Edit, BlueprintVisible)
	TArray<double>                                ModifierAlphas_186_3F8ABF2F420E35E9BBCCC5963AED568F; // 0x0170(0x0010)(Edit, BlueprintVisible)
	TArray<double>                                ModifierTargets_188_7340DCC245CD95D843EAC2B94658F829; // 0x0180(0x0010)(Edit, BlueprintVisible)
	TArray<double>                                ModifierSpeeds_190_D00457614E1365607A7DA68178982B63; // 0x0190(0x0010)(Edit, BlueprintVisible)
	struct FRandomWeatherVariation_State          UDWRandomWeatherState_199_AE829CEC4D89D738E7D506805258238F; // 0x01A0(0x0040)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class AActor*>                         WOVActors_211_617D1B134B0D80E5D1D5ADBE6FC8A601;    // 0x01E0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<struct FUDW_WOV_State>                 WOVStates_203_7C8393034CE7618138CCB198E6DD1E76;    // 0x01F0(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FUDS_and_UDW_State) == 0x000008, "Wrong alignment on FUDS_and_UDW_State");
static_assert(sizeof(FUDS_and_UDW_State) == 0x000200, "Wrong size on FUDS_and_UDW_State");
static_assert(offsetof(FUDS_and_UDW_State, CurrentTime_142_A8A3081E448DDADDE3E0AE9D48603236) == 0x000000, "Member 'FUDS_and_UDW_State::CurrentTime_142_A8A3081E448DDADDE3E0AE9D48603236' has a wrong offset!");
static_assert(offsetof(FUDS_and_UDW_State, StartingDate_195_8B4AC69C4C757F9C8F3B599C85B79B12) == 0x000008, "Member 'FUDS_and_UDW_State::StartingDate_195_8B4AC69C4C757F9C8F3B599C85B79B12' has a wrong offset!");
static_assert(offsetof(FUDS_and_UDW_State, CloudPosition_207_9D83C0B849A3B5BFB9C3DD9DA20CE0F7) == 0x000010, "Member 'FUDS_and_UDW_State::CloudPosition_207_9D83C0B849A3B5BFB9C3DD9DA20CE0F7' has a wrong offset!");
static_assert(offsetof(FUDS_and_UDW_State, SimulationLocation_179_82C5772A4C1B679691D865B904365DF3) == 0x000028, "Member 'FUDS_and_UDW_State::SimulationLocation_179_82C5772A4C1B679691D865B904365DF3' has a wrong offset!");
static_assert(offsetof(FUDS_and_UDW_State, IncludesWeatherState_151_B8E4960C4B89E69E587CAD9E453AF85E) == 0x000040, "Member 'FUDS_and_UDW_State::IncludesWeatherState_151_B8E4960C4B89E69E587CAD9E453AF85E' has a wrong offset!");
static_assert(offsetof(FUDS_and_UDW_State, ManualWeatherState_154_43B336E740485E3BE53E9FA913B750CE) == 0x000048, "Member 'FUDS_and_UDW_State::ManualWeatherState_154_43B336E740485E3BE53E9FA913B750CE' has a wrong offset!");
static_assert(offsetof(FUDS_and_UDW_State, GlobalWeatherState_156_ABD7EF5F45579C1C5FEF3B8751C4EB86) == 0x000098, "Member 'FUDS_and_UDW_State::GlobalWeatherState_156_ABD7EF5F45579C1C5FEF3B8751C4EB86' has a wrong offset!");
static_assert(offsetof(FUDS_and_UDW_State, Weather_159_65D3DE2946AD276E7F18E484BA19512B) == 0x0000E8, "Member 'FUDS_and_UDW_State::Weather_159_65D3DE2946AD276E7F18E484BA19512B' has a wrong offset!");
static_assert(offsetof(FUDS_and_UDW_State, OldWeatherState_162_4D413F1E4B69542295AF849DC9D77387) == 0x0000F0, "Member 'FUDS_and_UDW_State::OldWeatherState_162_4D413F1E4B69542295AF849DC9D77387' has a wrong offset!");
static_assert(offsetof(FUDS_and_UDW_State, TransitionActive_165_BB1BA4AE49DC610D61D5938033CE5706) == 0x000140, "Member 'FUDS_and_UDW_State::TransitionActive_165_BB1BA4AE49DC610D61D5938033CE5706' has a wrong offset!");
static_assert(offsetof(FUDS_and_UDW_State, TransitionDuration_168_0ADED53C458AAF00B34A5E84027E329B) == 0x000148, "Member 'FUDS_and_UDW_State::TransitionDuration_168_0ADED53C458AAF00B34A5E84027E329B' has a wrong offset!");
static_assert(offsetof(FUDS_and_UDW_State, TransitionTimer_170_D52B116947119ECE68EDEFAF45877D80) == 0x000150, "Member 'FUDS_and_UDW_State::TransitionTimer_170_D52B116947119ECE68EDEFAF45877D80' has a wrong offset!");
static_assert(offsetof(FUDS_and_UDW_State, WindDirection_176_C27727CA49EA2613308F638F36486960) == 0x000158, "Member 'FUDS_and_UDW_State::WindDirection_176_C27727CA49EA2613308F638F36486960' has a wrong offset!");
static_assert(offsetof(FUDS_and_UDW_State, Modifiers_183_9106119B46CD83CAFE40DAA85329A736) == 0x000160, "Member 'FUDS_and_UDW_State::Modifiers_183_9106119B46CD83CAFE40DAA85329A736' has a wrong offset!");
static_assert(offsetof(FUDS_and_UDW_State, ModifierAlphas_186_3F8ABF2F420E35E9BBCCC5963AED568F) == 0x000170, "Member 'FUDS_and_UDW_State::ModifierAlphas_186_3F8ABF2F420E35E9BBCCC5963AED568F' has a wrong offset!");
static_assert(offsetof(FUDS_and_UDW_State, ModifierTargets_188_7340DCC245CD95D843EAC2B94658F829) == 0x000180, "Member 'FUDS_and_UDW_State::ModifierTargets_188_7340DCC245CD95D843EAC2B94658F829' has a wrong offset!");
static_assert(offsetof(FUDS_and_UDW_State, ModifierSpeeds_190_D00457614E1365607A7DA68178982B63) == 0x000190, "Member 'FUDS_and_UDW_State::ModifierSpeeds_190_D00457614E1365607A7DA68178982B63' has a wrong offset!");
static_assert(offsetof(FUDS_and_UDW_State, UDWRandomWeatherState_199_AE829CEC4D89D738E7D506805258238F) == 0x0001A0, "Member 'FUDS_and_UDW_State::UDWRandomWeatherState_199_AE829CEC4D89D738E7D506805258238F' has a wrong offset!");
static_assert(offsetof(FUDS_and_UDW_State, WOVActors_211_617D1B134B0D80E5D1D5ADBE6FC8A601) == 0x0001E0, "Member 'FUDS_and_UDW_State::WOVActors_211_617D1B134B0D80E5D1D5ADBE6FC8A601' has a wrong offset!");
static_assert(offsetof(FUDS_and_UDW_State, WOVStates_203_7C8393034CE7618138CCB198E6DD1E76) == 0x0001F0, "Member 'FUDS_and_UDW_State::WOVStates_203_7C8393034CE7618138CCB198E6DD1E76' has a wrong offset!");

}

