#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDS_Occlusion_Portal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass UDS_Occlusion_Portal.UDS_Occlusion_Portal_C
// 0x0030 (0x0610 - 0x05E0)
class UUDS_Occlusion_Portal_C final : public UStaticMeshComponent
{
public:
	uint8                                         Pad_5D8[0x8];                                      // 0x05D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        Sample_Range;                                      // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Distance_Falloff_Exponent;                         // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Directional_Occlusion;                             // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Global_Occlusion;                                  // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UDS_Occlusion_Portal(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UDS_Occlusion_Portal_C">();
	}
	static class UUDS_Occlusion_Portal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUDS_Occlusion_Portal_C>();
	}
};
static_assert(alignof(UUDS_Occlusion_Portal_C) == 0x000010, "Wrong alignment on UUDS_Occlusion_Portal_C");
static_assert(sizeof(UUDS_Occlusion_Portal_C) == 0x000610, "Wrong size on UUDS_Occlusion_Portal_C");
static_assert(offsetof(UUDS_Occlusion_Portal_C, UberGraphFrame) == 0x0005E0, "Member 'UUDS_Occlusion_Portal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUDS_Occlusion_Portal_C, Sample_Range) == 0x0005E8, "Member 'UUDS_Occlusion_Portal_C::Sample_Range' has a wrong offset!");
static_assert(offsetof(UUDS_Occlusion_Portal_C, Distance_Falloff_Exponent) == 0x0005F0, "Member 'UUDS_Occlusion_Portal_C::Distance_Falloff_Exponent' has a wrong offset!");
static_assert(offsetof(UUDS_Occlusion_Portal_C, Directional_Occlusion) == 0x0005F8, "Member 'UUDS_Occlusion_Portal_C::Directional_Occlusion' has a wrong offset!");
static_assert(offsetof(UUDS_Occlusion_Portal_C, Global_Occlusion) == 0x000600, "Member 'UUDS_Occlusion_Portal_C::Global_Occlusion' has a wrong offset!");

}

