#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDS_Utility_Opener_Interface

#include "Basic.hpp"


namespace SDK::Params
{

// Function UDS_Utility_Opener_Interface.UDS_Utility_Opener_Interface_C.Open UDS Readme
// 0x0018 (0x0018 - 0x0000)
struct UDS_Utility_Opener_Interface_C_Open_UDS_Readme final
{
public:
	class FString                                 Entry_Row;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Category_Index;                                    // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDS_Utility_Opener_Interface_C_Open_UDS_Readme) == 0x000008, "Wrong alignment on UDS_Utility_Opener_Interface_C_Open_UDS_Readme");
static_assert(sizeof(UDS_Utility_Opener_Interface_C_Open_UDS_Readme) == 0x000018, "Wrong size on UDS_Utility_Opener_Interface_C_Open_UDS_Readme");
static_assert(offsetof(UDS_Utility_Opener_Interface_C_Open_UDS_Readme, Entry_Row) == 0x000000, "Member 'UDS_Utility_Opener_Interface_C_Open_UDS_Readme::Entry_Row' has a wrong offset!");
static_assert(offsetof(UDS_Utility_Opener_Interface_C_Open_UDS_Readme, Category_Index) == 0x000010, "Member 'UDS_Utility_Opener_Interface_C_Open_UDS_Readme::Category_Index' has a wrong offset!");

// Function UDS_Utility_Opener_Interface.UDS_Utility_Opener_Interface_C.Open UDS Readme Entry Set
// 0x0010 (0x0010 - 0x0000)
struct UDS_Utility_Opener_Interface_C_Open_UDS_Readme_Entry_Set final
{
public:
	TArray<class FName>                           Entries;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UDS_Utility_Opener_Interface_C_Open_UDS_Readme_Entry_Set) == 0x000008, "Wrong alignment on UDS_Utility_Opener_Interface_C_Open_UDS_Readme_Entry_Set");
static_assert(sizeof(UDS_Utility_Opener_Interface_C_Open_UDS_Readme_Entry_Set) == 0x000010, "Wrong size on UDS_Utility_Opener_Interface_C_Open_UDS_Readme_Entry_Set");
static_assert(offsetof(UDS_Utility_Opener_Interface_C_Open_UDS_Readme_Entry_Set, Entries) == 0x000000, "Member 'UDS_Utility_Opener_Interface_C_Open_UDS_Readme_Entry_Set::Entries' has a wrong offset!");

// Function UDS_Utility_Opener_Interface.UDS_Utility_Opener_Interface_C.Show Editor Warning Window
// 0x0020 (0x0020 - 0x0000)
struct UDS_Utility_Opener_Interface_C_Show_Editor_Warning_Window final
{
public:
	class FString                                 Title;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Message;                                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UDS_Utility_Opener_Interface_C_Show_Editor_Warning_Window) == 0x000008, "Wrong alignment on UDS_Utility_Opener_Interface_C_Show_Editor_Warning_Window");
static_assert(sizeof(UDS_Utility_Opener_Interface_C_Show_Editor_Warning_Window) == 0x000020, "Wrong size on UDS_Utility_Opener_Interface_C_Show_Editor_Warning_Window");
static_assert(offsetof(UDS_Utility_Opener_Interface_C_Show_Editor_Warning_Window, Title) == 0x000000, "Member 'UDS_Utility_Opener_Interface_C_Show_Editor_Warning_Window::Title' has a wrong offset!");
static_assert(offsetof(UDS_Utility_Opener_Interface_C_Show_Editor_Warning_Window, Message) == 0x000010, "Member 'UDS_Utility_Opener_Interface_C_Show_Editor_Warning_Window::Message' has a wrong offset!");

}

