#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDS_Occlusion_Portal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UDS_Occlusion_Portal.UDS_Occlusion_Portal_C.ExecuteUbergraph_UDS_Occlusion_Portal
// 0x0030 (0x0030 - 0x0000)
struct UDS_Occlusion_Portal_C_ExecuteUbergraph_UDS_Occlusion_Portal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UDS_Occlusion_Portal_C_ExecuteUbergraph_UDS_Occlusion_Portal) == 0x000008, "Wrong alignment on UDS_Occlusion_Portal_C_ExecuteUbergraph_UDS_Occlusion_Portal");
static_assert(sizeof(UDS_Occlusion_Portal_C_ExecuteUbergraph_UDS_Occlusion_Portal) == 0x000030, "Wrong size on UDS_Occlusion_Portal_C_ExecuteUbergraph_UDS_Occlusion_Portal");
static_assert(offsetof(UDS_Occlusion_Portal_C_ExecuteUbergraph_UDS_Occlusion_Portal, EntryPoint) == 0x000000, "Member 'UDS_Occlusion_Portal_C_ExecuteUbergraph_UDS_Occlusion_Portal::EntryPoint' has a wrong offset!");
static_assert(offsetof(UDS_Occlusion_Portal_C_ExecuteUbergraph_UDS_Occlusion_Portal, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000008, "Member 'UDS_Occlusion_Portal_C_ExecuteUbergraph_UDS_Occlusion_Portal::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_Occlusion_Portal_C_ExecuteUbergraph_UDS_Occlusion_Portal, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'UDS_Occlusion_Portal_C_ExecuteUbergraph_UDS_Occlusion_Portal::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(UDS_Occlusion_Portal_C_ExecuteUbergraph_UDS_Occlusion_Portal, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000018, "Member 'UDS_Occlusion_Portal_C_ExecuteUbergraph_UDS_Occlusion_Portal::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");

}

