#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDS_Post_Process_Stage

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct UDS_Post_Process_Stage.UDS_Post_Process_Stage
// 0x0720 (0x0720 - 0x0000)
struct FUDS_Post_Process_Stage final
{
public:
	class FString                                 Label_24_760DA3B649F655929138B7846A0B840F;         // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FPostProcessSettings                   PostProcessSettings_25_E746F2674432B2790E7147B9B9D48686; // 0x0010(0x06F0)(Edit, BlueprintVisible)
	double                                        Priority_47_5B0BDA844B69DB2E7768168865CD16E0;      // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableDuringDay_60_6A0C0A844D25727B201270B8E6794534; // 0x0708(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableatDawnDusk_61_D0DA84F840D05C7DA0D7B49A2E6743C4; // 0x0709(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableatNight_62_1D5FD8DD4142C2B92FFCEFBE2A0E581F; // 0x070A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableifOvercast_52_989272994F5025F12C728292C335B969; // 0x070B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableifNotOvercast_53_D95A77BB4DB1672F50FDC6B817C28515; // 0x070C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableifFoggy_54_539D2C7E4D2FD2EB58A526993DBB4A10; // 0x070D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableifNotFoggy_55_34F8C6474E89F3CB3996E78C6CEF2907; // 0x070E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableifDusty_56_0044404B424580AF8096A6B8CD97F80F; // 0x070F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableifNotDusty_57_B002D3174D9C870BA261FCA71ADF2E02; // 0x0710(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableifInsideInterior_58_8D9B008146005C1946D6B4B9F02F9C83; // 0x0711(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableifOutsideInterior_59_BF184CAA469ECC2CC17795A644DA512E; // 0x0712(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableifRaining_66_6BC8BF074301B1FEAD90188DAE684C20; // 0x0713(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableifNotRaining_68_AE74EF0B44F68955FD9AA38EB1A1ECC4; // 0x0714(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableifSnowing_70_63462F7A45D418DF0033E496E5F1C2A3; // 0x0715(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DisableifNotSnowing_72_5FBF6A2940E5085175DF21A4FB1E2444; // 0x0716(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FUDS_Post_Process_Stage) == 0x000010, "Wrong alignment on FUDS_Post_Process_Stage");
static_assert(sizeof(FUDS_Post_Process_Stage) == 0x000720, "Wrong size on FUDS_Post_Process_Stage");
static_assert(offsetof(FUDS_Post_Process_Stage, Label_24_760DA3B649F655929138B7846A0B840F) == 0x000000, "Member 'FUDS_Post_Process_Stage::Label_24_760DA3B649F655929138B7846A0B840F' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, PostProcessSettings_25_E746F2674432B2790E7147B9B9D48686) == 0x000010, "Member 'FUDS_Post_Process_Stage::PostProcessSettings_25_E746F2674432B2790E7147B9B9D48686' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, Priority_47_5B0BDA844B69DB2E7768168865CD16E0) == 0x000700, "Member 'FUDS_Post_Process_Stage::Priority_47_5B0BDA844B69DB2E7768168865CD16E0' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableDuringDay_60_6A0C0A844D25727B201270B8E6794534) == 0x000708, "Member 'FUDS_Post_Process_Stage::DisableDuringDay_60_6A0C0A844D25727B201270B8E6794534' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableatDawnDusk_61_D0DA84F840D05C7DA0D7B49A2E6743C4) == 0x000709, "Member 'FUDS_Post_Process_Stage::DisableatDawnDusk_61_D0DA84F840D05C7DA0D7B49A2E6743C4' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableatNight_62_1D5FD8DD4142C2B92FFCEFBE2A0E581F) == 0x00070A, "Member 'FUDS_Post_Process_Stage::DisableatNight_62_1D5FD8DD4142C2B92FFCEFBE2A0E581F' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableifOvercast_52_989272994F5025F12C728292C335B969) == 0x00070B, "Member 'FUDS_Post_Process_Stage::DisableifOvercast_52_989272994F5025F12C728292C335B969' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableifNotOvercast_53_D95A77BB4DB1672F50FDC6B817C28515) == 0x00070C, "Member 'FUDS_Post_Process_Stage::DisableifNotOvercast_53_D95A77BB4DB1672F50FDC6B817C28515' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableifFoggy_54_539D2C7E4D2FD2EB58A526993DBB4A10) == 0x00070D, "Member 'FUDS_Post_Process_Stage::DisableifFoggy_54_539D2C7E4D2FD2EB58A526993DBB4A10' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableifNotFoggy_55_34F8C6474E89F3CB3996E78C6CEF2907) == 0x00070E, "Member 'FUDS_Post_Process_Stage::DisableifNotFoggy_55_34F8C6474E89F3CB3996E78C6CEF2907' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableifDusty_56_0044404B424580AF8096A6B8CD97F80F) == 0x00070F, "Member 'FUDS_Post_Process_Stage::DisableifDusty_56_0044404B424580AF8096A6B8CD97F80F' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableifNotDusty_57_B002D3174D9C870BA261FCA71ADF2E02) == 0x000710, "Member 'FUDS_Post_Process_Stage::DisableifNotDusty_57_B002D3174D9C870BA261FCA71ADF2E02' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableifInsideInterior_58_8D9B008146005C1946D6B4B9F02F9C83) == 0x000711, "Member 'FUDS_Post_Process_Stage::DisableifInsideInterior_58_8D9B008146005C1946D6B4B9F02F9C83' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableifOutsideInterior_59_BF184CAA469ECC2CC17795A644DA512E) == 0x000712, "Member 'FUDS_Post_Process_Stage::DisableifOutsideInterior_59_BF184CAA469ECC2CC17795A644DA512E' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableifRaining_66_6BC8BF074301B1FEAD90188DAE684C20) == 0x000713, "Member 'FUDS_Post_Process_Stage::DisableifRaining_66_6BC8BF074301B1FEAD90188DAE684C20' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableifNotRaining_68_AE74EF0B44F68955FD9AA38EB1A1ECC4) == 0x000714, "Member 'FUDS_Post_Process_Stage::DisableifNotRaining_68_AE74EF0B44F68955FD9AA38EB1A1ECC4' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableifSnowing_70_63462F7A45D418DF0033E496E5F1C2A3) == 0x000715, "Member 'FUDS_Post_Process_Stage::DisableifSnowing_70_63462F7A45D418DF0033E496E5F1C2A3' has a wrong offset!");
static_assert(offsetof(FUDS_Post_Process_Stage, DisableifNotSnowing_72_5FBF6A2940E5085175DF21A4FB1E2444) == 0x000716, "Member 'FUDS_Post_Process_Stage::DisableifNotSnowing_72_5FBF6A2940E5085175DF21A4FB1E2444' has a wrong offset!");

}

