#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDW_WeatherState_Structure

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct UDW_WeatherState_Structure.UDW_WeatherState_Structure
// 0x0050 (0x0050 - 0x0000)
struct FUDW_WeatherState_Structure final
{
public:
	double                                        CloudCoverage_2_31BA899D45A8A1B84FBCC7AEA870954F;  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Rain_4_4019C4FF4CE970F8CF06F99779966140;           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Snow_6_4DF1B106404D7B2DA02FBBB54BEB004A;           // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ThunderLightning_8_6C3109794B58BE8BE4D0D39E9247D947; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WindIntensity_10_7D0941E340035FB4BC9CD196CE7AA58B; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Fog_22_4B6E454642665C025DADA1BD443B667A;           // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Dust_23_4639102D44077B805735A6BC027AF7ED;          // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaterialWetness_24_2CE413784192D57B1FA486B8BF605372; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaterialSnowCoverage_25_10F93D3F42158AD6D1D5B7A58EB30E28; // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaterialDustCoverage_26_4C9DA3A1430CCB4B92BCAB95AB03CAA9; // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FUDW_WeatherState_Structure) == 0x000008, "Wrong alignment on FUDW_WeatherState_Structure");
static_assert(sizeof(FUDW_WeatherState_Structure) == 0x000050, "Wrong size on FUDW_WeatherState_Structure");
static_assert(offsetof(FUDW_WeatherState_Structure, CloudCoverage_2_31BA899D45A8A1B84FBCC7AEA870954F) == 0x000000, "Member 'FUDW_WeatherState_Structure::CloudCoverage_2_31BA899D45A8A1B84FBCC7AEA870954F' has a wrong offset!");
static_assert(offsetof(FUDW_WeatherState_Structure, Rain_4_4019C4FF4CE970F8CF06F99779966140) == 0x000008, "Member 'FUDW_WeatherState_Structure::Rain_4_4019C4FF4CE970F8CF06F99779966140' has a wrong offset!");
static_assert(offsetof(FUDW_WeatherState_Structure, Snow_6_4DF1B106404D7B2DA02FBBB54BEB004A) == 0x000010, "Member 'FUDW_WeatherState_Structure::Snow_6_4DF1B106404D7B2DA02FBBB54BEB004A' has a wrong offset!");
static_assert(offsetof(FUDW_WeatherState_Structure, ThunderLightning_8_6C3109794B58BE8BE4D0D39E9247D947) == 0x000018, "Member 'FUDW_WeatherState_Structure::ThunderLightning_8_6C3109794B58BE8BE4D0D39E9247D947' has a wrong offset!");
static_assert(offsetof(FUDW_WeatherState_Structure, WindIntensity_10_7D0941E340035FB4BC9CD196CE7AA58B) == 0x000020, "Member 'FUDW_WeatherState_Structure::WindIntensity_10_7D0941E340035FB4BC9CD196CE7AA58B' has a wrong offset!");
static_assert(offsetof(FUDW_WeatherState_Structure, Fog_22_4B6E454642665C025DADA1BD443B667A) == 0x000028, "Member 'FUDW_WeatherState_Structure::Fog_22_4B6E454642665C025DADA1BD443B667A' has a wrong offset!");
static_assert(offsetof(FUDW_WeatherState_Structure, Dust_23_4639102D44077B805735A6BC027AF7ED) == 0x000030, "Member 'FUDW_WeatherState_Structure::Dust_23_4639102D44077B805735A6BC027AF7ED' has a wrong offset!");
static_assert(offsetof(FUDW_WeatherState_Structure, MaterialWetness_24_2CE413784192D57B1FA486B8BF605372) == 0x000038, "Member 'FUDW_WeatherState_Structure::MaterialWetness_24_2CE413784192D57B1FA486B8BF605372' has a wrong offset!");
static_assert(offsetof(FUDW_WeatherState_Structure, MaterialSnowCoverage_25_10F93D3F42158AD6D1D5B7A58EB30E28) == 0x000040, "Member 'FUDW_WeatherState_Structure::MaterialSnowCoverage_25_10F93D3F42158AD6D1D5B7A58EB30E28' has a wrong offset!");
static_assert(offsetof(FUDW_WeatherState_Structure, MaterialDustCoverage_26_4C9DA3A1430CCB4B92BCAB95AB03CAA9) == 0x000048, "Member 'FUDW_WeatherState_Structure::MaterialDustCoverage_26_4C9DA3A1430CCB4B92BCAB95AB03CAA9' has a wrong offset!");

}

