#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ultra_Dynamic_Sky

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UDS_Planet_Lightsource_structs.hpp"
#include "UDS_RenderingFeatureLevel_structs.hpp"
#include "Engine_structs.hpp"
#include "UDS_Modifier_Float_Property_structs.hpp"
#include "UDS_Modifier_Color_Property_structs.hpp"
#include "UDS_CachedProperties_structs.hpp"
#include "UDS_Cache_Group_structs.hpp"
#include "UDS_RunContext_structs.hpp"
#include "RadialStorm_CoverageBrush_structs.hpp"
#include "UDS_Space_Planet_structs.hpp"
#include "UDS_Space_Parent_structs.hpp"
#include "UDS_Post_Process_Stage_structs.hpp"
#include "UDS_SkyMode_structs.hpp"
#include "UDS_CityPresets_structs.hpp"
#include "UDS_LensFlareType_structs.hpp"
#include "UDS_FogColorMode_structs.hpp"
#include "UDS_VolRT_Mode_structs.hpp"
#include "UDS_and_UDW_State_structs.hpp"
#include "UDW_WeatherState_Structure_structs.hpp"


namespace SDK::Params
{

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.2D Clouds Shading Offset Vector
// 0x00B0 (0x00B0 - 0x0000)
struct Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector final
{
public:
	struct FLinearColor                           LinearColor;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_R_ImplicitCast;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_G_ImplicitCast;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_B_ImplicitCast;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_A_ImplicitCast;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector");
static_assert(sizeof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector) == 0x0000B0, "Wrong size on Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, LinearColor) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::LinearColor' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_BreakVector_X) == 0x000010, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_BreakVector_Y) == 0x000018, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_BreakVector_Z) == 0x000020, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000028, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_FClamp_ReturnValue) == 0x000038, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000040, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000048, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_SelectVector_ReturnValue) == 0x000050, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_Abs_ReturnValue) == 0x000068, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_BreakVector_X_1) == 0x000070, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_BreakVector_Y_1) == 0x000078, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_BreakVector_Z_1) == 0x000080, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, CallFunc_MapRangeClamped_ReturnValue) == 0x000088, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, K2Node_MakeStruct_LinearColor) == 0x000090, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, K2Node_MakeStruct_R_ImplicitCast) == 0x0000A0, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::K2Node_MakeStruct_R_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, K2Node_MakeStruct_G_ImplicitCast) == 0x0000A4, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::K2Node_MakeStruct_G_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, K2Node_MakeStruct_B_ImplicitCast) == 0x0000A8, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::K2Node_MakeStruct_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector, K2Node_MakeStruct_A_ImplicitCast) == 0x0000AC, "Member 'Ultra_Dynamic_Sky_C_TwoD_Clouds_Shading_Offset_Vector::K2Node_MakeStruct_A_ImplicitCast' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.3 Color Time Blend
// 0x0080 (0x0080 - 0x0000)
struct Ultra_Dynamic_Sky_C_Three_Color_Time_Blend final
{
public:
	struct FLinearColor                           Day_Color;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Dusk_Color;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Night_Color;                                       // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Out;                                               // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Sun_Height_Z;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Night_Filter_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue_1;            // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LinearColorLerp_Alpha_ImplicitCast;       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LinearColorLerp_Alpha_ImplicitCast_1;     // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_Three_Color_Time_Blend) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_C_Three_Color_Time_Blend");
static_assert(sizeof(Ultra_Dynamic_Sky_C_Three_Color_Time_Blend) == 0x000080, "Wrong size on Ultra_Dynamic_Sky_C_Three_Color_Time_Blend");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Three_Color_Time_Blend, Day_Color) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_Three_Color_Time_Blend::Day_Color' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Three_Color_Time_Blend, Dusk_Color) == 0x000010, "Member 'Ultra_Dynamic_Sky_C_Three_Color_Time_Blend::Dusk_Color' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Three_Color_Time_Blend, Night_Color) == 0x000020, "Member 'Ultra_Dynamic_Sky_C_Three_Color_Time_Blend::Night_Color' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Three_Color_Time_Blend, Out) == 0x000030, "Member 'Ultra_Dynamic_Sky_C_Three_Color_Time_Blend::Out' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Three_Color_Time_Blend, CallFunc_Sun_Height_Z) == 0x000040, "Member 'Ultra_Dynamic_Sky_C_Three_Color_Time_Blend::CallFunc_Sun_Height_Z' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Three_Color_Time_Blend, CallFunc_Night_Filter_ReturnValue) == 0x000048, "Member 'Ultra_Dynamic_Sky_C_Three_Color_Time_Blend::CallFunc_Night_Filter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Three_Color_Time_Blend, CallFunc_MapRangeClamped_ReturnValue) == 0x000050, "Member 'Ultra_Dynamic_Sky_C_Three_Color_Time_Blend::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Three_Color_Time_Blend, CallFunc_LinearColorLerp_ReturnValue) == 0x000058, "Member 'Ultra_Dynamic_Sky_C_Three_Color_Time_Blend::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Three_Color_Time_Blend, CallFunc_LinearColorLerp_ReturnValue_1) == 0x000068, "Member 'Ultra_Dynamic_Sky_C_Three_Color_Time_Blend::CallFunc_LinearColorLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Three_Color_Time_Blend, CallFunc_LinearColorLerp_Alpha_ImplicitCast) == 0x000078, "Member 'Ultra_Dynamic_Sky_C_Three_Color_Time_Blend::CallFunc_LinearColorLerp_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Three_Color_Time_Blend, CallFunc_LinearColorLerp_Alpha_ImplicitCast_1) == 0x00007C, "Member 'Ultra_Dynamic_Sky_C_Three_Color_Time_Blend::CallFunc_LinearColorLerp_Alpha_ImplicitCast_1' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Absent Directional Lights Brightness
// 0x0050 (0x0050 - 0x0000)
struct Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness final
{
public:
	double                                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Moon_Effective_Illumination_0_1_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Twilight_Brightness_Falloff_Scale;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness");
static_assert(sizeof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness) == 0x000050, "Wrong size on Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, ReturnValue) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_Moon_Effective_Illumination_0_1_ReturnValue) == 0x000008, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_Moon_Effective_Illumination_0_1_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_BreakVector_X) == 0x000010, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_BreakVector_Y) == 0x000018, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_BreakVector_Z) == 0x000020, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_Twilight_Brightness_Falloff_Scale) == 0x000028, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_Twilight_Brightness_Falloff_Scale' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_FMax_ReturnValue) == 0x000030, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000038, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000048, "Member 'Ultra_Dynamic_Sky_C_Absent_Directional_Lights_Brightness::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Add Constructed Components
// 0x02F0 (0x02F0 - 0x0000)
struct Ultra_Dynamic_Sky_C_Add_Constructed_Components final
{
public:
	struct FTransform                             Temp_struct_Variable;                              // 0x0000(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable_1;                            // 0x0060(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkyLightComponent*                     CallFunc_AddComponent_ReturnValue;                 // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_1;               // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0xC];                                       // 0x00D4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00E0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_2;               // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_2;                            // 0x0150(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUDS_PlayerOcclusion_C*                 CallFunc_AddComponent_ReturnValue_3;               // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x01C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C5[0x3];                                      // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0xF];                                      // 0x01E1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x01F0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_4;               // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0262(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0263(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_265[0xB];                                      // 0x0265(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable_3;                            // 0x0270(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D2[0x6];                                      // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue_5;               // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x02E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_Add_Constructed_Components) == 0x000010, "Wrong alignment on Ultra_Dynamic_Sky_C_Add_Constructed_Components");
static_assert(sizeof(Ultra_Dynamic_Sky_C_Add_Constructed_Components) == 0x0002F0, "Wrong size on Ultra_Dynamic_Sky_C_Add_Constructed_Components");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, Temp_struct_Variable) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, Temp_struct_Variable_1) == 0x000060, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_AddComponent_ReturnValue) == 0x0000C0, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_AddComponent_ReturnValue_1) == 0x0000C8, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_IsValid_ReturnValue_1) == 0x0000D1, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_IsValid_ReturnValue_2) == 0x0000D2, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_IsValid_ReturnValue_3) == 0x0000D3, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_MakeTransform_ReturnValue) == 0x0000E0, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_AddComponent_ReturnValue_2) == 0x000140, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_AddComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000148, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, Temp_struct_Variable_2) == 0x000150, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001B0, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_BooleanAND_ReturnValue) == 0x0001B1, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_AddComponent_ReturnValue_3) == 0x0001B8, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_AddComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_IsValid_ReturnValue_4) == 0x0001C0, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_IsValid_ReturnValue_5) == 0x0001C1, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_IsValid_ReturnValue_6) == 0x0001C2, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_IsValid_ReturnValue_7) == 0x0001C3, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0001C4, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_MakeRotator_ReturnValue) == 0x0001C8, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_BooleanAND_ReturnValue_1) == 0x0001E0, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_MakeTransform_ReturnValue_1) == 0x0001F0, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_BooleanAND_ReturnValue_2) == 0x000250, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_AddComponent_ReturnValue_4) == 0x000258, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_AddComponent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_IsValid_ReturnValue_8) == 0x000260, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_IsValid_ReturnValue_9) == 0x000261, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_BooleanOR_ReturnValue) == 0x000262, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_BooleanOR_ReturnValue_1) == 0x000263, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000264, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, Temp_struct_Variable_3) == 0x000270, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0002D0, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_BooleanAND_ReturnValue_3) == 0x0002D1, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_AddComponent_ReturnValue_5) == 0x0002D8, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_AddComponent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_BooleanAND_ReturnValue_4) == 0x0002E0, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_BooleanAND_ReturnValue_5) == 0x0002E1, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_IsValid_ReturnValue_10) == 0x0002E2, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_IsValid_ReturnValue_11) == 0x0002E3, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Constructed_Components, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x0002E4, "Member 'Ultra_Dynamic_Sky_C_Add_Constructed_Components::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Add Modifier
// 0x0088 (0x0088 - 0x0000)
struct Ultra_Dynamic_Sky_C_Add_Modifier final
{
public:
	class UUDS_Modifier_C*                        Modifier;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Fade_In_Time;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Modifier_Index;                                    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0028(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_2;                              // 0x0038(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_2;    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SafeDivide_ReturnValue_1;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_Add_Modifier) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_C_Add_Modifier");
static_assert(sizeof(Ultra_Dynamic_Sky_C_Add_Modifier) == 0x000088, "Wrong size on Ultra_Dynamic_Sky_C_Add_Modifier");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Modifier, Modifier) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_Add_Modifier::Modifier' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Modifier, Fade_In_Time) == 0x000008, "Member 'Ultra_Dynamic_Sky_C_Add_Modifier::Fade_In_Time' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Modifier, Modifier_Index) == 0x000010, "Member 'Ultra_Dynamic_Sky_C_Add_Modifier::Modifier_Index' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Modifier, Temp_real_Variable) == 0x000018, "Member 'Ultra_Dynamic_Sky_C_Add_Modifier::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Modifier, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'Ultra_Dynamic_Sky_C_Add_Modifier::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Modifier, Temp_real_Variable_1) == 0x000028, "Member 'Ultra_Dynamic_Sky_C_Add_Modifier::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Modifier, CallFunc_HasAuthority_ReturnValue) == 0x000030, "Member 'Ultra_Dynamic_Sky_C_Add_Modifier::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Modifier, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000031, "Member 'Ultra_Dynamic_Sky_C_Add_Modifier::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Modifier, CallFunc_EqualEqual_DoubleDouble_ReturnValue_1) == 0x000032, "Member 'Ultra_Dynamic_Sky_C_Add_Modifier::CallFunc_EqualEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Modifier, Temp_real_Variable_2) == 0x000038, "Member 'Ultra_Dynamic_Sky_C_Add_Modifier::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Modifier, CallFunc_EqualEqual_DoubleDouble_ReturnValue_2) == 0x000040, "Member 'Ultra_Dynamic_Sky_C_Add_Modifier::CallFunc_EqualEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Modifier, CallFunc_SafeDivide_ReturnValue) == 0x000048, "Member 'Ultra_Dynamic_Sky_C_Add_Modifier::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Modifier, CallFunc_Array_Find_ReturnValue) == 0x000050, "Member 'Ultra_Dynamic_Sky_C_Add_Modifier::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Modifier, CallFunc_SafeDivide_ReturnValue_1) == 0x000058, "Member 'Ultra_Dynamic_Sky_C_Add_Modifier::CallFunc_SafeDivide_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Modifier, CallFunc_Array_Add_ReturnValue) == 0x000060, "Member 'Ultra_Dynamic_Sky_C_Add_Modifier::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Modifier, CallFunc_Array_Add_ReturnValue_1) == 0x000064, "Member 'Ultra_Dynamic_Sky_C_Add_Modifier::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Modifier, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000068, "Member 'Ultra_Dynamic_Sky_C_Add_Modifier::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Modifier, CallFunc_SelectFloat_ReturnValue) == 0x000070, "Member 'Ultra_Dynamic_Sky_C_Add_Modifier::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Modifier, CallFunc_Array_Add_ReturnValue_2) == 0x000078, "Member 'Ultra_Dynamic_Sky_C_Add_Modifier::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Modifier, CallFunc_Array_Add_ReturnValue_3) == 0x00007C, "Member 'Ultra_Dynamic_Sky_C_Add_Modifier::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Modifier, CallFunc_Array_Contains_ReturnValue) == 0x000080, "Member 'Ultra_Dynamic_Sky_C_Add_Modifier::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Add Object to Async Loading Queue
// 0x0048 (0x0048 - 0x0000)
struct Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue final
{
public:
	TSoftObjectPtr<class UObject>                 Object;                                            // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          High_Priority;                                     // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue");
static_assert(sizeof(Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue) == 0x000048, "Wrong size on Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue, Object) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue::Object' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue, High_Priority) == 0x000028, "Member 'Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue::High_Priority' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000030, "Member 'Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue, CallFunc_Not_PreBool_ReturnValue) == 0x000038, "Member 'Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue, CallFunc_Array_Contains_ReturnValue) == 0x000039, "Member 'Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue, CallFunc_Not_PreBool_ReturnValue_1) == 0x00003A, "Member 'Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue, CallFunc_Array_Contains_ReturnValue_1) == 0x00003B, "Member 'Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue, CallFunc_Not_PreBool_ReturnValue_2) == 0x00003C, "Member 'Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue, CallFunc_Array_Add_ReturnValue) == 0x000040, "Member 'Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue, CallFunc_BooleanAND_ReturnValue) == 0x000044, "Member 'Ultra_Dynamic_Sky_C_Add_Object_to_Async_Loading_Queue::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Add Static Post Process Materials
// 0x0080 (0x0080 - 0x0000)
struct Ultra_Dynamic_Sky_C_Add_Static_Post_Process_Materials final
{
public:
	struct FTransform                             Temp_struct_Variable;                              // 0x0000(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  CallFunc_AddComponent_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FWeightedBlendables                    K2Node_MakeStruct_WeightedBlendables;              // 0x0068(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_Add_Static_Post_Process_Materials) == 0x000010, "Wrong alignment on Ultra_Dynamic_Sky_C_Add_Static_Post_Process_Materials");
static_assert(sizeof(Ultra_Dynamic_Sky_C_Add_Static_Post_Process_Materials) == 0x000080, "Wrong size on Ultra_Dynamic_Sky_C_Add_Static_Post_Process_Materials");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Static_Post_Process_Materials, Temp_struct_Variable) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_Add_Static_Post_Process_Materials::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Static_Post_Process_Materials, CallFunc_AddComponent_ReturnValue) == 0x000060, "Member 'Ultra_Dynamic_Sky_C_Add_Static_Post_Process_Materials::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Static_Post_Process_Materials, K2Node_MakeStruct_WeightedBlendables) == 0x000068, "Member 'Ultra_Dynamic_Sky_C_Add_Static_Post_Process_Materials::K2Node_MakeStruct_WeightedBlendables' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Static_Post_Process_Materials, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'Ultra_Dynamic_Sky_C_Add_Static_Post_Process_Materials::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Add_Static_Post_Process_Materials, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000079, "Member 'Ultra_Dynamic_Sky_C_Add_Static_Post_Process_Materials::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");

// Function Ultra_Dynamic_Sky.Ultra_Dynamic_Sky_C.Adjust Base Sun Light Intensity
// 0x0078 (0x0078 - 0x0000)
struct Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity final
{
public:
	struct FVector                                Sun_Vector;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Intensity;                                         // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Multiplier;                                        // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SafeDivide_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity) == 0x000008, "Wrong alignment on Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity");
static_assert(sizeof(Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity) == 0x000078, "Wrong size on Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity, Sun_Vector) == 0x000000, "Member 'Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity::Sun_Vector' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity, Intensity) == 0x000018, "Member 'Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity::Intensity' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity, Multiplier) == 0x000020, "Member 'Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity::Multiplier' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity, CallFunc_SafeDivide_ReturnValue) == 0x000028, "Member 'Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity, CallFunc_BreakVector_X) == 0x000030, "Member 'Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity, CallFunc_BreakVector_Y) == 0x000038, "Member 'Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity, CallFunc_BreakVector_Z) == 0x000040, "Member 'Ultra_Dynamic_Sky_C_Adjust_Base_Sun_Light_Intensity::CallFunc_BreakVector_Z' has a wrong offset!");
