#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMGCalendarAssetStyle

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass UMGCalendarAssetStyle.UMGCalendarAssetStyle_C
// 0x0040 (0x00A8 - 0x0068)
class UUMGCalendarAssetStyle_C final : public UPrimaryAssetLabel
{
public:
	struct FLinearColor                           CalendarBackgroundColor;                           // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CalendarHeaderClass;                               // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CalendarDayClass;                                  // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CalendarWeekDayClass;                              // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CalendarFooterClass;                               // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BodyBackgroundColor;                               // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMGCalendarAssetStyle_C">();
	}
	static class UUMGCalendarAssetStyle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMGCalendarAssetStyle_C>();
	}
};
static_assert(alignof(UUMGCalendarAssetStyle_C) == 0x000008, "Wrong alignment on UUMGCalendarAssetStyle_C");
static_assert(sizeof(UUMGCalendarAssetStyle_C) == 0x0000A8, "Wrong size on UUMGCalendarAssetStyle_C");
static_assert(offsetof(UUMGCalendarAssetStyle_C, CalendarBackgroundColor) == 0x000068, "Member 'UUMGCalendarAssetStyle_C::CalendarBackgroundColor' has a wrong offset!");
static_assert(offsetof(UUMGCalendarAssetStyle_C, CalendarHeaderClass) == 0x000078, "Member 'UUMGCalendarAssetStyle_C::CalendarHeaderClass' has a wrong offset!");
static_assert(offsetof(UUMGCalendarAssetStyle_C, CalendarDayClass) == 0x000080, "Member 'UUMGCalendarAssetStyle_C::CalendarDayClass' has a wrong offset!");
static_assert(offsetof(UUMGCalendarAssetStyle_C, CalendarWeekDayClass) == 0x000088, "Member 'UUMGCalendarAssetStyle_C::CalendarWeekDayClass' has a wrong offset!");
static_assert(offsetof(UUMGCalendarAssetStyle_C, CalendarFooterClass) == 0x000090, "Member 'UUMGCalendarAssetStyle_C::CalendarFooterClass' has a wrong offset!");
static_assert(offsetof(UUMGCalendarAssetStyle_C, BodyBackgroundColor) == 0x000098, "Member 'UUMGCalendarAssetStyle_C::BodyBackgroundColor' has a wrong offset!");

}

