#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VHSoverlaySaveData

#include "Basic.hpp"

#include "E_WatermarkSetting_structs.hpp"


namespace SDK
{

// UserDefinedStruct VHSoverlaySaveData.VHSoverlaySaveData
// 0x0030 (0x0030 - 0x0000)
struct FVHSoverlaySaveData final
{
public:
	bool                                          RealTime__1_2A41179B4EDAF0A08FE8E386ADD282AD;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Afternoon__3_F466148D46AC9649A30412922537F511;     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasTimer__5_B2DF49FD475EE2B1D4071FAA349E18F7;      // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Year_9_8E1739604251B89247810A9897427E1A;           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Month_11_AD8BA9BB4EB46256E19112A829EC1074;         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Day_13_2EAB32C04813AFA68151BF890D31B8D3;           // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Hour_15_60379A814CC2A64D501C028F36A7B1C5;          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Minute_17_88BFBECD4A3C84999281A6836316532B;        // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_WatermarkSetting                            CornerWaterMarkSelection_21_3C699AD045776D03CE622C8ABA7FF218; // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_WatermarkSetting                            FullscreenWaterMarkSelection_23_A9149C7E48FFD15AEEDFF9AE23A68C87; // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Opacity_26_660F129343183FC9D655BCA75F2EB403;       // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FOpacity_30_AFAFD7194A4A0B7121E878A911F2CFBC;      // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FVHSoverlaySaveData) == 0x000008, "Wrong alignment on FVHSoverlaySaveData");
static_assert(sizeof(FVHSoverlaySaveData) == 0x000030, "Wrong size on FVHSoverlaySaveData");
static_assert(offsetof(FVHSoverlaySaveData, RealTime__1_2A41179B4EDAF0A08FE8E386ADD282AD) == 0x000000, "Member 'FVHSoverlaySaveData::RealTime__1_2A41179B4EDAF0A08FE8E386ADD282AD' has a wrong offset!");
static_assert(offsetof(FVHSoverlaySaveData, Afternoon__3_F466148D46AC9649A30412922537F511) == 0x000001, "Member 'FVHSoverlaySaveData::Afternoon__3_F466148D46AC9649A30412922537F511' has a wrong offset!");
static_assert(offsetof(FVHSoverlaySaveData, HasTimer__5_B2DF49FD475EE2B1D4071FAA349E18F7) == 0x000002, "Member 'FVHSoverlaySaveData::HasTimer__5_B2DF49FD475EE2B1D4071FAA349E18F7' has a wrong offset!");
static_assert(offsetof(FVHSoverlaySaveData, Year_9_8E1739604251B89247810A9897427E1A) == 0x000004, "Member 'FVHSoverlaySaveData::Year_9_8E1739604251B89247810A9897427E1A' has a wrong offset!");
static_assert(offsetof(FVHSoverlaySaveData, Month_11_AD8BA9BB4EB46256E19112A829EC1074) == 0x000008, "Member 'FVHSoverlaySaveData::Month_11_AD8BA9BB4EB46256E19112A829EC1074' has a wrong offset!");
static_assert(offsetof(FVHSoverlaySaveData, Day_13_2EAB32C04813AFA68151BF890D31B8D3) == 0x00000C, "Member 'FVHSoverlaySaveData::Day_13_2EAB32C04813AFA68151BF890D31B8D3' has a wrong offset!");
static_assert(offsetof(FVHSoverlaySaveData, Hour_15_60379A814CC2A64D501C028F36A7B1C5) == 0x000010, "Member 'FVHSoverlaySaveData::Hour_15_60379A814CC2A64D501C028F36A7B1C5' has a wrong offset!");
static_assert(offsetof(FVHSoverlaySaveData, Minute_17_88BFBECD4A3C84999281A6836316532B) == 0x000014, "Member 'FVHSoverlaySaveData::Minute_17_88BFBECD4A3C84999281A6836316532B' has a wrong offset!");
static_assert(offsetof(FVHSoverlaySaveData, CornerWaterMarkSelection_21_3C699AD045776D03CE622C8ABA7FF218) == 0x000018, "Member 'FVHSoverlaySaveData::CornerWaterMarkSelection_21_3C699AD045776D03CE622C8ABA7FF218' has a wrong offset!");
static_assert(offsetof(FVHSoverlaySaveData, FullscreenWaterMarkSelection_23_A9149C7E48FFD15AEEDFF9AE23A68C87) == 0x000019, "Member 'FVHSoverlaySaveData::FullscreenWaterMarkSelection_23_A9149C7E48FFD15AEEDFF9AE23A68C87' has a wrong offset!");
static_assert(offsetof(FVHSoverlaySaveData, Opacity_26_660F129343183FC9D655BCA75F2EB403) == 0x000020, "Member 'FVHSoverlaySaveData::Opacity_26_660F129343183FC9D655BCA75F2EB403' has a wrong offset!");
static_assert(offsetof(FVHSoverlaySaveData, FOpacity_30_AFAFD7194A4A0B7121E878A911F2CFBC) == 0x000028, "Member 'FVHSoverlaySaveData::FOpacity_30_AFAFD7194A4A0B7121E878A911F2CFBC' has a wrong offset!");

}

