#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_OwnerName

#include "Basic.hpp"


namespace SDK::Params
{

// Function W_OwnerName.W_OwnerName_C.ExecuteUbergraph_W_OwnerName
// 0x0028 (0x0028 - 0x0000)
struct W_OwnerName_C_ExecuteUbergraph_W_OwnerName final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0008(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0018(0x0010)()
};
static_assert(alignof(W_OwnerName_C_ExecuteUbergraph_W_OwnerName) == 0x000008, "Wrong alignment on W_OwnerName_C_ExecuteUbergraph_W_OwnerName");
static_assert(sizeof(W_OwnerName_C_ExecuteUbergraph_W_OwnerName) == 0x000028, "Wrong size on W_OwnerName_C_ExecuteUbergraph_W_OwnerName");
static_assert(offsetof(W_OwnerName_C_ExecuteUbergraph_W_OwnerName, EntryPoint) == 0x000000, "Member 'W_OwnerName_C_ExecuteUbergraph_W_OwnerName::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_OwnerName_C_ExecuteUbergraph_W_OwnerName, CallFunc_Conv_StringToText_ReturnValue) == 0x000008, "Member 'W_OwnerName_C_ExecuteUbergraph_W_OwnerName::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_OwnerName_C_ExecuteUbergraph_W_OwnerName, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000018, "Member 'W_OwnerName_C_ExecuteUbergraph_W_OwnerName::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

}

