#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_GroupInvite

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_HUD_GroupInvite.WBP_HUD_GroupInvite_C.ExecuteUbergraph_WBP_HUD_GroupInvite
// 0x0038 (0x0038 - 0x0000)
struct WBP_HUD_GroupInvite_C_ExecuteUbergraph_WBP_HUD_GroupInvite final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerController_C*                 K2Node_DynamicCast_AsBP_Player_Controller;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_GroupInvite_C_ExecuteUbergraph_WBP_HUD_GroupInvite) == 0x000008, "Wrong alignment on WBP_HUD_GroupInvite_C_ExecuteUbergraph_WBP_HUD_GroupInvite");
static_assert(sizeof(WBP_HUD_GroupInvite_C_ExecuteUbergraph_WBP_HUD_GroupInvite) == 0x000038, "Wrong size on WBP_HUD_GroupInvite_C_ExecuteUbergraph_WBP_HUD_GroupInvite");
static_assert(offsetof(WBP_HUD_GroupInvite_C_ExecuteUbergraph_WBP_HUD_GroupInvite, EntryPoint) == 0x000000, "Member 'WBP_HUD_GroupInvite_C_ExecuteUbergraph_WBP_HUD_GroupInvite::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_ExecuteUbergraph_WBP_HUD_GroupInvite, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_HUD_GroupInvite_C_ExecuteUbergraph_WBP_HUD_GroupInvite::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_ExecuteUbergraph_WBP_HUD_GroupInvite, K2Node_DynamicCast_AsBP_Player_Controller) == 0x000010, "Member 'WBP_HUD_GroupInvite_C_ExecuteUbergraph_WBP_HUD_GroupInvite::K2Node_DynamicCast_AsBP_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_ExecuteUbergraph_WBP_HUD_GroupInvite, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_HUD_GroupInvite_C_ExecuteUbergraph_WBP_HUD_GroupInvite::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_ExecuteUbergraph_WBP_HUD_GroupInvite, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'WBP_HUD_GroupInvite_C_ExecuteUbergraph_WBP_HUD_GroupInvite::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_ExecuteUbergraph_WBP_HUD_GroupInvite, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'WBP_HUD_GroupInvite_C_ExecuteUbergraph_WBP_HUD_GroupInvite::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function WBP_HUD_GroupInvite.WBP_HUD_GroupInvite_C.GetAdditionalText
// 0x0240 (0x0240 - 0x0000)
struct WBP_HUD_GroupInvite_C_GetAdditionalText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   ThreatenCallKeyBind;                               // 0x0010(0x0010)(Edit, BlueprintVisible)
	class FText                                   FriendlyCallKeyBind;                               // 0x0020(0x0010)(Edit, BlueprintVisible)
	class FText                                   ProfileKeyBind;                                    // 0x0030(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A0(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00E8(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0130(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0140(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0150(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0160(0x0010)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_2;                // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0178(0x0010)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_SelectText_ReturnValue_1;                 // 0x0190(0x0010)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetActionNames_ActionNames;               // 0x01B0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_SelectText_ReturnValue_2;                 // 0x01C0(0x0010)()
	class FName                                   CallFunc_Array_Get_Item;                           // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings;       // 0x01D8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item_1;                         // 0x01F0(0x0028)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Key_IsGamepadKey_ReturnValue;             // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetFriendlyKeyName_ReturnValue;           // 0x0220(0x0010)()
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_233[0x1];                                      // 0x0233(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HUD_GroupInvite_C_GetAdditionalText) == 0x000008, "Wrong alignment on WBP_HUD_GroupInvite_C_GetAdditionalText");
static_assert(sizeof(WBP_HUD_GroupInvite_C_GetAdditionalText) == 0x000240, "Wrong size on WBP_HUD_GroupInvite_C_GetAdditionalText");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, ReturnValue) == 0x000000, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, ThreatenCallKeyBind) == 0x000010, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::ThreatenCallKeyBind' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, FriendlyCallKeyBind) == 0x000020, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::FriendlyCallKeyBind' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, ProfileKeyBind) == 0x000030, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::ProfileKeyBind' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, Temp_int_Array_Index_Variable) == 0x000040, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, Temp_int_Array_Index_Variable_1) == 0x00004C, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, CallFunc_TextIsEmpty_ReturnValue) == 0x000098, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A0, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000E8, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, K2Node_MakeArray_Array) == 0x000130, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, K2Node_MakeArray_Array_1) == 0x000140, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, CallFunc_Format_ReturnValue) == 0x000150, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, CallFunc_Format_ReturnValue_1) == 0x000160, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, CallFunc_TextIsEmpty_ReturnValue_1) == 0x000170, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, CallFunc_TextIsEmpty_ReturnValue_2) == 0x000171, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::CallFunc_TextIsEmpty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, CallFunc_SelectText_ReturnValue) == 0x000178, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::CallFunc_SelectText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, CallFunc_BooleanOR_ReturnValue) == 0x000188, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, Temp_int_Loop_Counter_Variable_1) == 0x00018C, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, CallFunc_SelectText_ReturnValue_1) == 0x000190, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::CallFunc_SelectText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001A0, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, CallFunc_GetInputSettings_ReturnValue) == 0x0001A8, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::CallFunc_GetInputSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, CallFunc_GetActionNames_ActionNames) == 0x0001B0, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::CallFunc_GetActionNames_ActionNames' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, CallFunc_SelectText_ReturnValue_2) == 0x0001C0, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::CallFunc_SelectText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, CallFunc_Array_Get_Item) == 0x0001D0, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, CallFunc_GetActionMappingByName_OutMappings) == 0x0001D8, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::CallFunc_GetActionMappingByName_OutMappings' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, CallFunc_Array_Length_ReturnValue) == 0x0001E8, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, CallFunc_Array_Get_Item_1) == 0x0001F0, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, CallFunc_Less_IntInt_ReturnValue) == 0x000218, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, CallFunc_Key_IsGamepadKey_ReturnValue) == 0x000219, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::CallFunc_Key_IsGamepadKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, CallFunc_GetFriendlyKeyName_ReturnValue) == 0x000220, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::CallFunc_GetFriendlyKeyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000230, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000231, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x000232, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, CallFunc_Array_Length_ReturnValue_1) == 0x000234, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetAdditionalText, CallFunc_Less_IntInt_ReturnValue_1) == 0x000238, "Member 'WBP_HUD_GroupInvite_C_GetAdditionalText::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_HUD_GroupInvite.WBP_HUD_GroupInvite_C.GetInviteText
// 0x0130 (0x0130 - 0x0000)
struct WBP_HUD_GroupInvite_C_GetInviteText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0030(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0088(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00D0(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x00E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0100(0x0010)()
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0110(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0120(0x0010)()
};
static_assert(alignof(WBP_HUD_GroupInvite_C_GetInviteText) == 0x000008, "Wrong alignment on WBP_HUD_GroupInvite_C_GetInviteText");
static_assert(sizeof(WBP_HUD_GroupInvite_C_GetInviteText) == 0x000130, "Wrong size on WBP_HUD_GroupInvite_C_GetInviteText");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetInviteText, ReturnValue) == 0x000000, "Member 'WBP_HUD_GroupInvite_C_GetInviteText::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetInviteText, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_HUD_GroupInvite_C_GetInviteText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetInviteText, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'WBP_HUD_GroupInvite_C_GetInviteText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetInviteText, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000030, "Member 'WBP_HUD_GroupInvite_C_GetInviteText::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetInviteText, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'WBP_HUD_GroupInvite_C_GetInviteText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetInviteText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000088, "Member 'WBP_HUD_GroupInvite_C_GetInviteText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetInviteText, K2Node_MakeArray_Array_1) == 0x0000D0, "Member 'WBP_HUD_GroupInvite_C_GetInviteText::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetInviteText, K2Node_MakeArray_Array_2) == 0x0000E0, "Member 'WBP_HUD_GroupInvite_C_GetInviteText::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetInviteText, CallFunc_Format_ReturnValue) == 0x0000F0, "Member 'WBP_HUD_GroupInvite_C_GetInviteText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetInviteText, CallFunc_Format_ReturnValue_1) == 0x000100, "Member 'WBP_HUD_GroupInvite_C_GetInviteText::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetInviteText, CallFunc_SelectText_ReturnValue) == 0x000110, "Member 'WBP_HUD_GroupInvite_C_GetInviteText::CallFunc_SelectText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_GetInviteText, CallFunc_Format_ReturnValue_2) == 0x000120, "Member 'WBP_HUD_GroupInvite_C_GetInviteText::CallFunc_Format_ReturnValue_2' has a wrong offset!");

// Function WBP_HUD_GroupInvite.WBP_HUD_GroupInvite_C.SetMessage
// 0x0020 (0x0020 - 0x0000)
struct WBP_HUD_GroupInvite_C_SetMessage final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0010)()
};
static_assert(alignof(WBP_HUD_GroupInvite_C_SetMessage) == 0x000008, "Wrong alignment on WBP_HUD_GroupInvite_C_SetMessage");
static_assert(sizeof(WBP_HUD_GroupInvite_C_SetMessage) == 0x000020, "Wrong size on WBP_HUD_GroupInvite_C_SetMessage");
static_assert(offsetof(WBP_HUD_GroupInvite_C_SetMessage, Message) == 0x000000, "Member 'WBP_HUD_GroupInvite_C_SetMessage::Message' has a wrong offset!");
static_assert(offsetof(WBP_HUD_GroupInvite_C_SetMessage, CallFunc_Conv_StringToText_ReturnValue) == 0x000010, "Member 'WBP_HUD_GroupInvite_C_SetMessage::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

