#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_JoinServer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "OnlineSubsystemUtils_structs.hpp"
#include "TheIsle_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_JoinServer.WBP_JoinServer_C
// 0x0218 (0x05A8 - 0x0390)
class UWBP_JoinServer_C final : public UTIUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Favourite;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                JoinButton;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SecureRow;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectedHighlight;                                 // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_148;                                     // 0x03B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_304;                                     // 0x03C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_305;                                     // 0x03C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_306;                                     // 0x03D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_660;                                     // 0x03D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Server;                                  // 0x03E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FBlueprintSessionResult                ServerSession;                                     // 0x03E8(0x0120)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bClicked;                                          // 0x0508(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ProjectVersion;                                    // 0x0510(0x0010)(Edit, BlueprintVisible)
	class FString                                 GeneratedSessionName;                              // 0x0520(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         MaxPlayers;                                        // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_534[0x4];                                      // 0x0534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 GeneratedProjectVersion;                           // 0x0538(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UWBP_ServerList_C*                      MyOwnerWidget;                                     // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 DiscordLink;                                       // 0x0550(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bOfficial;                                         // 0x0560(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bServerPassword;                                   // 0x0561(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_562[0x6];                                      // 0x0562(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   MapName;                                           // 0x0568(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FString                                 TempSName;                                         // 0x0578(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 TempoVersion;                                      // 0x0588(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 TempIP;                                            // 0x0598(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__JoinButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void CustomEvent_0();
	void ExecuteUbergraph_WBP_JoinServer(int32 EntryPoint);
	ESlateVisibility Get_Favourite_Visibility_0();
	ESlateVisibility Get_SecureRow_Visibility_0();
	struct FSlateColor GetColorAndOpacity_0();
	void HighlightServer(bool bHighlight);
	void Update_Data();
	void WBP_JoinServer_AutoGenFunc(float PingTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_JoinServer_C">();
	}
	static class UWBP_JoinServer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_JoinServer_C>();
	}
};
static_assert(alignof(UWBP_JoinServer_C) == 0x000008, "Wrong alignment on UWBP_JoinServer_C");
static_assert(sizeof(UWBP_JoinServer_C) == 0x0005A8, "Wrong size on UWBP_JoinServer_C");
static_assert(offsetof(UWBP_JoinServer_C, UberGraphFrame) == 0x000390, "Member 'UWBP_JoinServer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServer_C, Favourite) == 0x000398, "Member 'UWBP_JoinServer_C::Favourite' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServer_C, JoinButton) == 0x0003A0, "Member 'UWBP_JoinServer_C::JoinButton' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServer_C, SecureRow) == 0x0003A8, "Member 'UWBP_JoinServer_C::SecureRow' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServer_C, SelectedHighlight) == 0x0003B0, "Member 'UWBP_JoinServer_C::SelectedHighlight' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServer_C, TextBlock_148) == 0x0003B8, "Member 'UWBP_JoinServer_C::TextBlock_148' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServer_C, TextBlock_304) == 0x0003C0, "Member 'UWBP_JoinServer_C::TextBlock_304' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServer_C, TextBlock_305) == 0x0003C8, "Member 'UWBP_JoinServer_C::TextBlock_305' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServer_C, TextBlock_306) == 0x0003D0, "Member 'UWBP_JoinServer_C::TextBlock_306' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServer_C, TextBlock_660) == 0x0003D8, "Member 'UWBP_JoinServer_C::TextBlock_660' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServer_C, TextBlock_Server) == 0x0003E0, "Member 'UWBP_JoinServer_C::TextBlock_Server' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServer_C, ServerSession) == 0x0003E8, "Member 'UWBP_JoinServer_C::ServerSession' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServer_C, bClicked) == 0x000508, "Member 'UWBP_JoinServer_C::bClicked' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServer_C, ProjectVersion) == 0x000510, "Member 'UWBP_JoinServer_C::ProjectVersion' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServer_C, GeneratedSessionName) == 0x000520, "Member 'UWBP_JoinServer_C::GeneratedSessionName' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServer_C, MaxPlayers) == 0x000530, "Member 'UWBP_JoinServer_C::MaxPlayers' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServer_C, GeneratedProjectVersion) == 0x000538, "Member 'UWBP_JoinServer_C::GeneratedProjectVersion' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServer_C, MyOwnerWidget) == 0x000548, "Member 'UWBP_JoinServer_C::MyOwnerWidget' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServer_C, DiscordLink) == 0x000550, "Member 'UWBP_JoinServer_C::DiscordLink' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServer_C, bOfficial) == 0x000560, "Member 'UWBP_JoinServer_C::bOfficial' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServer_C, bServerPassword) == 0x000561, "Member 'UWBP_JoinServer_C::bServerPassword' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServer_C, MapName) == 0x000568, "Member 'UWBP_JoinServer_C::MapName' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServer_C, TempSName) == 0x000578, "Member 'UWBP_JoinServer_C::TempSName' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServer_C, TempoVersion) == 0x000588, "Member 'UWBP_JoinServer_C::TempoVersion' has a wrong offset!");
static_assert(offsetof(UWBP_JoinServer_C, TempIP) == 0x000598, "Member 'UWBP_JoinServer_C::TempIP' has a wrong offset!");

}

