#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FactionSelect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TheIsle_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_FactionSelect.WBP_FactionSelect_C.ExecuteUbergraph_WBP_FactionSelect
// 0x0840 (0x0840 - 0x0000)
struct WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CharacterSelectItem_C*             CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTIAvailableClassData>          K2Node_CustomEvent_Classes_1;                      // 0x0030(0x0010)(ConstParm, ReferenceParm)
	class ABP_PlayerController_C*                 K2Node_DynamicCast_AsBP_Player_Controller;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTIAvailableClassData                  CallFunc_Array_Get_Item;                           // 0x0050(0x0038)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0090(0x0010)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance;             // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         K2Node_CustomEvent_Classes;                        // 0x00C0(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D6[0x2];                                       // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_SelectObject_ReturnValue;                 // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_SelectObject_ReturnValue_1;               // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSteamIdString_ReturnValue;             // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance_1;           // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerController_C*                 K2Node_DynamicCast_AsBP_Player_Controller_1;       // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIHUD*                                 CallFunc_GetIsleHUD_ReturnValue;                   // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0130(0x0014)()
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSteamIdString_ReturnValue_1;           // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enabled;                        // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0160(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0230(0x00D0)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0300(0x0014)()
	bool                                          Temp_bool_Variable_1;                              // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0315(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_316[0x2];                                      // 0x0316(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default_1;                           // 0x0318(0x0014)()
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_2;                    // 0x0330(0x00D0)()
	class UWBP_SpawnZoneSelect_C*                 CallFunc_Create_ReturnValue_1;                     // 0x0400(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_408[0x8];                                      // 0x0408(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle;                     // 0x0410(0x03F0)()
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_2;            // 0x0800(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0808(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance_2;           // 0x0810(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0818(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_819[0x7];                                      // 0x0819(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0820(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_SkinGameMode_C*                     K2Node_DynamicCast_AsBP_Skin_Game_Mode;            // 0x0828(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0830(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_831[0x7];                                      // 0x0831(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AUltra_Dynamic_Weather_C*               CallFunc_GetActorOfClass_ReturnValue;              // 0x0838(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect) == 0x000010, "Wrong alignment on WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect");
static_assert(sizeof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect) == 0x000840, "Wrong size on WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, EntryPoint) == 0x000000, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, Temp_bool_Variable) == 0x000011, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, Temp_byte_Variable) == 0x000012, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, Temp_byte_Variable_1) == 0x000013, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, CallFunc_IsValid_ReturnValue_1) == 0x000014, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, Temp_int_Array_Index_Variable) == 0x000020, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, K2Node_CustomEvent_Classes_1) == 0x000030, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::K2Node_CustomEvent_Classes_1' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, K2Node_DynamicCast_AsBP_Player_Controller) == 0x000040, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::K2Node_DynamicCast_AsBP_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, CallFunc_Conv_NameToText_ReturnValue) == 0x000090, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, CallFunc_GetGameInstance_ReturnValue) == 0x0000A8, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, K2Node_DynamicCast_AsBP_Game_Instance) == 0x0000B0, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::K2Node_DynamicCast_AsBP_Game_Instance' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, K2Node_CustomEvent_Classes) == 0x0000C0, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::K2Node_CustomEvent_Classes' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, CallFunc_Array_Length_ReturnValue_1) == 0x0000D0, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D4, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, K2Node_Select_Default) == 0x0000D5, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, CallFunc_SelectObject_ReturnValue) == 0x0000D8, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::CallFunc_SelectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, CallFunc_SelectObject_ReturnValue_1) == 0x0000E0, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::CallFunc_SelectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, CallFunc_GetSteamIdString_ReturnValue) == 0x0000E8, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::CallFunc_GetSteamIdString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, CallFunc_GetGameInstance_ReturnValue_1) == 0x0000F8, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, CallFunc_GetOwningPlayer_ReturnValue) == 0x000100, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, K2Node_DynamicCast_AsBP_Game_Instance_1) == 0x000108, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::K2Node_DynamicCast_AsBP_Game_Instance_1' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, K2Node_DynamicCast_bSuccess_2) == 0x000110, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, K2Node_DynamicCast_AsBP_Player_Controller_1) == 0x000118, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::K2Node_DynamicCast_AsBP_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, K2Node_DynamicCast_bSuccess_3) == 0x000120, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, CallFunc_GetIsleHUD_ReturnValue) == 0x000128, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::CallFunc_GetIsleHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, K2Node_MakeStruct_SlateColor) == 0x000130, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, CallFunc_GetSteamIdString_ReturnValue_1) == 0x000148, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::CallFunc_GetSteamIdString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, K2Node_CustomEvent_Enabled) == 0x000158, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::K2Node_CustomEvent_Enabled' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, K2Node_MakeStruct_SlateBrush) == 0x000160, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, K2Node_MakeStruct_SlateBrush_1) == 0x000230, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, K2Node_MakeStruct_SlateColor_1) == 0x000300, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, Temp_bool_Variable_1) == 0x000314, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000315, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, K2Node_Select_Default_1) == 0x000318, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, K2Node_MakeStruct_SlateBrush_2) == 0x000330, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::K2Node_MakeStruct_SlateBrush_2' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, CallFunc_Create_ReturnValue_1) == 0x000400, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, K2Node_MakeStruct_ButtonStyle) == 0x000410, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::K2Node_MakeStruct_ButtonStyle' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, CallFunc_GetGameInstance_ReturnValue_2) == 0x000800, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::CallFunc_GetGameInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, CallFunc_AddChild_ReturnValue) == 0x000808, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, K2Node_DynamicCast_AsBP_Game_Instance_2) == 0x000810, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::K2Node_DynamicCast_AsBP_Game_Instance_2' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, K2Node_DynamicCast_bSuccess_4) == 0x000818, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, CallFunc_GetGameMode_ReturnValue) == 0x000820, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, K2Node_DynamicCast_AsBP_Skin_Game_Mode) == 0x000828, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::K2Node_DynamicCast_AsBP_Skin_Game_Mode' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, K2Node_DynamicCast_bSuccess_5) == 0x000830, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect, CallFunc_GetActorOfClass_ReturnValue) == 0x000838, "Member 'WBP_FactionSelect_C_ExecuteUbergraph_WBP_FactionSelect::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");

// Function WBP_FactionSelect.WBP_FactionSelect_C.Get_TextBlock_135_Text
// 0x0060 (0x0060 - 0x0000)
struct WBP_FactionSelect_C_Get_TextBlock_135_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0020(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0030(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0040(0x0010)()
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0050(0x0010)()
};
static_assert(alignof(WBP_FactionSelect_C_Get_TextBlock_135_Text) == 0x000008, "Wrong alignment on WBP_FactionSelect_C_Get_TextBlock_135_Text");
static_assert(sizeof(WBP_FactionSelect_C_Get_TextBlock_135_Text) == 0x000060, "Wrong size on WBP_FactionSelect_C_Get_TextBlock_135_Text");
static_assert(offsetof(WBP_FactionSelect_C_Get_TextBlock_135_Text, ReturnValue) == 0x000000, "Member 'WBP_FactionSelect_C_Get_TextBlock_135_Text::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_Get_TextBlock_135_Text, K2Node_MakeArray_Array) == 0x000010, "Member 'WBP_FactionSelect_C_Get_TextBlock_135_Text::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_Get_TextBlock_135_Text, K2Node_MakeArray_Array_1) == 0x000020, "Member 'WBP_FactionSelect_C_Get_TextBlock_135_Text::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_Get_TextBlock_135_Text, CallFunc_Format_ReturnValue) == 0x000030, "Member 'WBP_FactionSelect_C_Get_TextBlock_135_Text::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_Get_TextBlock_135_Text, CallFunc_Format_ReturnValue_1) == 0x000040, "Member 'WBP_FactionSelect_C_Get_TextBlock_135_Text::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_Get_TextBlock_135_Text, CallFunc_SelectText_ReturnValue) == 0x000050, "Member 'WBP_FactionSelect_C_Get_TextBlock_135_Text::CallFunc_SelectText_ReturnValue' has a wrong offset!");

// Function WBP_FactionSelect.WBP_FactionSelect_C.OnClosed
// 0x0003 (0x0003 - 0x0000)
struct WBP_FactionSelect_C_OnClosed final
{
public:
	bool                                          bInstant;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseGameInput_ReturnValue;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FactionSelect_C_OnClosed) == 0x000001, "Wrong alignment on WBP_FactionSelect_C_OnClosed");
static_assert(sizeof(WBP_FactionSelect_C_OnClosed) == 0x000003, "Wrong size on WBP_FactionSelect_C_OnClosed");
static_assert(offsetof(WBP_FactionSelect_C_OnClosed, bInstant) == 0x000000, "Member 'WBP_FactionSelect_C_OnClosed::bInstant' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_OnClosed, ReturnValue) == 0x000001, "Member 'WBP_FactionSelect_C_OnClosed::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_OnClosed, CallFunc_UseGameInput_ReturnValue) == 0x000002, "Member 'WBP_FactionSelect_C_OnClosed::CallFunc_UseGameInput_ReturnValue' has a wrong offset!");

// Function WBP_FactionSelect.WBP_FactionSelect_C.OnOpened
// 0x0003 (0x0003 - 0x0000)
struct WBP_FactionSelect_C_OnOpened final
{
public:
	bool                                          bInstant;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseUIInput_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FactionSelect_C_OnOpened) == 0x000001, "Wrong alignment on WBP_FactionSelect_C_OnOpened");
static_assert(sizeof(WBP_FactionSelect_C_OnOpened) == 0x000003, "Wrong size on WBP_FactionSelect_C_OnOpened");
static_assert(offsetof(WBP_FactionSelect_C_OnOpened, bInstant) == 0x000000, "Member 'WBP_FactionSelect_C_OnOpened::bInstant' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_OnOpened, ReturnValue) == 0x000001, "Member 'WBP_FactionSelect_C_OnOpened::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FactionSelect_C_OnOpened, CallFunc_UseUIInput_ReturnValue) == 0x000002, "Member 'WBP_FactionSelect_C_OnOpened::CallFunc_UseUIInput_ReturnValue' has a wrong offset!");

// Function WBP_FactionSelect.WBP_FactionSelect_C.OnReceivedAvailableClasses
// 0x0010 (0x0010 - 0x0000)
struct WBP_FactionSelect_C_OnReceivedAvailableClasses final
{
public:
	TArray<struct FTIAvailableClassData>          Classes;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_FactionSelect_C_OnReceivedAvailableClasses) == 0x000008, "Wrong alignment on WBP_FactionSelect_C_OnReceivedAvailableClasses");
static_assert(sizeof(WBP_FactionSelect_C_OnReceivedAvailableClasses) == 0x000010, "Wrong size on WBP_FactionSelect_C_OnReceivedAvailableClasses");
static_assert(offsetof(WBP_FactionSelect_C_OnReceivedAvailableClasses, Classes) == 0x000000, "Member 'WBP_FactionSelect_C_OnReceivedAvailableClasses::Classes' has a wrong offset!");

// Function WBP_FactionSelect.WBP_FactionSelect_C.OnReceivedNestSpecies
// 0x0010 (0x0010 - 0x0000)
struct WBP_FactionSelect_C_OnReceivedNestSpecies final
{
public:
	TArray<class UClass*>                         Classes;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_FactionSelect_C_OnReceivedNestSpecies) == 0x000008, "Wrong alignment on WBP_FactionSelect_C_OnReceivedNestSpecies");
static_assert(sizeof(WBP_FactionSelect_C_OnReceivedNestSpecies) == 0x000010, "Wrong size on WBP_FactionSelect_C_OnReceivedNestSpecies");
static_assert(offsetof(WBP_FactionSelect_C_OnReceivedNestSpecies, Classes) == 0x000000, "Member 'WBP_FactionSelect_C_OnReceivedNestSpecies::Classes' has a wrong offset!");

// Function WBP_FactionSelect.WBP_FactionSelect_C.SetHumanButtonEnabled
// 0x0001 (0x0001 - 0x0000)
struct WBP_FactionSelect_C_SetHumanButtonEnabled final
{
public:
	bool                                          Enabled;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FactionSelect_C_SetHumanButtonEnabled) == 0x000001, "Wrong alignment on WBP_FactionSelect_C_SetHumanButtonEnabled");
static_assert(sizeof(WBP_FactionSelect_C_SetHumanButtonEnabled) == 0x000001, "Wrong size on WBP_FactionSelect_C_SetHumanButtonEnabled");
static_assert(offsetof(WBP_FactionSelect_C_SetHumanButtonEnabled, Enabled) == 0x000000, "Member 'WBP_FactionSelect_C_SetHumanButtonEnabled::Enabled' has a wrong offset!");

}

