#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Chat

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "InputCore_structs.hpp"
#include "TheIsle_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Chat.WBP_Chat_C.AttemptToFireACommand
// 0x0030 (0x0030 - 0x0000)
struct WBP_Chat_C_AttemptToFireACommand final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash)
	bool                                          bFromChatModes;                                    // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bChatMode;                                         // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATIPlayerController*                    K2Node_DynamicCast_AsThe_Isle_Player_Controller;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Chat_C_AttemptToFireACommand) == 0x000008, "Wrong alignment on WBP_Chat_C_AttemptToFireACommand");
static_assert(sizeof(WBP_Chat_C_AttemptToFireACommand) == 0x000030, "Wrong size on WBP_Chat_C_AttemptToFireACommand");
static_assert(offsetof(WBP_Chat_C_AttemptToFireACommand, Text) == 0x000000, "Member 'WBP_Chat_C_AttemptToFireACommand::Text' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_AttemptToFireACommand, bFromChatModes) == 0x000010, "Member 'WBP_Chat_C_AttemptToFireACommand::bFromChatModes' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_AttemptToFireACommand, bChatMode) == 0x000011, "Member 'WBP_Chat_C_AttemptToFireACommand::bChatMode' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_AttemptToFireACommand, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000012, "Member 'WBP_Chat_C_AttemptToFireACommand::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_AttemptToFireACommand, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000013, "Member 'WBP_Chat_C_AttemptToFireACommand::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_AttemptToFireACommand, CallFunc_GetOwningPlayer_ReturnValue) == 0x000018, "Member 'WBP_Chat_C_AttemptToFireACommand::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_AttemptToFireACommand, K2Node_DynamicCast_AsThe_Isle_Player_Controller) == 0x000020, "Member 'WBP_Chat_C_AttemptToFireACommand::K2Node_DynamicCast_AsThe_Isle_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_AttemptToFireACommand, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_Chat_C_AttemptToFireACommand::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_Chat.WBP_Chat_C.Autocomplete
// 0x0068 (0x0068 - 0x0000)
struct WBP_Chat_C_Autocomplete final
{
public:
	struct FCommandInfo                           CallFunc_Array_Get_Item;                           // 0x0000(0x0028)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0058(0x0010)()
};
static_assert(alignof(WBP_Chat_C_Autocomplete) == 0x000008, "Wrong alignment on WBP_Chat_C_Autocomplete");
static_assert(sizeof(WBP_Chat_C_Autocomplete) == 0x000068, "Wrong size on WBP_Chat_C_Autocomplete");
static_assert(offsetof(WBP_Chat_C_Autocomplete, CallFunc_Array_Get_Item) == 0x000000, "Member 'WBP_Chat_C_Autocomplete::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_Autocomplete, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'WBP_Chat_C_Autocomplete::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_Autocomplete, CallFunc_Conv_TextToString_ReturnValue) == 0x000038, "Member 'WBP_Chat_C_Autocomplete::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_Autocomplete, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'WBP_Chat_C_Autocomplete::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_Autocomplete, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000058, "Member 'WBP_Chat_C_Autocomplete::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function WBP_Chat.WBP_Chat_C.BndEvt__InputTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_Chat_C_BndEvt__InputTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Chat_C_BndEvt__InputTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Chat_C_BndEvt__InputTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_Chat_C_BndEvt__InputTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_Chat_C_BndEvt__InputTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_Chat_C_BndEvt__InputTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_Chat_C_BndEvt__InputTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_BndEvt__InputTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000010, "Member 'WBP_Chat_C_BndEvt__InputTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_Chat.WBP_Chat_C.BndEvt__InputTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Chat_C_BndEvt__InputTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Chat_C_BndEvt__InputTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Chat_C_BndEvt__InputTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_Chat_C_BndEvt__InputTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000010, "Wrong size on WBP_Chat_C_BndEvt__InputTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_Chat_C_BndEvt__InputTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_Chat_C_BndEvt__InputTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_Chat.WBP_Chat_C.CheckAndRequestUnstuckCommand
// 0x0038 (0x0038 - 0x0000)
struct WBP_Chat_C_CheckAndRequestUnstuckCommand final
{
public:
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATIPlayerController*                    K2Node_DynamicCast_AsThe_Isle_Player_Controller;   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATICharacterBase*                       K2Node_DynamicCast_AsThe_Isle_Character_Base;      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFlying_ReturnValue;                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityState                                 CallFunc_GetAbilityState_ReturnValue;              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSwimming_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Chat_C_CheckAndRequestUnstuckCommand) == 0x000008, "Wrong alignment on WBP_Chat_C_CheckAndRequestUnstuckCommand");
static_assert(sizeof(WBP_Chat_C_CheckAndRequestUnstuckCommand) == 0x000038, "Wrong size on WBP_Chat_C_CheckAndRequestUnstuckCommand");
static_assert(offsetof(WBP_Chat_C_CheckAndRequestUnstuckCommand, CallFunc_GetOwningPlayer_ReturnValue) == 0x000000, "Member 'WBP_Chat_C_CheckAndRequestUnstuckCommand::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckAndRequestUnstuckCommand, K2Node_DynamicCast_AsThe_Isle_Player_Controller) == 0x000008, "Member 'WBP_Chat_C_CheckAndRequestUnstuckCommand::K2Node_DynamicCast_AsThe_Isle_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckAndRequestUnstuckCommand, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_Chat_C_CheckAndRequestUnstuckCommand::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckAndRequestUnstuckCommand, CallFunc_K2_GetPawn_ReturnValue) == 0x000018, "Member 'WBP_Chat_C_CheckAndRequestUnstuckCommand::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckAndRequestUnstuckCommand, K2Node_DynamicCast_AsThe_Isle_Character_Base) == 0x000020, "Member 'WBP_Chat_C_CheckAndRequestUnstuckCommand::K2Node_DynamicCast_AsThe_Isle_Character_Base' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckAndRequestUnstuckCommand, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'WBP_Chat_C_CheckAndRequestUnstuckCommand::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckAndRequestUnstuckCommand, CallFunc_IsFlying_ReturnValue) == 0x000029, "Member 'WBP_Chat_C_CheckAndRequestUnstuckCommand::CallFunc_IsFlying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckAndRequestUnstuckCommand, CallFunc_GetAbilityState_ReturnValue) == 0x00002A, "Member 'WBP_Chat_C_CheckAndRequestUnstuckCommand::CallFunc_GetAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckAndRequestUnstuckCommand, CallFunc_Not_PreBool_ReturnValue) == 0x00002B, "Member 'WBP_Chat_C_CheckAndRequestUnstuckCommand::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckAndRequestUnstuckCommand, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002C, "Member 'WBP_Chat_C_CheckAndRequestUnstuckCommand::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckAndRequestUnstuckCommand, CallFunc_BooleanAND_ReturnValue) == 0x00002D, "Member 'WBP_Chat_C_CheckAndRequestUnstuckCommand::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckAndRequestUnstuckCommand, CallFunc_Not_PreBool_ReturnValue_1) == 0x00002E, "Member 'WBP_Chat_C_CheckAndRequestUnstuckCommand::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckAndRequestUnstuckCommand, CallFunc_BooleanAND_ReturnValue_1) == 0x00002F, "Member 'WBP_Chat_C_CheckAndRequestUnstuckCommand::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckAndRequestUnstuckCommand, CallFunc_IsSwimming_ReturnValue) == 0x000030, "Member 'WBP_Chat_C_CheckAndRequestUnstuckCommand::CallFunc_IsSwimming_ReturnValue' has a wrong offset!");

// Function WBP_Chat.WBP_Chat_C.CheckMessageAndCurrentChatModeToToggleVisibility
// 0x0010 (0x0010 - 0x0000)
struct WBP_Chat_C_CheckMessageAndCurrentChatModeToToggleVisibility final
{
public:
	class UBP_GameHUD_C*                          MyHUDRef;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EChatMode                                     MessageType;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Chat_C_CheckMessageAndCurrentChatModeToToggleVisibility) == 0x000008, "Wrong alignment on WBP_Chat_C_CheckMessageAndCurrentChatModeToToggleVisibility");
static_assert(sizeof(WBP_Chat_C_CheckMessageAndCurrentChatModeToToggleVisibility) == 0x000010, "Wrong size on WBP_Chat_C_CheckMessageAndCurrentChatModeToToggleVisibility");
static_assert(offsetof(WBP_Chat_C_CheckMessageAndCurrentChatModeToToggleVisibility, MyHUDRef) == 0x000000, "Member 'WBP_Chat_C_CheckMessageAndCurrentChatModeToToggleVisibility::MyHUDRef' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckMessageAndCurrentChatModeToToggleVisibility, MessageType) == 0x000008, "Member 'WBP_Chat_C_CheckMessageAndCurrentChatModeToToggleVisibility::MessageType' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckMessageAndCurrentChatModeToToggleVisibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000009, "Member 'WBP_Chat_C_CheckMessageAndCurrentChatModeToToggleVisibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_Chat.WBP_Chat_C.CheckScrollBoxesChildrenCount
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_Chat_C_CheckScrollBoxesChildrenCount final
{
public:
	class UBP_GameHUD_C*                          BP_GameHUD;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue_1;           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue_2;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue_3;           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_3;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue_1;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9F[0x1];                                       // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_6;                               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_3;                         // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item_4;                         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue_2;                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_4;           // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB[0x1];                                       // 0x00BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item_5;                         // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item_6;                         // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_2;           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveChild_ReturnValue_3;                // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_7;                               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_7;                         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_3;           // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_5;           // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_6;           // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_7;           // 0x00EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Chat_C_CheckScrollBoxesChildrenCount) == 0x000008, "Wrong alignment on WBP_Chat_C_CheckScrollBoxesChildrenCount");
static_assert(sizeof(WBP_Chat_C_CheckScrollBoxesChildrenCount) == 0x0000F8, "Wrong size on WBP_Chat_C_CheckScrollBoxesChildrenCount");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, BP_GameHUD) == 0x000000, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::BP_GameHUD' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, Temp_int_Variable) == 0x000008, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_GetChildrenCount_ReturnValue) == 0x000014, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_GetChildrenCount_ReturnValue_1) == 0x00001C, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_GetChildrenCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000020, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_GetChildrenCount_ReturnValue_2) == 0x000024, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_GetChildrenCount_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_GreaterEqual_IntInt_ReturnValue_2) == 0x000028, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_GreaterEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_GetChildrenCount_ReturnValue_3) == 0x00002C, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_GetChildrenCount_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_GreaterEqual_IntInt_ReturnValue_3) == 0x000030, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_GreaterEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, Temp_int_Variable_1) == 0x000034, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Add_IntInt_ReturnValue_1) == 0x000038, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, Temp_int_Variable_2) == 0x00003C, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Add_IntInt_ReturnValue_2) == 0x000040, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, Temp_int_Variable_3) == 0x000044, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Add_IntInt_ReturnValue_3) == 0x000048, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, Temp_int_Variable_4) == 0x00004C, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Add_IntInt_ReturnValue_4) == 0x000050, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, Temp_int_Variable_5) == 0x000054, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::Temp_int_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Add_IntInt_ReturnValue_5) == 0x00005C, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Subtract_IntInt_ReturnValue) == 0x000060, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000064, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Array_Get_Item) == 0x000068, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_RemoveChild_ReturnValue) == 0x000070, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_RemoveChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Array_Length_ReturnValue_1) == 0x000074, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000078, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00007C, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_RemoveChild_ReturnValue_1) == 0x000088, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_RemoveChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Array_Length_ReturnValue_2) == 0x00008C, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Array_Get_Item_2) == 0x000090, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000098, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Array_RemoveItem_ReturnValue) == 0x00009C, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x00009D, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_LessEqual_IntInt_ReturnValue_3) == 0x00009E, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_LessEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, Temp_int_Variable_6) == 0x0000A0, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::Temp_int_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Array_Get_Item_3) == 0x0000A8, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Array_Get_Item_4) == 0x0000B0, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_RemoveChild_ReturnValue_2) == 0x0000B8, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_RemoveChild_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Array_RemoveItem_ReturnValue_1) == 0x0000B9, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Array_RemoveItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_LessEqual_IntInt_ReturnValue_4) == 0x0000BA, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_LessEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Add_IntInt_ReturnValue_6) == 0x0000BC, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Array_Get_Item_5) == 0x0000C0, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Array_Get_Item_6) == 0x0000C8, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Array_RemoveItem_ReturnValue_2) == 0x0000D0, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Array_RemoveItem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_RemoveChild_ReturnValue_3) == 0x0000D1, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_RemoveChild_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, Temp_int_Variable_7) == 0x0000D4, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::Temp_int_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Array_Length_ReturnValue_3) == 0x0000D8, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Array_Get_Item_7) == 0x0000E0, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x0000E8, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Array_RemoveItem_ReturnValue_3) == 0x0000EC, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Array_RemoveItem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_LessEqual_IntInt_ReturnValue_5) == 0x0000ED, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_LessEqual_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_LessEqual_IntInt_ReturnValue_6) == 0x0000EE, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_LessEqual_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_LessEqual_IntInt_ReturnValue_7) == 0x0000EF, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_LessEqual_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_Chat_C_CheckScrollBoxesChildrenCount, CallFunc_Add_IntInt_ReturnValue_7) == 0x0000F0, "Member 'WBP_Chat_C_CheckScrollBoxesChildrenCount::CallFunc_Add_IntInt_ReturnValue_7' has a wrong offset!");

// Function WBP_Chat.WBP_Chat_C.ExecuteUbergraph_WBP_Chat
// 0x0410 (0x0410 - 0x0000)
struct WBP_Chat_C_ExecuteUbergraph_WBP_Chat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsAdminCred_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsDevCred_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommandEntry_C*                    CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EChatMode                                     Temp_byte_Variable;                                // 0x0010(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChatMode                                     Temp_byte_Variable_1;                              // 0x0011(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChatMode                                     Temp_byte_Variable_2;                              // 0x0012(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChatMode                                     Temp_byte_Variable_3;                              // 0x0013(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EChatMode                                     Temp_byte_Variable_4;                              // 0x0014(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0040(0x0010)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Chat_Entry_C*                      CallFunc_Create_ReturnValue_1;                     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATIPlayerController*                    K2Node_DynamicCast_AsThe_Isle_Player_Controller;   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATIPlayerController*                    K2Node_DynamicCast_AsThe_Isle_Player_Controller_1; // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTIGameHUDWidget*                       CallFunc_GetGameHUD_ReturnValue;                   // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_GameHUD_C*                          K2Node_DynamicCast_AsBP_Game_HUD;                  // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_3;            // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATICharacterBase*                       K2Node_DynamicCast_AsThe_Isle_Character_Base;      // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_4;            // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0100(0x0010)(ConstParm)
	class ABP_AdminPawn_C*                        K2Node_DynamicCast_AsBP_Admin_Pawn;                // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ATICharacterBase*                       K2Node_DynamicCast_AsThe_Isle_Character_Base_1;    // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EAbilityState                                 CallFunc_GetAbilityState_ReturnValue;              // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0158(0x0010)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsAlive_ReturnValue;                   // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x016B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_5;            // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATIPlayerController*                    K2Node_DynamicCast_AsThe_Isle_Player_Controller_2; // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0188(0x0010)(ReferenceParm)
	bool                                          CallFunc_StartsWith_ReturnValue;                   // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AttemptToFireACommand_bFromChatModes;     // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_IterateBadWordsList_ReturnedString;       // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01B0(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x01C0(0x0010)()
	class FText                                   K2Node_Event_Sender;                               // 0x01D0(0x0010)(ConstParm)
	class FText                                   K2Node_Event_Text;                                 // 0x01E0(0x0010)(ConstParm)
	class FString                                 K2Node_Event_SenderSteamId;                        // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EChatMode                                     K2Node_Event_ChatMode;                             // 0x0200(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsDev;                               // 0x0201(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsAdmin;                             // 0x0202(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_203[0x1];                                      // 0x0203(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0210(0x0048)(HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x0258(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0268(0x0010)(ReferenceParm)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue; // 0x0278(0x0020)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0298(0x0010)()
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
