#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AudioSettings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AudioSettings.WBP_AudioSettings_C
// 0x0070 (0x0350 - 0x02E0)
class UWBP_AudioSettings_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG;                                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Effects;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          EffectsText;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Master;                                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          MasterText;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                MUSIC;                                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          MusicText;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                UI;                                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          UIText;                                            // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoundClass*                            MasterSoundClassDefault;                           // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundClass*                            MusicSoundClassDefault;                            // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundClass*                            SFXSoundClassDefault;                              // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundClass*                            VoiceSoundClassDefault;                            // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Apply();
	void ApplyAudioSettings();
	void BndEvt__Effects_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__EffectsText_K2Node_ComponentBoundEvent_3_OnEditableTextCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__Master_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__MasterText_K2Node_ComponentBoundEvent_4_OnEditableTextCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__Music_K2Node_ComponentBoundEvent_7_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__MusicText_K2Node_ComponentBoundEvent_6_OnEditableTextCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__UI_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__UIText_K2Node_ComponentBoundEvent_5_OnEditableTextCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void Construct();
	void ExecuteUbergraph_WBP_AudioSettings(int32 EntryPoint);
	class FText Get_EffectsText_Text_0();
	class FText Get_MasterText_Text_0();
	class FText Get_MusicText_Text_0();
	class FText Get_UIText_Text_0();
	void Load();
	void Reset();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_AudioSettings_C">();
	}
	static class UWBP_AudioSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AudioSettings_C>();
	}
};
static_assert(alignof(UWBP_AudioSettings_C) == 0x000008, "Wrong alignment on UWBP_AudioSettings_C");
static_assert(sizeof(UWBP_AudioSettings_C) == 0x000350, "Wrong size on UWBP_AudioSettings_C");
static_assert(offsetof(UWBP_AudioSettings_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_AudioSettings_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_AudioSettings_C, BG) == 0x0002E8, "Member 'UWBP_AudioSettings_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_AudioSettings_C, Effects) == 0x0002F0, "Member 'UWBP_AudioSettings_C::Effects' has a wrong offset!");
static_assert(offsetof(UWBP_AudioSettings_C, EffectsText) == 0x0002F8, "Member 'UWBP_AudioSettings_C::EffectsText' has a wrong offset!");
static_assert(offsetof(UWBP_AudioSettings_C, Master) == 0x000300, "Member 'UWBP_AudioSettings_C::Master' has a wrong offset!");
static_assert(offsetof(UWBP_AudioSettings_C, MasterText) == 0x000308, "Member 'UWBP_AudioSettings_C::MasterText' has a wrong offset!");
static_assert(offsetof(UWBP_AudioSettings_C, MUSIC) == 0x000310, "Member 'UWBP_AudioSettings_C::MUSIC' has a wrong offset!");
static_assert(offsetof(UWBP_AudioSettings_C, MusicText) == 0x000318, "Member 'UWBP_AudioSettings_C::MusicText' has a wrong offset!");
static_assert(offsetof(UWBP_AudioSettings_C, UI) == 0x000320, "Member 'UWBP_AudioSettings_C::UI' has a wrong offset!");
static_assert(offsetof(UWBP_AudioSettings_C, UIText) == 0x000328, "Member 'UWBP_AudioSettings_C::UIText' has a wrong offset!");
static_assert(offsetof(UWBP_AudioSettings_C, MasterSoundClassDefault) == 0x000330, "Member 'UWBP_AudioSettings_C::MasterSoundClassDefault' has a wrong offset!");
static_assert(offsetof(UWBP_AudioSettings_C, MusicSoundClassDefault) == 0x000338, "Member 'UWBP_AudioSettings_C::MusicSoundClassDefault' has a wrong offset!");
static_assert(offsetof(UWBP_AudioSettings_C, SFXSoundClassDefault) == 0x000340, "Member 'UWBP_AudioSettings_C::SFXSoundClassDefault' has a wrong offset!");
static_assert(offsetof(UWBP_AudioSettings_C, VoiceSoundClassDefault) == 0x000348, "Member 'UWBP_AudioSettings_C::VoiceSoundClassDefault' has a wrong offset!");

}

