#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AdminPanelSlot_Owner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AdminPanelSlot_Owner.WBP_AdminPanelSlot_Owner_C
// 0x0188 (0x0468 - 0x02E0)
class UWBP_AdminPanelSlot_Owner_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Bloodbutton;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       BloodEditableTextBox;                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EditableTextBox_384;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Grow;                                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Grow_1;                                            // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Grow_2;                                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Grow_3;                                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                GrowButton;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Heal;                                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HealButton;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Health;                                            // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HealthButton;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       HealthEditableTextBox;                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                HungeButton;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       HungerEditableTextBox;                             // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Slay;                                              // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                SlayButton;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Stamina;                                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                StaminaButton;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       StaminaEditableTextBox;                            // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_129;                                     // 0x0388(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ThirstButton;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       ThirstEditableTextBox;                             // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_PlayerController_C*                 PlayerController;                                  // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             AvatarTexture;                                     // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   PlayerName;                                        // 0x03B0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   SteamId;                                           // 0x03C0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class APlayerState*                           PlayerState;                                       // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerIndex;                                       // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATICharacterBase*                       PlayerCharacterRef;                                // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 GrowthValue;                                       // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 HungerValue;                                       // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 ThirstValue;                                       // 0x0408(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 BloodValue;                                        // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 HealthValue;                                       // 0x0428(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 StaminaValue;                                      // 0x0438(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bIsReady;                                          // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              SpamCheck;                                         // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bCanFireCommand;                                   // 0x0460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__Bloodbutton_K2Node_ComponentBoundEvent_15_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__BloodEditableTextBox_K2Node_ComponentBoundEvent_16_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__EditableTextBox_384_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__GrowButton_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__HealButton_K2Node_ComponentBoundEvent_10_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__HungeButton_K2Node_ComponentBoundEvent_8_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__HungerEditableTextBox_K2Node_ComponentBoundEvent_11_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__SlayButton_K2Node_ComponentBoundEvent_9_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__ThirstButton_K2Node_ComponentBoundEvent_12_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__ThirstEditableTextBox_K2Node_ComponentBoundEvent_13_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__WBP_AdminPanelSlot_Owner_HealthButton_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_AdminPanelSlot_Owner_HealthEditableTextBox_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__WBP_AdminPanelSlot_Owner_StaminaButton_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_AdminPanelSlot_Owner_StaminaEditableTextBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void Construct();
	void CustomEvent_0();
	void ExecuteUbergraph_WBP_AdminPanelSlot_Owner(int32 EntryPoint);
	class FText Get_Hours_Text_0();
	void SpamCheck_Event_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_AdminPanelSlot_Owner_C">();
	}
	static class UWBP_AdminPanelSlot_Owner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AdminPanelSlot_Owner_C>();
	}
};
static_assert(alignof(UWBP_AdminPanelSlot_Owner_C) == 0x000008, "Wrong alignment on UWBP_AdminPanelSlot_Owner_C");
static_assert(sizeof(UWBP_AdminPanelSlot_Owner_C) == 0x000468, "Wrong size on UWBP_AdminPanelSlot_Owner_C");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_AdminPanelSlot_Owner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, Bloodbutton) == 0x0002E8, "Member 'UWBP_AdminPanelSlot_Owner_C::Bloodbutton' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, BloodEditableTextBox) == 0x0002F0, "Member 'UWBP_AdminPanelSlot_Owner_C::BloodEditableTextBox' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, EditableTextBox_384) == 0x0002F8, "Member 'UWBP_AdminPanelSlot_Owner_C::EditableTextBox_384' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, Grow) == 0x000300, "Member 'UWBP_AdminPanelSlot_Owner_C::Grow' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, Grow_1) == 0x000308, "Member 'UWBP_AdminPanelSlot_Owner_C::Grow_1' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, Grow_2) == 0x000310, "Member 'UWBP_AdminPanelSlot_Owner_C::Grow_2' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, Grow_3) == 0x000318, "Member 'UWBP_AdminPanelSlot_Owner_C::Grow_3' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, GrowButton) == 0x000320, "Member 'UWBP_AdminPanelSlot_Owner_C::GrowButton' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, Heal) == 0x000328, "Member 'UWBP_AdminPanelSlot_Owner_C::Heal' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, HealButton) == 0x000330, "Member 'UWBP_AdminPanelSlot_Owner_C::HealButton' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, Health) == 0x000338, "Member 'UWBP_AdminPanelSlot_Owner_C::Health' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, HealthButton) == 0x000340, "Member 'UWBP_AdminPanelSlot_Owner_C::HealthButton' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, HealthEditableTextBox) == 0x000348, "Member 'UWBP_AdminPanelSlot_Owner_C::HealthEditableTextBox' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, HungeButton) == 0x000350, "Member 'UWBP_AdminPanelSlot_Owner_C::HungeButton' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, HungerEditableTextBox) == 0x000358, "Member 'UWBP_AdminPanelSlot_Owner_C::HungerEditableTextBox' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, Slay) == 0x000360, "Member 'UWBP_AdminPanelSlot_Owner_C::Slay' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, SlayButton) == 0x000368, "Member 'UWBP_AdminPanelSlot_Owner_C::SlayButton' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, Stamina) == 0x000370, "Member 'UWBP_AdminPanelSlot_Owner_C::Stamina' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, StaminaButton) == 0x000378, "Member 'UWBP_AdminPanelSlot_Owner_C::StaminaButton' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, StaminaEditableTextBox) == 0x000380, "Member 'UWBP_AdminPanelSlot_Owner_C::StaminaEditableTextBox' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, TextBlock_129) == 0x000388, "Member 'UWBP_AdminPanelSlot_Owner_C::TextBlock_129' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, ThirstButton) == 0x000390, "Member 'UWBP_AdminPanelSlot_Owner_C::ThirstButton' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, ThirstEditableTextBox) == 0x000398, "Member 'UWBP_AdminPanelSlot_Owner_C::ThirstEditableTextBox' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, PlayerController) == 0x0003A0, "Member 'UWBP_AdminPanelSlot_Owner_C::PlayerController' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, AvatarTexture) == 0x0003A8, "Member 'UWBP_AdminPanelSlot_Owner_C::AvatarTexture' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, PlayerName) == 0x0003B0, "Member 'UWBP_AdminPanelSlot_Owner_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, SteamId) == 0x0003C0, "Member 'UWBP_AdminPanelSlot_Owner_C::SteamId' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, PlayerState) == 0x0003D0, "Member 'UWBP_AdminPanelSlot_Owner_C::PlayerState' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, PlayerIndex) == 0x0003D8, "Member 'UWBP_AdminPanelSlot_Owner_C::PlayerIndex' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, PlayerCharacterRef) == 0x0003E0, "Member 'UWBP_AdminPanelSlot_Owner_C::PlayerCharacterRef' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, GrowthValue) == 0x0003E8, "Member 'UWBP_AdminPanelSlot_Owner_C::GrowthValue' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, HungerValue) == 0x0003F8, "Member 'UWBP_AdminPanelSlot_Owner_C::HungerValue' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, ThirstValue) == 0x000408, "Member 'UWBP_AdminPanelSlot_Owner_C::ThirstValue' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, BloodValue) == 0x000418, "Member 'UWBP_AdminPanelSlot_Owner_C::BloodValue' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, HealthValue) == 0x000428, "Member 'UWBP_AdminPanelSlot_Owner_C::HealthValue' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, StaminaValue) == 0x000438, "Member 'UWBP_AdminPanelSlot_Owner_C::StaminaValue' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, bIsReady) == 0x000448, "Member 'UWBP_AdminPanelSlot_Owner_C::bIsReady' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, SpamCheck) == 0x000450, "Member 'UWBP_AdminPanelSlot_Owner_C::SpamCheck' has a wrong offset!");
static_assert(offsetof(UWBP_AdminPanelSlot_Owner_C, bCanFireCommand) == 0x000460, "Member 'UWBP_AdminPanelSlot_Owner_C::bCanFireCommand' has a wrong offset!");

}

