#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Reconnect

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Reconnect.WBP_Reconnect_C.ExecuteUbergraph_WBP_Reconnect
// 0x0020 (0x0020 - 0x0000)
struct WBP_Reconnect_C_ExecuteUbergraph_WBP_Reconnect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MakeLiteralBool_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTIGameInstance*                        K2Node_DynamicCast_AsThe_Isle_Game_Instance;       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Reconnect_C_ExecuteUbergraph_WBP_Reconnect) == 0x000008, "Wrong alignment on WBP_Reconnect_C_ExecuteUbergraph_WBP_Reconnect");
static_assert(sizeof(WBP_Reconnect_C_ExecuteUbergraph_WBP_Reconnect) == 0x000020, "Wrong size on WBP_Reconnect_C_ExecuteUbergraph_WBP_Reconnect");
static_assert(offsetof(WBP_Reconnect_C_ExecuteUbergraph_WBP_Reconnect, EntryPoint) == 0x000000, "Member 'WBP_Reconnect_C_ExecuteUbergraph_WBP_Reconnect::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Reconnect_C_ExecuteUbergraph_WBP_Reconnect, CallFunc_MakeLiteralBool_ReturnValue) == 0x000004, "Member 'WBP_Reconnect_C_ExecuteUbergraph_WBP_Reconnect::CallFunc_MakeLiteralBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reconnect_C_ExecuteUbergraph_WBP_Reconnect, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'WBP_Reconnect_C_ExecuteUbergraph_WBP_Reconnect::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Reconnect_C_ExecuteUbergraph_WBP_Reconnect, K2Node_DynamicCast_AsThe_Isle_Game_Instance) == 0x000010, "Member 'WBP_Reconnect_C_ExecuteUbergraph_WBP_Reconnect::K2Node_DynamicCast_AsThe_Isle_Game_Instance' has a wrong offset!");
static_assert(offsetof(WBP_Reconnect_C_ExecuteUbergraph_WBP_Reconnect, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_Reconnect_C_ExecuteUbergraph_WBP_Reconnect::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

