#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Chat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TheIsle_structs.hpp"
#include "TheIsle_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Chat.WBP_Chat_C
// 0x0108 (0x0508 - 0x0400)
class UWBP_Chat_C final : public UTIChatWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScrollBox*                             CommandsScrollBox;                                 // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTIGameHUDWidget*                       HUDParent;                                         // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         AdminsList;                                        // 0x0418(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	EChatMode                                     CurrentChatMode;                                   // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DefaultChatMode;                                   // 0x0430(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         RotatorIndex;                                      // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           HideChatHandler;                                   // 0x0448(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         BadWordsList;                                      // 0x0450(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ATIPlayerController*                    Controller;                                        // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           BadWords;                                          // 0x0468(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWBP_Chat_Entry_C*                      ChatEntryRef;                                      // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Chat_Entry_C*                      SecondChatEntryRef;                                // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 ChatLastText;                                      // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 FinalText;                                         // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UWidget*>                        GlobalEntryList;                                   // 0x04A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UWidget*>                        AdminEntryList;                                    // 0x04B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UWidget*>                        SpatialEntryList;                                  // 0x04C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UWidget*>                        LoggingEntryList;                                  // 0x04D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<EChatMode>                             AllChatModes;                                      // 0x04E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWBP_Chat_Entry_C*                      LastGeneratedChatEntry;                            // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Chat_Entry_C*                      CopyLast_Generated_Chat;                           // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void AttemptToFireACommand(class FString& Text, bool* bFromChatModes);
	void Autocomplete();
	void BndEvt__InputTextBox_K2Node_ComponentBoundEvent_0_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__InputTextBox_K2Node_ComponentBoundEvent_1_OnEditableTextBoxChangedEvent__DelegateSignature(const class FText& Text);
	void CheckAndRequestUnstuckCommand();
	void CheckMessageAndCurrentChatModeToToggleVisibility(class UBP_GameHUD_C* MyHUDRef, EChatMode MessageType);
	void CheckScrollBoxesChildrenCount(class UBP_GameHUD_C* BP_GameHUD);
	void Construct();
	void CustomEvent();
	void ExecuteUbergraph_WBP_Chat(int32 EntryPoint);
	void IterateBadWordsList(const class FString& SearchIn, class FString* ReturnedString);
	bool OnClosed(bool bInstant);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	bool OnOpened(bool bInstant);
	void SetChatMode(EChatMode CurrentChatMode_0);
	void SwitchChatModes();
	void UpdateChatWindow(const class FText& Sender, const class FText& Text, const class FString& SenderSteamId, const EChatMode ChatMode, const bool bIsDev, const bool bIsAdmin);
	void UpdateCommandHint();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Chat_C">();
	}
	static class UWBP_Chat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Chat_C>();
	}
};
static_assert(alignof(UWBP_Chat_C) == 0x000008, "Wrong alignment on UWBP_Chat_C");
static_assert(sizeof(UWBP_Chat_C) == 0x000508, "Wrong size on UWBP_Chat_C");
static_assert(offsetof(UWBP_Chat_C, UberGraphFrame) == 0x000400, "Member 'UWBP_Chat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, CommandsScrollBox) == 0x000408, "Member 'UWBP_Chat_C::CommandsScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, HUDParent) == 0x000410, "Member 'UWBP_Chat_C::HUDParent' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, AdminsList) == 0x000418, "Member 'UWBP_Chat_C::AdminsList' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, CurrentChatMode) == 0x000428, "Member 'UWBP_Chat_C::CurrentChatMode' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, DefaultChatMode) == 0x000430, "Member 'UWBP_Chat_C::DefaultChatMode' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, RotatorIndex) == 0x000440, "Member 'UWBP_Chat_C::RotatorIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, HideChatHandler) == 0x000448, "Member 'UWBP_Chat_C::HideChatHandler' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, BadWordsList) == 0x000450, "Member 'UWBP_Chat_C::BadWordsList' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, Controller) == 0x000460, "Member 'UWBP_Chat_C::Controller' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, BadWords) == 0x000468, "Member 'UWBP_Chat_C::BadWords' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, ChatEntryRef) == 0x000478, "Member 'UWBP_Chat_C::ChatEntryRef' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, SecondChatEntryRef) == 0x000480, "Member 'UWBP_Chat_C::SecondChatEntryRef' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, ChatLastText) == 0x000488, "Member 'UWBP_Chat_C::ChatLastText' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, FinalText) == 0x000498, "Member 'UWBP_Chat_C::FinalText' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, GlobalEntryList) == 0x0004A8, "Member 'UWBP_Chat_C::GlobalEntryList' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, AdminEntryList) == 0x0004B8, "Member 'UWBP_Chat_C::AdminEntryList' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, SpatialEntryList) == 0x0004C8, "Member 'UWBP_Chat_C::SpatialEntryList' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, LoggingEntryList) == 0x0004D8, "Member 'UWBP_Chat_C::LoggingEntryList' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, AllChatModes) == 0x0004E8, "Member 'UWBP_Chat_C::AllChatModes' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, LastGeneratedChatEntry) == 0x0004F8, "Member 'UWBP_Chat_C::LastGeneratedChatEntry' has a wrong offset!");
static_assert(offsetof(UWBP_Chat_C, CopyLast_Generated_Chat) == 0x000500, "Member 'UWBP_Chat_C::CopyLast_Generated_Chat' has a wrong offset!");

}

