#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NotificationStack

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_NotificationStack.WBP_NotificationStack_C.ExecuteUbergraph_WBP_NotificationStack
// 0x0060 (0x0060 - 0x0000)
struct WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_NotificationMessage_C*             CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x0020(0x0008)(NoDestructor)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize_1;                // 0x0038(0x0008)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1;      // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_NotificationText;                     // 0x0050(0x0010)(ConstParm)
};
static_assert(alignof(WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack) == 0x000008, "Wrong alignment on WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack");
static_assert(sizeof(WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack) == 0x000060, "Wrong size on WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack");
static_assert(offsetof(WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack, EntryPoint) == 0x000000, "Member 'WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000010, "Member 'WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack, K2Node_MakeStruct_SlateChildSize) == 0x000020, "Member 'WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000028, "Member 'WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack, CallFunc_GetChildAt_ReturnValue_1) == 0x000030, "Member 'WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack, K2Node_MakeStruct_SlateChildSize_1) == 0x000038, "Member 'WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack::K2Node_MakeStruct_SlateChildSize_1' has a wrong offset!");
static_assert(offsetof(WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack, CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1) == 0x000048, "Member 'WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack::CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack, K2Node_Event_NotificationText) == 0x000050, "Member 'WBP_NotificationStack_C_ExecuteUbergraph_WBP_NotificationStack::K2Node_Event_NotificationText' has a wrong offset!");

// Function WBP_NotificationStack.WBP_NotificationStack_C.ShowNotification
// 0x0010 (0x0010 - 0x0000)
struct WBP_NotificationStack_C_ShowNotification final
{
public:
	class FText                                   NotificationText;                                  // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_NotificationStack_C_ShowNotification) == 0x000008, "Wrong alignment on WBP_NotificationStack_C_ShowNotification");
static_assert(sizeof(WBP_NotificationStack_C_ShowNotification) == 0x000010, "Wrong size on WBP_NotificationStack_C_ShowNotification");
static_assert(offsetof(WBP_NotificationStack_C_ShowNotification, NotificationText) == 0x000000, "Member 'WBP_NotificationStack_C_ShowNotification::NotificationText' has a wrong offset!");

}

