#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RemoveBan

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_RemoveBan.WBP_RemoveBan_C.ExecuteUbergraph_WBP_RemoveBan
// 0x0070 (0x0070 - 0x0000)
struct WBP_RemoveBan_C_ExecuteUbergraph_WBP_RemoveBan final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerController_C*                 K2Node_DynamicCast_AsBP_Player_Controller;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0020(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0050(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0060(0x0010)()
};
static_assert(alignof(WBP_RemoveBan_C_ExecuteUbergraph_WBP_RemoveBan) == 0x000008, "Wrong alignment on WBP_RemoveBan_C_ExecuteUbergraph_WBP_RemoveBan");
static_assert(sizeof(WBP_RemoveBan_C_ExecuteUbergraph_WBP_RemoveBan) == 0x000070, "Wrong size on WBP_RemoveBan_C_ExecuteUbergraph_WBP_RemoveBan");
static_assert(offsetof(WBP_RemoveBan_C_ExecuteUbergraph_WBP_RemoveBan, EntryPoint) == 0x000000, "Member 'WBP_RemoveBan_C_ExecuteUbergraph_WBP_RemoveBan::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RemoveBan_C_ExecuteUbergraph_WBP_RemoveBan, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_RemoveBan_C_ExecuteUbergraph_WBP_RemoveBan::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RemoveBan_C_ExecuteUbergraph_WBP_RemoveBan, K2Node_DynamicCast_AsBP_Player_Controller) == 0x000010, "Member 'WBP_RemoveBan_C_ExecuteUbergraph_WBP_RemoveBan::K2Node_DynamicCast_AsBP_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_RemoveBan_C_ExecuteUbergraph_WBP_RemoveBan, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_RemoveBan_C_ExecuteUbergraph_WBP_RemoveBan::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RemoveBan_C_ExecuteUbergraph_WBP_RemoveBan, CallFunc_GetText_ReturnValue) == 0x000020, "Member 'WBP_RemoveBan_C_ExecuteUbergraph_WBP_RemoveBan::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RemoveBan_C_ExecuteUbergraph_WBP_RemoveBan, CallFunc_Conv_TextToString_ReturnValue) == 0x000030, "Member 'WBP_RemoveBan_C_ExecuteUbergraph_WBP_RemoveBan::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RemoveBan_C_ExecuteUbergraph_WBP_RemoveBan, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'WBP_RemoveBan_C_ExecuteUbergraph_WBP_RemoveBan::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RemoveBan_C_ExecuteUbergraph_WBP_RemoveBan, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000050, "Member 'WBP_RemoveBan_C_ExecuteUbergraph_WBP_RemoveBan::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RemoveBan_C_ExecuteUbergraph_WBP_RemoveBan, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000060, "Member 'WBP_RemoveBan_C_ExecuteUbergraph_WBP_RemoveBan::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");

}

