#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HorizontalMouseSensitivity

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_HorizontalMouseSensitivity.WBP_HorizontalMouseSensitivity_C.BndEvt__WBP_MouseSensitivity_Inverted_K2Node_ComponentBoundEvent_8_OnCheckStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_HorizontalMouseSensitivity_C_BndEvt__WBP_MouseSensitivity_Inverted_K2Node_ComponentBoundEvent_8_OnCheckStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HorizontalMouseSensitivity_C_BndEvt__WBP_MouseSensitivity_Inverted_K2Node_ComponentBoundEvent_8_OnCheckStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_HorizontalMouseSensitivity_C_BndEvt__WBP_MouseSensitivity_Inverted_K2Node_ComponentBoundEvent_8_OnCheckStateChanged__DelegateSignature");
static_assert(sizeof(WBP_HorizontalMouseSensitivity_C_BndEvt__WBP_MouseSensitivity_Inverted_K2Node_ComponentBoundEvent_8_OnCheckStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_HorizontalMouseSensitivity_C_BndEvt__WBP_MouseSensitivity_Inverted_K2Node_ComponentBoundEvent_8_OnCheckStateChanged__DelegateSignature");
static_assert(offsetof(WBP_HorizontalMouseSensitivity_C_BndEvt__WBP_MouseSensitivity_Inverted_K2Node_ComponentBoundEvent_8_OnCheckStateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'WBP_HorizontalMouseSensitivity_C_BndEvt__WBP_MouseSensitivity_Inverted_K2Node_ComponentBoundEvent_8_OnCheckStateChanged__DelegateSignature::IsChecked' has a wrong offset!");

// Function WBP_HorizontalMouseSensitivity.WBP_HorizontalMouseSensitivity_C.BndEvt__WBP_MouseSensitivity_Master_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_HorizontalMouseSensitivity_C_BndEvt__WBP_MouseSensitivity_Master_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HorizontalMouseSensitivity_C_BndEvt__WBP_MouseSensitivity_Master_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_HorizontalMouseSensitivity_C_BndEvt__WBP_MouseSensitivity_Master_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_HorizontalMouseSensitivity_C_BndEvt__WBP_MouseSensitivity_Master_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_HorizontalMouseSensitivity_C_BndEvt__WBP_MouseSensitivity_Master_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_HorizontalMouseSensitivity_C_BndEvt__WBP_MouseSensitivity_Master_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'WBP_HorizontalMouseSensitivity_C_BndEvt__WBP_MouseSensitivity_Master_K2Node_ComponentBoundEvent_6_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function WBP_HorizontalMouseSensitivity.WBP_HorizontalMouseSensitivity_C.BndEvt__WBP_MouseSensitivity_MasterText_K2Node_ComponentBoundEvent_7_OnEditableTextCommittedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_HorizontalMouseSensitivity_C_BndEvt__WBP_MouseSensitivity_MasterText_K2Node_ComponentBoundEvent_7_OnEditableTextCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HorizontalMouseSensitivity_C_BndEvt__WBP_MouseSensitivity_MasterText_K2Node_ComponentBoundEvent_7_OnEditableTextCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_HorizontalMouseSensitivity_C_BndEvt__WBP_MouseSensitivity_MasterText_K2Node_ComponentBoundEvent_7_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_HorizontalMouseSensitivity_C_BndEvt__WBP_MouseSensitivity_MasterText_K2Node_ComponentBoundEvent_7_OnEditableTextCommittedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_HorizontalMouseSensitivity_C_BndEvt__WBP_MouseSensitivity_MasterText_K2Node_ComponentBoundEvent_7_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_HorizontalMouseSensitivity_C_BndEvt__WBP_MouseSensitivity_MasterText_K2Node_ComponentBoundEvent_7_OnEditableTextCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_HorizontalMouseSensitivity_C_BndEvt__WBP_MouseSensitivity_MasterText_K2Node_ComponentBoundEvent_7_OnEditableTextCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_HorizontalMouseSensitivity_C_BndEvt__WBP_MouseSensitivity_MasterText_K2Node_ComponentBoundEvent_7_OnEditableTextCommittedEvent__DelegateSignature, CommitMethod) == 0x000010, "Member 'WBP_HorizontalMouseSensitivity_C_BndEvt__WBP_MouseSensitivity_MasterText_K2Node_ComponentBoundEvent_7_OnEditableTextCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_HorizontalMouseSensitivity.WBP_HorizontalMouseSensitivity_C.ExecuteUbergraph_WBP_HorizontalMouseSensitivity
// 0x0198 (0x0198 - 0x0000)
struct WBP_HorizontalMouseSensitivity_C_ExecuteUbergraph_WBP_HorizontalMouseSensitivity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPersistentVariable_ReturnValue;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPersistentVariable_ReturnValue_1;      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0040(0x0010)()
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetPersistentVariable_ReturnValue_2;      // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0070(0x0010)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x0098(0x0010)()
	double                                        CallFunc_Conv_StringToDouble_ReturnValue;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_2;          // 0x00B8(0x0010)()
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsChecked;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPersistentVariable_CustomVariableValue; // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPersistentVariable_ReturnValue;        // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPersistentVariable_CustomVariableValue_1; // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPersistentVariable_ReturnValue_1;      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_1;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_5;        // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_6;        // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_7;        // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetDeprecatedInputYawScale_NewValue_ImplicitCast; // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast;            // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast_1;          // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetDeprecatedInputYawScale_NewValue_ImplicitCast_1; // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetDeprecatedInputYawScale_NewValue_ImplicitCast_2; // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetDeprecatedInputYawScale_NewValue_ImplicitCast_3; // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetDeprecatedInputYawScale_NewValue_ImplicitCast_4; // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetDeprecatedInputYawScale_NewValue_ImplicitCast_5; // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetDeprecatedInputYawScale_NewValue_ImplicitCast_6; // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetDeprecatedInputYawScale_NewValue_ImplicitCast_7; // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HorizontalMouseSensitivity_C_ExecuteUbergraph_WBP_HorizontalMouseSensitivity) == 0x000008, "Wrong alignment on WBP_HorizontalMouseSensitivity_C_ExecuteUbergraph_WBP_HorizontalMouseSensitivity");
static_assert(sizeof(WBP_HorizontalMouseSensitivity_C_ExecuteUbergraph_WBP_HorizontalMouseSensitivity) == 0x000198, "Wrong size on WBP_HorizontalMouseSensitivity_C_ExecuteUbergraph_WBP_HorizontalMouseSensitivity");
static_assert(offsetof(WBP_HorizontalMouseSensitivity_C_ExecuteUbergraph_WBP_HorizontalMouseSensitivity, EntryPoint) == 0x000000, "Member 'WBP_HorizontalMouseSensitivity_C_ExecuteUbergraph_WBP_HorizontalMouseSensitivity::EntryPoint' has a wrong offset!");
