#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SimpleText

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SimpleText.WBP_SimpleText_C
// 0x0058 (0x0338 - 0x02E0)
class UWBP_SimpleText_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_56;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   StatusText;                                        // 0x02F8(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateColor                            NormalColor;                                       // 0x0308(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            BadColor;                                          // 0x031C(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bNormal;                                           // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_SimpleText(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SimpleText_C">();
	}
	static class UWBP_SimpleText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SimpleText_C>();
	}
};
static_assert(alignof(UWBP_SimpleText_C) == 0x000008, "Wrong alignment on UWBP_SimpleText_C");
static_assert(sizeof(UWBP_SimpleText_C) == 0x000338, "Wrong size on UWBP_SimpleText_C");
static_assert(offsetof(UWBP_SimpleText_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_SimpleText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SimpleText_C, TextBlock) == 0x0002E8, "Member 'UWBP_SimpleText_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_SimpleText_C, TextBlock_56) == 0x0002F0, "Member 'UWBP_SimpleText_C::TextBlock_56' has a wrong offset!");
static_assert(offsetof(UWBP_SimpleText_C, StatusText) == 0x0002F8, "Member 'UWBP_SimpleText_C::StatusText' has a wrong offset!");
static_assert(offsetof(UWBP_SimpleText_C, NormalColor) == 0x000308, "Member 'UWBP_SimpleText_C::NormalColor' has a wrong offset!");
static_assert(offsetof(UWBP_SimpleText_C, BadColor) == 0x00031C, "Member 'UWBP_SimpleText_C::BadColor' has a wrong offset!");
static_assert(offsetof(UWBP_SimpleText_C, bNormal) == 0x000330, "Member 'UWBP_SimpleText_C::bNormal' has a wrong offset!");

}

