#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NotificationStack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NotificationStack.WBP_NotificationStack_C
// 0x0018 (0x03A8 - 0x0390)
class UWBP_NotificationStack_C final : public UTINotificationWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           NotificationBox;                                   // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_NotificationStack(int32 EntryPoint);
	void OnNotificationRemoved();
	void ShowNotification(const class FText& NotificationText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NotificationStack_C">();
	}
	static class UWBP_NotificationStack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NotificationStack_C>();
	}
};
static_assert(alignof(UWBP_NotificationStack_C) == 0x000008, "Wrong alignment on UWBP_NotificationStack_C");
static_assert(sizeof(UWBP_NotificationStack_C) == 0x0003A8, "Wrong size on UWBP_NotificationStack_C");
static_assert(offsetof(UWBP_NotificationStack_C, UberGraphFrame) == 0x000390, "Member 'UWBP_NotificationStack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_NotificationStack_C, InvalidationBox_0) == 0x000398, "Member 'UWBP_NotificationStack_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_NotificationStack_C, NotificationBox) == 0x0003A0, "Member 'UWBP_NotificationStack_C::NotificationBox' has a wrong offset!");

}

