#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HintWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HintWidget.WBP_HintWidget_C
// 0x00A0 (0x0438 - 0x0398)
class UWBP_HintWidget_C final : public UTIHintScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Action;                                            // 0x03A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Key;                                               // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x03B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_5;                                       // 0x03B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_6;                                       // 0x03C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Message;                                           // 0x03C8(0x0010)(Edit, BlueprintVisible)
	class FText                                   Input;                                             // 0x03D8(0x0010)(Edit, BlueprintVisible)
	class FText                                   PressOrHold;                                       // 0x03E8(0x0010)(Edit, BlueprintVisible)
	class FText                                   TempMessage1;                                      // 0x03F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   TempMessage2;                                      // 0x0408(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   FirstSymbol;                                       // 0x0418(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SecondSymbol;                                      // 0x0428(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void CustomEvent_0();
	void ExecuteUbergraph_WBP_HintWidget(int32 EntryPoint);
	class FText GetButtonNameFromAction(const class FName InActionName);
	void ShowHint(const class FString& ActorString);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HintWidget_C">();
	}
	static class UWBP_HintWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HintWidget_C>();
	}
};
static_assert(alignof(UWBP_HintWidget_C) == 0x000008, "Wrong alignment on UWBP_HintWidget_C");
static_assert(sizeof(UWBP_HintWidget_C) == 0x000438, "Wrong size on UWBP_HintWidget_C");
static_assert(offsetof(UWBP_HintWidget_C, UberGraphFrame) == 0x000398, "Member 'UWBP_HintWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HintWidget_C, Action) == 0x0003A0, "Member 'UWBP_HintWidget_C::Action' has a wrong offset!");
static_assert(offsetof(UWBP_HintWidget_C, Key) == 0x0003A8, "Member 'UWBP_HintWidget_C::Key' has a wrong offset!");
static_assert(offsetof(UWBP_HintWidget_C, TextBlock) == 0x0003B0, "Member 'UWBP_HintWidget_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_HintWidget_C, TextBlock_5) == 0x0003B8, "Member 'UWBP_HintWidget_C::TextBlock_5' has a wrong offset!");
static_assert(offsetof(UWBP_HintWidget_C, TextBlock_6) == 0x0003C0, "Member 'UWBP_HintWidget_C::TextBlock_6' has a wrong offset!");
static_assert(offsetof(UWBP_HintWidget_C, Message) == 0x0003C8, "Member 'UWBP_HintWidget_C::Message' has a wrong offset!");
static_assert(offsetof(UWBP_HintWidget_C, Input) == 0x0003D8, "Member 'UWBP_HintWidget_C::Input' has a wrong offset!");
static_assert(offsetof(UWBP_HintWidget_C, PressOrHold) == 0x0003E8, "Member 'UWBP_HintWidget_C::PressOrHold' has a wrong offset!");
static_assert(offsetof(UWBP_HintWidget_C, TempMessage1) == 0x0003F8, "Member 'UWBP_HintWidget_C::TempMessage1' has a wrong offset!");
static_assert(offsetof(UWBP_HintWidget_C, TempMessage2) == 0x000408, "Member 'UWBP_HintWidget_C::TempMessage2' has a wrong offset!");
static_assert(offsetof(UWBP_HintWidget_C, FirstSymbol) == 0x000418, "Member 'UWBP_HintWidget_C::FirstSymbol' has a wrong offset!");
static_assert(offsetof(UWBP_HintWidget_C, SecondSymbol) == 0x000428, "Member 'UWBP_HintWidget_C::SecondSymbol' has a wrong offset!");

}

