#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Nest

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Nest.WBP_Nest_C.ExecuteUbergraph_WBP_Nest
// 0x02B0 (0x02B0 - 0x0000)
struct WBP_Nest_C_ExecuteUbergraph_WBP_Nest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEggIndexToLay_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0020(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATIDinosaurBase*                        K2Node_DynamicCast_AsThe_Isle_Dinosaur_Base;       // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B[0x5];                                       // 0x008B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x00AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequiresDebris_ReturnValue;               // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasRottenEggs_ReturnValue;                // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInNestingGround_ReturnValue;            // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequiresAttention_ReturnValue;            // 0x00FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTemperature_ReturnValue;               // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_ByteToDouble_ReturnValue;            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEggCount_ReturnValue;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReadyForEggs_ReturnValue;               // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0156(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_157[0x1];                                      // 0x0157(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default_2;                           // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetProgress_ReturnValue;                  // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default_3;                           // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x0171(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTemperature_ReturnValue_1;             // 0x0172(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0173(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_ByteByte_ReturnValue;             // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_176[0x2];                                      // 0x0176(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetTemperature_ReturnValue_2;             // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetProgress_ReturnValue_1;                // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_ByteByte_ReturnValue;                // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequiresAttention_ReturnValue_1;          // 0x018A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsReadyForEggs_ReturnValue_1;             // 0x018B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition; // 0x01F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue; // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Vector2DVector2D_ReturnValue;  // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x0203(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_5;                           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FInterpTo_Constant_ReturnValue;           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0270(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_1; // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_B_ImplicitCast;               // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest) == 0x000008, "Wrong alignment on WBP_Nest_C_ExecuteUbergraph_WBP_Nest");
static_assert(sizeof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest) == 0x0002B0, "Wrong size on WBP_Nest_C_ExecuteUbergraph_WBP_Nest");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, EntryPoint) == 0x000000, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, Temp_real_Variable) == 0x000008, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_GetEggIndexToLay_ReturnValue) == 0x000010, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_GetEggIndexToLay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000014, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, Temp_real_Variable_1) == 0x000018, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, K2Node_Event_MyGeometry) == 0x000020, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, K2Node_Event_InDeltaTime) == 0x000058, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_GetPlayerController_ReturnValue) == 0x000060, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_GetPlayerController_ReturnValue_1) == 0x000068, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_K2_GetPawn_ReturnValue) == 0x000078, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, K2Node_DynamicCast_AsThe_Isle_Dinosaur_Base) == 0x000080, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::K2Node_DynamicCast_AsThe_Isle_Dinosaur_Base' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_IsValid_ReturnValue_1) == 0x000089, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, Temp_bool_Variable) == 0x00008A, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000090, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, Temp_byte_Variable) == 0x000098, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x0000A0, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, Temp_byte_Variable_1) == 0x0000A8, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, Temp_bool_Variable_1) == 0x0000A9, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, Temp_byte_Variable_2) == 0x0000AA, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, Temp_byte_Variable_3) == 0x0000AB, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x0000B0, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, Temp_bool_Variable_2) == 0x0000B8, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000C0, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_IsAnimationPlaying_ReturnValue) == 0x0000C8, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, Temp_byte_Variable_4) == 0x0000C9, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, Temp_byte_Variable_5) == 0x0000CA, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, Temp_bool_Variable_3) == 0x0000CB, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, Temp_object_Variable) == 0x0000D0, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0000D8, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, Temp_object_Variable_1) == 0x0000E0, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, Temp_bool_Variable_4) == 0x0000E8, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, Temp_object_Variable_2) == 0x0000F0, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, Temp_bool_Variable_5) == 0x0000F8, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_HasTag_ReturnValue) == 0x0000F9, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_IsValid_ReturnValue_2) == 0x0000FA, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_IsValid_ReturnValue_3) == 0x0000FB, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_RequiresDebris_ReturnValue) == 0x0000FC, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_RequiresDebris_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_HasRottenEggs_ReturnValue) == 0x0000FD, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_HasRottenEggs_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_IsInNestingGround_ReturnValue) == 0x0000FE, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_IsInNestingGround_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_RequiresAttention_ReturnValue) == 0x0000FF, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_RequiresAttention_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, K2Node_Select_Default) == 0x000100, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, K2Node_Select_Default_1) == 0x000101, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_Not_PreBool_ReturnValue) == 0x000102, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_GetTemperature_ReturnValue) == 0x000103, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_GetTemperature_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_BooleanAND_ReturnValue) == 0x000104, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_Conv_ByteToDouble_ReturnValue) == 0x000108, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_Conv_ByteToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000110, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_Not_PreBool_ReturnValue_1) == 0x000118, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000120, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_BooleanAND_ReturnValue_1) == 0x000128, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000130, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_BooleanAND_ReturnValue_2) == 0x000138, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_MakeVector2D_ReturnValue) == 0x000140, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_GetEggCount_ReturnValue) == 0x000150, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_GetEggCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_IsReadyForEggs_ReturnValue) == 0x000154, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_IsReadyForEggs_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_Greater_IntInt_ReturnValue) == 0x000155, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_BooleanAND_ReturnValue_3) == 0x000156, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, K2Node_Select_Default_2) == 0x000158, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_GetProgress_ReturnValue) == 0x000160, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_GetProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, K2Node_Select_Default_3) == 0x000168, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000170, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_EqualEqual_DoubleDouble_ReturnValue_1) == 0x000171, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_EqualEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_GetTemperature_ReturnValue_1) == 0x000172, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_GetTemperature_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_BooleanOR_ReturnValue) == 0x000173, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_Greater_ByteByte_ReturnValue) == 0x000174, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_Greater_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_BooleanOR_ReturnValue_1) == 0x000175, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_SelectFloat_ReturnValue) == 0x000178, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_GetTemperature_ReturnValue_2) == 0x000180, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_GetTemperature_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_GetProgress_ReturnValue_1) == 0x000184, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_GetProgress_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_Less_ByteByte_ReturnValue) == 0x000188, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_Less_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000189, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_RequiresAttention_ReturnValue_1) == 0x00018A, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_RequiresAttention_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_IsReadyForEggs_ReturnValue_1) == 0x00018B, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_IsReadyForEggs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000190, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_BooleanOR_ReturnValue_2) == 0x0001A8, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001B0, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_BooleanOR_ReturnValue_3) == 0x0001C8, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_Add_VectorVector_ReturnValue) == 0x0001D0, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_BooleanOR_ReturnValue_4) == 0x0001E8, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition) == 0x0001F0, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue) == 0x000200, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_BooleanOR_ReturnValue_5) == 0x000201, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_EqualEqual_Vector2DVector2D_ReturnValue) == 0x000202, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_EqualEqual_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_BooleanOR_ReturnValue_6) == 0x000203, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_BooleanOR_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, K2Node_Select_Default_4) == 0x000204, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, K2Node_Select_Default_5) == 0x000208, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_FInterpTo_Constant_ReturnValue) == 0x000210, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000218, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000230, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_VSize_ReturnValue) == 0x000248, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000250, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_FClamp_ReturnValue) == 0x000258, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000260, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000268, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_MakeVector2D_ReturnValue_1) == 0x000270, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000280, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast) == 0x000288, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_1) == 0x000290, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_SelectFloat_B_ImplicitCast) == 0x000298, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_SelectFloat_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x0002A0, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_ExecuteUbergraph_WBP_Nest, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x0002A8, "Member 'WBP_Nest_C_ExecuteUbergraph_WBP_Nest::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_Nest.WBP_Nest_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Nest_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Nest_C_Tick) == 0x000004, "Wrong alignment on WBP_Nest_C_Tick");
static_assert(sizeof(WBP_Nest_C_Tick) == 0x00003C, "Wrong size on WBP_Nest_C_Tick");
static_assert(offsetof(WBP_Nest_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Nest_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Nest_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_Nest_C_Tick::InDeltaTime' has a wrong offset!");

}

