#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SettingDescriptions

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SettingDescriptions.WBP_SettingDescriptions_C
// 0x0020 (0x0300 - 0x02E0)
class UWBP_SettingDescriptions_C final : public UUserWidget
{
public:
	class UTextBlock*                             Description;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_45;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RestartWarning;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title;                                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SettingDescriptions_C">();
	}
	static class UWBP_SettingDescriptions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SettingDescriptions_C>();
	}
};
static_assert(alignof(UWBP_SettingDescriptions_C) == 0x000008, "Wrong alignment on UWBP_SettingDescriptions_C");
static_assert(sizeof(UWBP_SettingDescriptions_C) == 0x000300, "Wrong size on UWBP_SettingDescriptions_C");
static_assert(offsetof(UWBP_SettingDescriptions_C, Description) == 0x0002E0, "Member 'UWBP_SettingDescriptions_C::Description' has a wrong offset!");
static_assert(offsetof(UWBP_SettingDescriptions_C, Image_45) == 0x0002E8, "Member 'UWBP_SettingDescriptions_C::Image_45' has a wrong offset!");
static_assert(offsetof(UWBP_SettingDescriptions_C, RestartWarning) == 0x0002F0, "Member 'UWBP_SettingDescriptions_C::RestartWarning' has a wrong offset!");
static_assert(offsetof(UWBP_SettingDescriptions_C, Title) == 0x0002F8, "Member 'UWBP_SettingDescriptions_C::Title' has a wrong offset!");

}

