#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AIDebug_Data

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AIDebug_Data.WBP_AIDebug_Data_C
// 0x0060 (0x03E0 - 0x0380)
class UWBP_AIDebug_Data_C final : public UTIAIDebugWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_57;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TargetName;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_1;                                       // 0x0398(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_3;                                       // 0x03A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_5;                                       // 0x03A8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_7;                                       // 0x03B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_9;                                       // 0x03B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_12;                                      // 0x03C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_13;                                      // 0x03C8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_15;                                      // 0x03D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_18;                                      // 0x03D8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void CycleAITarget();
	void ExecuteUbergraph_WBP_AIDebug_Data(int32 EntryPoint);
	class FText Get_Name_Text();
	class FText GetDistance();
	class FText GetText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_AIDebug_Data_C">();
	}
	static class UWBP_AIDebug_Data_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AIDebug_Data_C>();
	}
};
static_assert(alignof(UWBP_AIDebug_Data_C) == 0x000008, "Wrong alignment on UWBP_AIDebug_Data_C");
static_assert(sizeof(UWBP_AIDebug_Data_C) == 0x0003E0, "Wrong size on UWBP_AIDebug_Data_C");
static_assert(offsetof(UWBP_AIDebug_Data_C, UberGraphFrame) == 0x000380, "Member 'UWBP_AIDebug_Data_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_AIDebug_Data_C, Image_57) == 0x000388, "Member 'UWBP_AIDebug_Data_C::Image_57' has a wrong offset!");
static_assert(offsetof(UWBP_AIDebug_Data_C, TargetName) == 0x000390, "Member 'UWBP_AIDebug_Data_C::TargetName' has a wrong offset!");
static_assert(offsetof(UWBP_AIDebug_Data_C, TextBlock_1) == 0x000398, "Member 'UWBP_AIDebug_Data_C::TextBlock_1' has a wrong offset!");
static_assert(offsetof(UWBP_AIDebug_Data_C, TextBlock_3) == 0x0003A0, "Member 'UWBP_AIDebug_Data_C::TextBlock_3' has a wrong offset!");
static_assert(offsetof(UWBP_AIDebug_Data_C, TextBlock_5) == 0x0003A8, "Member 'UWBP_AIDebug_Data_C::TextBlock_5' has a wrong offset!");
static_assert(offsetof(UWBP_AIDebug_Data_C, TextBlock_7) == 0x0003B0, "Member 'UWBP_AIDebug_Data_C::TextBlock_7' has a wrong offset!");
static_assert(offsetof(UWBP_AIDebug_Data_C, TextBlock_9) == 0x0003B8, "Member 'UWBP_AIDebug_Data_C::TextBlock_9' has a wrong offset!");
static_assert(offsetof(UWBP_AIDebug_Data_C, TextBlock_12) == 0x0003C0, "Member 'UWBP_AIDebug_Data_C::TextBlock_12' has a wrong offset!");
static_assert(offsetof(UWBP_AIDebug_Data_C, TextBlock_13) == 0x0003C8, "Member 'UWBP_AIDebug_Data_C::TextBlock_13' has a wrong offset!");
static_assert(offsetof(UWBP_AIDebug_Data_C, TextBlock_15) == 0x0003D0, "Member 'UWBP_AIDebug_Data_C::TextBlock_15' has a wrong offset!");
static_assert(offsetof(UWBP_AIDebug_Data_C, TextBlock_18) == 0x0003D8, "Member 'UWBP_AIDebug_Data_C::TextBlock_18' has a wrong offset!");

}

