#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GraphicSettingSlider

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GraphicSettingsEnums_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GraphicSettingSlider.WBP_GraphicSettingSlider_C
// 0x0068 (0x0348 - 0x02E0)
class UWBP_GraphicSettingSlider_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                HoverButton;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          RenderScaleText;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                ResolutionSlider;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Title;                                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GraphicsSettings_C*                WBP_Owner;                                         // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EGraphicSettingsEnums                         Type;                                              // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRequiresRestart;                                  // 0x0311(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_312[0x6];                                      // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   TitleText;                                         // 0x0318(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<class FString>                         Options;                                           // 0x0328(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   Description;                                       // 0x0338(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void BndEvt__RenderScaleText_K2Node_ComponentBoundEvent_2_OnEditableTextCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__Slider_290_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__WBP_GraphicSettingSlider_HoverButton_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_GraphicSettingSlider(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GraphicSettingSlider_C">();
	}
	static class UWBP_GraphicSettingSlider_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GraphicSettingSlider_C>();
	}
};
static_assert(alignof(UWBP_GraphicSettingSlider_C) == 0x000008, "Wrong alignment on UWBP_GraphicSettingSlider_C");
static_assert(sizeof(UWBP_GraphicSettingSlider_C) == 0x000348, "Wrong size on UWBP_GraphicSettingSlider_C");
static_assert(offsetof(UWBP_GraphicSettingSlider_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_GraphicSettingSlider_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicSettingSlider_C, HoverButton) == 0x0002E8, "Member 'UWBP_GraphicSettingSlider_C::HoverButton' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicSettingSlider_C, RenderScaleText) == 0x0002F0, "Member 'UWBP_GraphicSettingSlider_C::RenderScaleText' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicSettingSlider_C, ResolutionSlider) == 0x0002F8, "Member 'UWBP_GraphicSettingSlider_C::ResolutionSlider' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicSettingSlider_C, Title) == 0x000300, "Member 'UWBP_GraphicSettingSlider_C::Title' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicSettingSlider_C, WBP_Owner) == 0x000308, "Member 'UWBP_GraphicSettingSlider_C::WBP_Owner' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicSettingSlider_C, Type) == 0x000310, "Member 'UWBP_GraphicSettingSlider_C::Type' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicSettingSlider_C, bRequiresRestart) == 0x000311, "Member 'UWBP_GraphicSettingSlider_C::bRequiresRestart' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicSettingSlider_C, TitleText) == 0x000318, "Member 'UWBP_GraphicSettingSlider_C::TitleText' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicSettingSlider_C, Options) == 0x000328, "Member 'UWBP_GraphicSettingSlider_C::Options' has a wrong offset!");
static_assert(offsetof(UWBP_GraphicSettingSlider_C, Description) == 0x000338, "Member 'UWBP_GraphicSettingSlider_C::Description' has a wrong offset!");

}

