#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GroupMemberRequester

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_GroupMemberRequester.WBP_GroupMemberRequester_C.ExecuteUbergraph_WBP_GroupMemberRequester
// 0x0068 (0x0068 - 0x0000)
struct WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerController_C*                 K2Node_DynamicCast_AsBP_Player_Controller;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerController_C*                 K2Node_DynamicCast_AsBP_Player_Controller_1;       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue_1;                     // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATIHUD*                                 K2Node_DynamicCast_AsThe_Isle_HUD;                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIHUD*                                 K2Node_DynamicCast_AsThe_Isle_HUD_1;               // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester) == 0x000008, "Wrong alignment on WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester");
static_assert(sizeof(WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester) == 0x000068, "Wrong size on WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester");
static_assert(offsetof(WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester, EntryPoint) == 0x000000, "Member 'WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000010, "Member 'WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester, K2Node_DynamicCast_AsBP_Player_Controller) == 0x000018, "Member 'WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester::K2Node_DynamicCast_AsBP_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester, K2Node_DynamicCast_AsBP_Player_Controller_1) == 0x000028, "Member 'WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester::K2Node_DynamicCast_AsBP_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester, CallFunc_GetHUD_ReturnValue) == 0x000038, "Member 'WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester, CallFunc_GetHUD_ReturnValue_1) == 0x000040, "Member 'WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester::CallFunc_GetHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester, K2Node_DynamicCast_AsThe_Isle_HUD) == 0x000048, "Member 'WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester::K2Node_DynamicCast_AsThe_Isle_HUD' has a wrong offset!");
static_assert(offsetof(WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester, K2Node_DynamicCast_AsThe_Isle_HUD_1) == 0x000058, "Member 'WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester::K2Node_DynamicCast_AsThe_Isle_HUD_1' has a wrong offset!");
static_assert(offsetof(WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester, K2Node_DynamicCast_bSuccess_3) == 0x000060, "Member 'WBP_GroupMemberRequester_C_ExecuteUbergraph_WBP_GroupMemberRequester::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

}

