#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerListSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayerListSlot.WBP_PlayerListSlot_C
// 0x0078 (0x0358 - 0x02E0)
class UWBP_PlayerListSlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Avatar_1;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_Name;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_UniqueID;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_1;                                            // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Ping_1;                                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PingBG;                                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SteamId;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   PlayerSteamName;                                   // 0x0328(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UTexture2D*                             AvatarTexture;                                     // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   PlayerSteamID;                                     // 0x0340(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	uint8                                         Ping;                                              // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_PlayerListSlot(int32 EntryPoint);
	class FText GetPlayerPing();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlayerListSlot_C">();
	}
	static class UWBP_PlayerListSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayerListSlot_C>();
	}
};
static_assert(alignof(UWBP_PlayerListSlot_C) == 0x000008, "Wrong alignment on UWBP_PlayerListSlot_C");
static_assert(sizeof(UWBP_PlayerListSlot_C) == 0x000358, "Wrong size on UWBP_PlayerListSlot_C");
static_assert(offsetof(UWBP_PlayerListSlot_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_PlayerListSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerListSlot_C, Avatar_1) == 0x0002E8, "Member 'UWBP_PlayerListSlot_C::Avatar_1' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerListSlot_C, Background_Name) == 0x0002F0, "Member 'UWBP_PlayerListSlot_C::Background_Name' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerListSlot_C, Background_UniqueID) == 0x0002F8, "Member 'UWBP_PlayerListSlot_C::Background_UniqueID' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerListSlot_C, Button) == 0x000300, "Member 'UWBP_PlayerListSlot_C::Button' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerListSlot_C, Name_1) == 0x000308, "Member 'UWBP_PlayerListSlot_C::Name_1' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerListSlot_C, Ping_1) == 0x000310, "Member 'UWBP_PlayerListSlot_C::Ping_1' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerListSlot_C, PingBG) == 0x000318, "Member 'UWBP_PlayerListSlot_C::PingBG' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerListSlot_C, SteamId) == 0x000320, "Member 'UWBP_PlayerListSlot_C::SteamId' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerListSlot_C, PlayerSteamName) == 0x000328, "Member 'UWBP_PlayerListSlot_C::PlayerSteamName' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerListSlot_C, AvatarTexture) == 0x000338, "Member 'UWBP_PlayerListSlot_C::AvatarTexture' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerListSlot_C, PlayerSteamID) == 0x000340, "Member 'UWBP_PlayerListSlot_C::PlayerSteamID' has a wrong offset!");
static_assert(offsetof(UWBP_PlayerListSlot_C, Ping) == 0x000350, "Member 'UWBP_PlayerListSlot_C::Ping' has a wrong offset!");

}

