#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ManualBan

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ManualBan.WBP_ManualBan_C
// 0x00B0 (0x0390 - 0x02E0)
class UWBP_ManualBan_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_TextInputBox_C*                    WBP_BanReason;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TextInputBox_C*                    WBP_Duration;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HardwareButton_C*                  WBP_HardwareButton;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TextInputBox_C*                    WBP_SteamID;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   PlayerName;                                        // 0x0308(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   SteamIdText;                                       // 0x0318(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   BannedDateText;                                    // 0x0328(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   UnbannDateText;                                    // 0x0338(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   TimeRemainingText;                                 // 0x0348(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   BannedByNameText;                                  // 0x0358(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   BannedBySteamIdText;                               // 0x0368(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   BanReasonText;                                     // 0x0378(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UWBP_AdminPanel_C*                      AdminPanelRef;                                     // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Duration_K2Node_ComponentBoundEvent_3_OnTextChanged__DelegateSignature(const class FText& Text);
	void BndEvt__WBP_HardwareButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void BndEvt__WBP_SteamID_K2Node_ComponentBoundEvent_2_OnTextChanged__DelegateSignature(const class FText& Text);
	void Construct();
	void ExecuteUbergraph_WBP_ManualBan(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ManualBan_C">();
	}
	static class UWBP_ManualBan_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ManualBan_C>();
	}
};
static_assert(alignof(UWBP_ManualBan_C) == 0x000008, "Wrong alignment on UWBP_ManualBan_C");
static_assert(sizeof(UWBP_ManualBan_C) == 0x000390, "Wrong size on UWBP_ManualBan_C");
static_assert(offsetof(UWBP_ManualBan_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_ManualBan_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ManualBan_C, WBP_BanReason) == 0x0002E8, "Member 'UWBP_ManualBan_C::WBP_BanReason' has a wrong offset!");
static_assert(offsetof(UWBP_ManualBan_C, WBP_Duration) == 0x0002F0, "Member 'UWBP_ManualBan_C::WBP_Duration' has a wrong offset!");
static_assert(offsetof(UWBP_ManualBan_C, WBP_HardwareButton) == 0x0002F8, "Member 'UWBP_ManualBan_C::WBP_HardwareButton' has a wrong offset!");
static_assert(offsetof(UWBP_ManualBan_C, WBP_SteamID) == 0x000300, "Member 'UWBP_ManualBan_C::WBP_SteamID' has a wrong offset!");
static_assert(offsetof(UWBP_ManualBan_C, PlayerName) == 0x000308, "Member 'UWBP_ManualBan_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UWBP_ManualBan_C, SteamIdText) == 0x000318, "Member 'UWBP_ManualBan_C::SteamIdText' has a wrong offset!");
static_assert(offsetof(UWBP_ManualBan_C, BannedDateText) == 0x000328, "Member 'UWBP_ManualBan_C::BannedDateText' has a wrong offset!");
static_assert(offsetof(UWBP_ManualBan_C, UnbannDateText) == 0x000338, "Member 'UWBP_ManualBan_C::UnbannDateText' has a wrong offset!");
static_assert(offsetof(UWBP_ManualBan_C, TimeRemainingText) == 0x000348, "Member 'UWBP_ManualBan_C::TimeRemainingText' has a wrong offset!");
static_assert(offsetof(UWBP_ManualBan_C, BannedByNameText) == 0x000358, "Member 'UWBP_ManualBan_C::BannedByNameText' has a wrong offset!");
static_assert(offsetof(UWBP_ManualBan_C, BannedBySteamIdText) == 0x000368, "Member 'UWBP_ManualBan_C::BannedBySteamIdText' has a wrong offset!");
static_assert(offsetof(UWBP_ManualBan_C, BanReasonText) == 0x000378, "Member 'UWBP_ManualBan_C::BanReasonText' has a wrong offset!");
static_assert(offsetof(UWBP_ManualBan_C, AdminPanelRef) == 0x000388, "Member 'UWBP_ManualBan_C::AdminPanelRef' has a wrong offset!");

}

