#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AudioSettings

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_AudioSettings.WBP_AudioSettings_C.ApplyAudioSettings
// 0x0070 (0x0070 - 0x0000)
struct WBP_AudioSettings_C_ApplyAudioSettings final
{
public:
	float                                         CallFunc_GetNormalizedValue_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNormalizedValue_ReturnValue_1;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNormalizedValue_ReturnValue_2;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNormalizedValue_ReturnValue_3;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_2;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_3;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetAudioSettings_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast_1;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetAudioSettings_UIAudioVolume_ImplicitCast; // 0x0050(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetAudioSettings_MusicAudioVolume_ImplicitCast; // 0x0054(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast_2;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast_3;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetAudioSettings_MasterAudioVolume_ImplicitCast; // 0x0068(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetAudioSettings_SFXAudioVolume_ImplicitCast; // 0x006C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AudioSettings_C_ApplyAudioSettings) == 0x000008, "Wrong alignment on WBP_AudioSettings_C_ApplyAudioSettings");
static_assert(sizeof(WBP_AudioSettings_C_ApplyAudioSettings) == 0x000070, "Wrong size on WBP_AudioSettings_C_ApplyAudioSettings");
static_assert(offsetof(WBP_AudioSettings_C_ApplyAudioSettings, CallFunc_GetNormalizedValue_ReturnValue) == 0x000000, "Member 'WBP_AudioSettings_C_ApplyAudioSettings::CallFunc_GetNormalizedValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ApplyAudioSettings, CallFunc_GetNormalizedValue_ReturnValue_1) == 0x000004, "Member 'WBP_AudioSettings_C_ApplyAudioSettings::CallFunc_GetNormalizedValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ApplyAudioSettings, CallFunc_FClamp_ReturnValue) == 0x000008, "Member 'WBP_AudioSettings_C_ApplyAudioSettings::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ApplyAudioSettings, CallFunc_FClamp_ReturnValue_1) == 0x000010, "Member 'WBP_AudioSettings_C_ApplyAudioSettings::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ApplyAudioSettings, CallFunc_GetNormalizedValue_ReturnValue_2) == 0x000018, "Member 'WBP_AudioSettings_C_ApplyAudioSettings::CallFunc_GetNormalizedValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ApplyAudioSettings, CallFunc_GetNormalizedValue_ReturnValue_3) == 0x00001C, "Member 'WBP_AudioSettings_C_ApplyAudioSettings::CallFunc_GetNormalizedValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ApplyAudioSettings, CallFunc_FClamp_ReturnValue_2) == 0x000020, "Member 'WBP_AudioSettings_C_ApplyAudioSettings::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ApplyAudioSettings, CallFunc_FClamp_ReturnValue_3) == 0x000028, "Member 'WBP_AudioSettings_C_ApplyAudioSettings::CallFunc_FClamp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ApplyAudioSettings, CallFunc_GetGameUserSettings_ReturnValue) == 0x000030, "Member 'WBP_AudioSettings_C_ApplyAudioSettings::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ApplyAudioSettings, CallFunc_SetAudioSettings_ReturnValue) == 0x000038, "Member 'WBP_AudioSettings_C_ApplyAudioSettings::CallFunc_SetAudioSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ApplyAudioSettings, CallFunc_FClamp_Value_ImplicitCast) == 0x000040, "Member 'WBP_AudioSettings_C_ApplyAudioSettings::CallFunc_FClamp_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ApplyAudioSettings, CallFunc_FClamp_Value_ImplicitCast_1) == 0x000048, "Member 'WBP_AudioSettings_C_ApplyAudioSettings::CallFunc_FClamp_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ApplyAudioSettings, CallFunc_SetAudioSettings_UIAudioVolume_ImplicitCast) == 0x000050, "Member 'WBP_AudioSettings_C_ApplyAudioSettings::CallFunc_SetAudioSettings_UIAudioVolume_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ApplyAudioSettings, CallFunc_SetAudioSettings_MusicAudioVolume_ImplicitCast) == 0x000054, "Member 'WBP_AudioSettings_C_ApplyAudioSettings::CallFunc_SetAudioSettings_MusicAudioVolume_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ApplyAudioSettings, CallFunc_FClamp_Value_ImplicitCast_2) == 0x000058, "Member 'WBP_AudioSettings_C_ApplyAudioSettings::CallFunc_FClamp_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ApplyAudioSettings, CallFunc_FClamp_Value_ImplicitCast_3) == 0x000060, "Member 'WBP_AudioSettings_C_ApplyAudioSettings::CallFunc_FClamp_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ApplyAudioSettings, CallFunc_SetAudioSettings_MasterAudioVolume_ImplicitCast) == 0x000068, "Member 'WBP_AudioSettings_C_ApplyAudioSettings::CallFunc_SetAudioSettings_MasterAudioVolume_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ApplyAudioSettings, CallFunc_SetAudioSettings_SFXAudioVolume_ImplicitCast) == 0x00006C, "Member 'WBP_AudioSettings_C_ApplyAudioSettings::CallFunc_SetAudioSettings_SFXAudioVolume_ImplicitCast' has a wrong offset!");

// Function WBP_AudioSettings.WBP_AudioSettings_C.BndEvt__Effects_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_AudioSettings_C_BndEvt__Effects_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AudioSettings_C_BndEvt__Effects_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_AudioSettings_C_BndEvt__Effects_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_AudioSettings_C_BndEvt__Effects_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_AudioSettings_C_BndEvt__Effects_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_AudioSettings_C_BndEvt__Effects_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'WBP_AudioSettings_C_BndEvt__Effects_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function WBP_AudioSettings.WBP_AudioSettings_C.BndEvt__EffectsText_K2Node_ComponentBoundEvent_3_OnEditableTextCommittedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_AudioSettings_C_BndEvt__EffectsText_K2Node_ComponentBoundEvent_3_OnEditableTextCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AudioSettings_C_BndEvt__EffectsText_K2Node_ComponentBoundEvent_3_OnEditableTextCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AudioSettings_C_BndEvt__EffectsText_K2Node_ComponentBoundEvent_3_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_AudioSettings_C_BndEvt__EffectsText_K2Node_ComponentBoundEvent_3_OnEditableTextCommittedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_AudioSettings_C_BndEvt__EffectsText_K2Node_ComponentBoundEvent_3_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_AudioSettings_C_BndEvt__EffectsText_K2Node_ComponentBoundEvent_3_OnEditableTextCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_AudioSettings_C_BndEvt__EffectsText_K2Node_ComponentBoundEvent_3_OnEditableTextCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_BndEvt__EffectsText_K2Node_ComponentBoundEvent_3_OnEditableTextCommittedEvent__DelegateSignature, CommitMethod) == 0x000010, "Member 'WBP_AudioSettings_C_BndEvt__EffectsText_K2Node_ComponentBoundEvent_3_OnEditableTextCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_AudioSettings.WBP_AudioSettings_C.BndEvt__Master_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_AudioSettings_C_BndEvt__Master_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AudioSettings_C_BndEvt__Master_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_AudioSettings_C_BndEvt__Master_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_AudioSettings_C_BndEvt__Master_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_AudioSettings_C_BndEvt__Master_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_AudioSettings_C_BndEvt__Master_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'WBP_AudioSettings_C_BndEvt__Master_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function WBP_AudioSettings.WBP_AudioSettings_C.BndEvt__MasterText_K2Node_ComponentBoundEvent_4_OnEditableTextCommittedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_AudioSettings_C_BndEvt__MasterText_K2Node_ComponentBoundEvent_4_OnEditableTextCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AudioSettings_C_BndEvt__MasterText_K2Node_ComponentBoundEvent_4_OnEditableTextCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AudioSettings_C_BndEvt__MasterText_K2Node_ComponentBoundEvent_4_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_AudioSettings_C_BndEvt__MasterText_K2Node_ComponentBoundEvent_4_OnEditableTextCommittedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_AudioSettings_C_BndEvt__MasterText_K2Node_ComponentBoundEvent_4_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_AudioSettings_C_BndEvt__MasterText_K2Node_ComponentBoundEvent_4_OnEditableTextCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_AudioSettings_C_BndEvt__MasterText_K2Node_ComponentBoundEvent_4_OnEditableTextCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_BndEvt__MasterText_K2Node_ComponentBoundEvent_4_OnEditableTextCommittedEvent__DelegateSignature, CommitMethod) == 0x000010, "Member 'WBP_AudioSettings_C_BndEvt__MasterText_K2Node_ComponentBoundEvent_4_OnEditableTextCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_AudioSettings.WBP_AudioSettings_C.BndEvt__Music_K2Node_ComponentBoundEvent_7_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_AudioSettings_C_BndEvt__Music_K2Node_ComponentBoundEvent_7_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AudioSettings_C_BndEvt__Music_K2Node_ComponentBoundEvent_7_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_AudioSettings_C_BndEvt__Music_K2Node_ComponentBoundEvent_7_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_AudioSettings_C_BndEvt__Music_K2Node_ComponentBoundEvent_7_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_AudioSettings_C_BndEvt__Music_K2Node_ComponentBoundEvent_7_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_AudioSettings_C_BndEvt__Music_K2Node_ComponentBoundEvent_7_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'WBP_AudioSettings_C_BndEvt__Music_K2Node_ComponentBoundEvent_7_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function WBP_AudioSettings.WBP_AudioSettings_C.BndEvt__MusicText_K2Node_ComponentBoundEvent_6_OnEditableTextCommittedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_AudioSettings_C_BndEvt__MusicText_K2Node_ComponentBoundEvent_6_OnEditableTextCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AudioSettings_C_BndEvt__MusicText_K2Node_ComponentBoundEvent_6_OnEditableTextCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AudioSettings_C_BndEvt__MusicText_K2Node_ComponentBoundEvent_6_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_AudioSettings_C_BndEvt__MusicText_K2Node_ComponentBoundEvent_6_OnEditableTextCommittedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_AudioSettings_C_BndEvt__MusicText_K2Node_ComponentBoundEvent_6_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_AudioSettings_C_BndEvt__MusicText_K2Node_ComponentBoundEvent_6_OnEditableTextCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_AudioSettings_C_BndEvt__MusicText_K2Node_ComponentBoundEvent_6_OnEditableTextCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_BndEvt__MusicText_K2Node_ComponentBoundEvent_6_OnEditableTextCommittedEvent__DelegateSignature, CommitMethod) == 0x000010, "Member 'WBP_AudioSettings_C_BndEvt__MusicText_K2Node_ComponentBoundEvent_6_OnEditableTextCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_AudioSettings.WBP_AudioSettings_C.BndEvt__UI_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_AudioSettings_C_BndEvt__UI_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AudioSettings_C_BndEvt__UI_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_AudioSettings_C_BndEvt__UI_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_AudioSettings_C_BndEvt__UI_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_AudioSettings_C_BndEvt__UI_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_AudioSettings_C_BndEvt__UI_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'WBP_AudioSettings_C_BndEvt__UI_K2Node_ComponentBoundEvent_2_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function WBP_AudioSettings.WBP_AudioSettings_C.BndEvt__UIText_K2Node_ComponentBoundEvent_5_OnEditableTextCommittedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_AudioSettings_C_BndEvt__UIText_K2Node_ComponentBoundEvent_5_OnEditableTextCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AudioSettings_C_BndEvt__UIText_K2Node_ComponentBoundEvent_5_OnEditableTextCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AudioSettings_C_BndEvt__UIText_K2Node_ComponentBoundEvent_5_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_AudioSettings_C_BndEvt__UIText_K2Node_ComponentBoundEvent_5_OnEditableTextCommittedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_AudioSettings_C_BndEvt__UIText_K2Node_ComponentBoundEvent_5_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_AudioSettings_C_BndEvt__UIText_K2Node_ComponentBoundEvent_5_OnEditableTextCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_AudioSettings_C_BndEvt__UIText_K2Node_ComponentBoundEvent_5_OnEditableTextCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_BndEvt__UIText_K2Node_ComponentBoundEvent_5_OnEditableTextCommittedEvent__DelegateSignature, CommitMethod) == 0x000010, "Member 'WBP_AudioSettings_C_BndEvt__UIText_K2Node_ComponentBoundEvent_5_OnEditableTextCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_AudioSettings.WBP_AudioSettings_C.ExecuteUbergraph_WBP_AudioSettings
// 0x0270 (0x0270 - 0x0000)
struct WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetAudioSettings_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_3;                 // 0x0008(0x0010)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod_3;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_2;                 // 0x0020(0x0010)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod_2;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue_1;                  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_StringToDouble_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_1;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0080(0x0010)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x0090(0x0010)()
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x00A0(0x0010)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod_1;         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue_2;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_2;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_2;                     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x00E0(0x0010)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_2;          // 0x00F8(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue_3;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_3;        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_3;                     // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0138(0x0010)()
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNormalizedValue_ReturnValue;           // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0168(0x0010)()
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0180(0x0010)()
	float                                         CallFunc_GetValue_ReturnValue_1;                   // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_3;                     // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0198(0x0010)()
	float                                         CallFunc_GetValue_ReturnValue_2;                   // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_4;                     // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_4;             // 0x01B0(0x0010)()
	float                                         K2Node_ComponentBoundEvent_Value_3;                // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_5;                     // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_5;             // 0x01C8(0x0010)()
	float                                         K2Node_ComponentBoundEvent_Value_2;                // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_6;                     // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_6;             // 0x01E0(0x0010)()
	float                                         K2Node_ComponentBoundEvent_Value_1;                // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_7;                     // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_7;             // 0x01F8(0x0010)()
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_8;                     // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_8;             // 0x0210(0x0010)()
	float                                         CallFunc_SetValue_InValue_ImplicitCast;            // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast_1;          // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast_2;          // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast_3;          // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast_1;                  // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast_2;                  // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast_3;                  // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast_4;                  // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast_5;                  // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FTrunc_A_ImplicitCast_6;                  // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings) == 0x000008, "Wrong alignment on WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings");
static_assert(sizeof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings) == 0x000270, "Wrong size on WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, EntryPoint) == 0x000000, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_SetAudioSettings_ReturnValue) == 0x000004, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_SetAudioSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, K2Node_ComponentBoundEvent_Text_3) == 0x000008, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::K2Node_ComponentBoundEvent_Text_3' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, K2Node_ComponentBoundEvent_CommitMethod_3) == 0x000018, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::K2Node_ComponentBoundEvent_CommitMethod_3' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, K2Node_ComponentBoundEvent_Text_2) == 0x000020, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::K2Node_ComponentBoundEvent_Text_2' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, K2Node_ComponentBoundEvent_CommitMethod_2) == 0x000030, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::K2Node_ComponentBoundEvent_CommitMethod_2' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_Conv_TextToString_ReturnValue) == 0x000038, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000048, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_IsNumeric_ReturnValue) == 0x000058, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_IsNumeric_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_IsNumeric_ReturnValue_1) == 0x000059, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_IsNumeric_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_Conv_StringToDouble_ReturnValue) == 0x000060, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_Conv_StringToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_Conv_StringToDouble_ReturnValue_1) == 0x000068, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_Conv_StringToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_FClamp_ReturnValue) == 0x000070, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_FClamp_ReturnValue_1) == 0x000078, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000080, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_Conv_DoubleToText_ReturnValue_1) == 0x000090, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_Conv_DoubleToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, K2Node_ComponentBoundEvent_Text_1) == 0x0000A0, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, K2Node_ComponentBoundEvent_CommitMethod_1) == 0x0000B0, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::K2Node_ComponentBoundEvent_CommitMethod_1' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_Conv_TextToString_ReturnValue_2) == 0x0000B8, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_IsNumeric_ReturnValue_2) == 0x0000C8, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_IsNumeric_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_Conv_StringToDouble_ReturnValue_2) == 0x0000D0, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_Conv_StringToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_FClamp_ReturnValue_2) == 0x0000D8, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, K2Node_ComponentBoundEvent_Text) == 0x0000E0, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, K2Node_ComponentBoundEvent_CommitMethod) == 0x0000F0, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_Conv_DoubleToText_ReturnValue_2) == 0x0000F8, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_Conv_DoubleToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_Conv_TextToString_ReturnValue_3) == 0x000108, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_IsNumeric_ReturnValue_3) == 0x000118, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_IsNumeric_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_Conv_StringToDouble_ReturnValue_3) == 0x000120, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_Conv_StringToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_FClamp_ReturnValue_3) == 0x000128, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_FClamp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_FTrunc_ReturnValue) == 0x000130, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_Conv_IntToText_ReturnValue) == 0x000138, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000148, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_GetNormalizedValue_ReturnValue) == 0x000150, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_GetNormalizedValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000158, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_FTrunc_ReturnValue_1) == 0x000160, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_GetValue_ReturnValue) == 0x000164, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000168, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_FTrunc_ReturnValue_2) == 0x000178, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000180, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_GetValue_ReturnValue_1) == 0x000190, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_GetValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_FTrunc_ReturnValue_3) == 0x000194, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_FTrunc_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_Conv_IntToText_ReturnValue_3) == 0x000198, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_GetValue_ReturnValue_2) == 0x0001A8, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_GetValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_FTrunc_ReturnValue_4) == 0x0001AC, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_FTrunc_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_Conv_IntToText_ReturnValue_4) == 0x0001B0, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_Conv_IntToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, K2Node_ComponentBoundEvent_Value_3) == 0x0001C0, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::K2Node_ComponentBoundEvent_Value_3' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_FTrunc_ReturnValue_5) == 0x0001C4, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_FTrunc_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_Conv_IntToText_ReturnValue_5) == 0x0001C8, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_Conv_IntToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, K2Node_ComponentBoundEvent_Value_2) == 0x0001D8, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::K2Node_ComponentBoundEvent_Value_2' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_FTrunc_ReturnValue_6) == 0x0001DC, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_FTrunc_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_Conv_IntToText_ReturnValue_6) == 0x0001E0, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_Conv_IntToText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, K2Node_ComponentBoundEvent_Value_1) == 0x0001F0, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_FTrunc_ReturnValue_7) == 0x0001F4, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_FTrunc_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_Conv_IntToText_ReturnValue_7) == 0x0001F8, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_Conv_IntToText_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, K2Node_ComponentBoundEvent_Value) == 0x000208, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_FTrunc_ReturnValue_8) == 0x00020C, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_FTrunc_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_Conv_IntToText_ReturnValue_8) == 0x000210, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_Conv_IntToText_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_SetValue_InValue_ImplicitCast) == 0x000220, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_SetValue_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_SetValue_InValue_ImplicitCast_1) == 0x000224, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_SetValue_InValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_SetValue_InValue_ImplicitCast_2) == 0x000228, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_SetValue_InValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_SetValue_InValue_ImplicitCast_3) == 0x00022C, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_SetValue_InValue_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000230, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_FTrunc_A_ImplicitCast) == 0x000238, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_FTrunc_A_ImplicitCast_1) == 0x000240, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_FTrunc_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_FTrunc_A_ImplicitCast_2) == 0x000248, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_FTrunc_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_FTrunc_A_ImplicitCast_3) == 0x000250, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_FTrunc_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_FTrunc_A_ImplicitCast_4) == 0x000258, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_FTrunc_A_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_FTrunc_A_ImplicitCast_5) == 0x000260, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_FTrunc_A_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings, CallFunc_FTrunc_A_ImplicitCast_6) == 0x000268, "Member 'WBP_AudioSettings_C_ExecuteUbergraph_WBP_AudioSettings::CallFunc_FTrunc_A_ImplicitCast_6' has a wrong offset!");

// Function WBP_AudioSettings.WBP_AudioSettings_C.Get_EffectsText_Text_0
// 0x0040 (0x0040 - 0x0000)
struct WBP_AudioSettings_C_Get_EffectsText_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	float                                         CallFunc_GetNormalizedValue_ReturnValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0010)()
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AudioSettings_C_Get_EffectsText_Text_0) == 0x000008, "Wrong alignment on WBP_AudioSettings_C_Get_EffectsText_Text_0");
static_assert(sizeof(WBP_AudioSettings_C_Get_EffectsText_Text_0) == 0x000040, "Wrong size on WBP_AudioSettings_C_Get_EffectsText_Text_0");
static_assert(offsetof(WBP_AudioSettings_C_Get_EffectsText_Text_0, ReturnValue) == 0x000000, "Member 'WBP_AudioSettings_C_Get_EffectsText_Text_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_Get_EffectsText_Text_0, CallFunc_GetNormalizedValue_ReturnValue) == 0x000010, "Member 'WBP_AudioSettings_C_Get_EffectsText_Text_0::CallFunc_GetNormalizedValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_Get_EffectsText_Text_0, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_AudioSettings_C_Get_EffectsText_Text_0::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_Get_EffectsText_Text_0, CallFunc_FTrunc_ReturnValue) == 0x000020, "Member 'WBP_AudioSettings_C_Get_EffectsText_Text_0::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_Get_EffectsText_Text_0, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'WBP_AudioSettings_C_Get_EffectsText_Text_0::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_Get_EffectsText_Text_0, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000038, "Member 'WBP_AudioSettings_C_Get_EffectsText_Text_0::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_AudioSettings.WBP_AudioSettings_C.Get_MasterText_Text_0
// 0x0040 (0x0040 - 0x0000)
struct WBP_AudioSettings_C_Get_MasterText_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	float                                         CallFunc_GetNormalizedValue_ReturnValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0010)()
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AudioSettings_C_Get_MasterText_Text_0) == 0x000008, "Wrong alignment on WBP_AudioSettings_C_Get_MasterText_Text_0");
static_assert(sizeof(WBP_AudioSettings_C_Get_MasterText_Text_0) == 0x000040, "Wrong size on WBP_AudioSettings_C_Get_MasterText_Text_0");
static_assert(offsetof(WBP_AudioSettings_C_Get_MasterText_Text_0, ReturnValue) == 0x000000, "Member 'WBP_AudioSettings_C_Get_MasterText_Text_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_Get_MasterText_Text_0, CallFunc_GetNormalizedValue_ReturnValue) == 0x000010, "Member 'WBP_AudioSettings_C_Get_MasterText_Text_0::CallFunc_GetNormalizedValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_Get_MasterText_Text_0, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_AudioSettings_C_Get_MasterText_Text_0::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_Get_MasterText_Text_0, CallFunc_FTrunc_ReturnValue) == 0x000020, "Member 'WBP_AudioSettings_C_Get_MasterText_Text_0::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_Get_MasterText_Text_0, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'WBP_AudioSettings_C_Get_MasterText_Text_0::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AudioSettings_C_Get_MasterText_Text_0, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000038, "Member 'WBP_AudioSettings_C_Get_MasterText_Text_0::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_AudioSettings.WBP_AudioSettings_C.Get_MusicText_Text_0
// 0x0040 (0x0040 - 0x0000)
struct WBP_AudioSettings_C_Get_MusicText_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	float                                         CallFunc_GetNormalizedValue_ReturnValue;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
