#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Egg

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "TheIsle_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Egg.WBP_Egg_C.ExecuteUbergraph_WBP_Egg
// 0x0120 (0x0120 - 0x0000)
struct WBP_Egg_C_ExecuteUbergraph_WBP_Egg final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTINestJoinRequest>             CallFunc_GetEggJoinRequests_ReturnValue;           // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FTIEgg>                         CallFunc_GetEggs_ReturnValue;                      // 0x0018(0x0010)(ConstParm, ReferenceParm)
	TArray<class UStaticMeshComponent*>           CallFunc_GetEggComponents_ReturnValue;             // 0x0028(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<bool>                                  CallFunc_GetEggsViable_ReturnValue;                // 0x0038(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsFemale_ReturnValue;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x004C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTINestJoinRequest                     CallFunc_Array_Get_Item_2;                         // 0x0098(0x0030)()
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_2;         // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_3;         // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_4;         // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_X_ImplicitCast;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MakeVector2D_Y_ImplicitCast;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg) == 0x000008, "Wrong alignment on WBP_Egg_C_ExecuteUbergraph_WBP_Egg");
static_assert(sizeof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg) == 0x000120, "Wrong size on WBP_Egg_C_ExecuteUbergraph_WBP_Egg");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, EntryPoint) == 0x000000, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_IsValid_ReturnValue_2) == 0x000006, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_GetEggJoinRequests_ReturnValue) == 0x000008, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_GetEggJoinRequests_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_GetEggs_ReturnValue) == 0x000018, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_GetEggs_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_GetEggComponents_ReturnValue) == 0x000028, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_GetEggComponents_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_GetEggsViable_ReturnValue) == 0x000038, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_GetEggsViable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_IsFemale_ReturnValue) == 0x000048, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_IsFemale_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_Array_Get_Item) == 0x000049, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00004A, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, K2Node_Event_MyGeometry) == 0x00004C, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, K2Node_Event_InDeltaTime) == 0x000084, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_Array_Get_Item_1) == 0x000088, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000090, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_IsValid_ReturnValue_3) == 0x000091, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_Array_Get_Item_2) == 0x000098, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_Array_IsValidIndex_ReturnValue_2) == 0x0000C8, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_Array_IsValidIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_Not_PreBool_ReturnValue) == 0x0000C9, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_NotEqual_StrStr_ReturnValue) == 0x0000CA, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_NotEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, Temp_byte_Variable) == 0x0000CB, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_BooleanAND_ReturnValue) == 0x0000CC, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_BooleanAND_ReturnValue_1) == 0x0000CD, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, Temp_byte_Variable_1) == 0x0000CE, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, Temp_bool_Variable) == 0x0000CF, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, K2Node_Select_Default) == 0x0000D0, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000D8, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_MakeVector2D_ReturnValue) == 0x0000E0, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_Array_IsValidIndex_ReturnValue_3) == 0x0000F0, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_Array_IsValidIndex_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_Array_IsValidIndex_ReturnValue_4) == 0x0000F1, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_Array_IsValidIndex_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_MakeVector2D_ReturnValue_1) == 0x0000F8, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000108, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_MakeVector2D_X_ImplicitCast) == 0x000110, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_MakeVector2D_X_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_ExecuteUbergraph_WBP_Egg, CallFunc_MakeVector2D_Y_ImplicitCast) == 0x000118, "Member 'WBP_Egg_C_ExecuteUbergraph_WBP_Egg::CallFunc_MakeVector2D_Y_ImplicitCast' has a wrong offset!");

// Function WBP_Egg.WBP_Egg_C.GetText_0
// 0x0060 (0x0060 - 0x0000)
struct WBP_Egg_C_GetText_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   Temp_text_Variable;                                // 0x0010(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  CallFunc_GetEggsPrivate_ReturnValue;               // 0x0038(0x0010)(ConstParm, ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0050(0x0010)()
};
static_assert(alignof(WBP_Egg_C_GetText_0) == 0x000008, "Wrong alignment on WBP_Egg_C_GetText_0");
static_assert(sizeof(WBP_Egg_C_GetText_0) == 0x000060, "Wrong size on WBP_Egg_C_GetText_0");
static_assert(offsetof(WBP_Egg_C_GetText_0, ReturnValue) == 0x000000, "Member 'WBP_Egg_C_GetText_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_GetText_0, Temp_text_Variable) == 0x000010, "Member 'WBP_Egg_C_GetText_0::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_GetText_0, Temp_text_Variable_1) == 0x000020, "Member 'WBP_Egg_C_GetText_0::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_GetText_0, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_Egg_C_GetText_0::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_GetText_0, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'WBP_Egg_C_GetText_0::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_GetText_0, CallFunc_GetEggsPrivate_ReturnValue) == 0x000038, "Member 'WBP_Egg_C_GetText_0::CallFunc_GetEggsPrivate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_GetText_0, Temp_bool_Variable) == 0x000048, "Member 'WBP_Egg_C_GetText_0::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_GetText_0, CallFunc_Array_Get_Item) == 0x000049, "Member 'WBP_Egg_C_GetText_0::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_GetText_0, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00004A, "Member 'WBP_Egg_C_GetText_0::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_GetText_0, K2Node_Select_Default) == 0x000050, "Member 'WBP_Egg_C_GetText_0::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Egg.WBP_Egg_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Egg_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Egg_C_Tick) == 0x000004, "Wrong alignment on WBP_Egg_C_Tick");
static_assert(sizeof(WBP_Egg_C_Tick) == 0x00003C, "Wrong size on WBP_Egg_C_Tick");
static_assert(offsetof(WBP_Egg_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Egg_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Egg_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_Egg_C_Tick::InDeltaTime' has a wrong offset!");

}

