#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ToolTip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ToolTip.WBP_ToolTip_C
// 0x0028 (0x0308 - 0x02E0)
class UWBP_ToolTip_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AnimShow;                                          // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             MainText;                                          // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Tooltip;                                           // 0x02F8(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_WBP_ToolTip(int32 EntryPoint);
	class FText GetToolTipText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ToolTip_C">();
	}
	static class UWBP_ToolTip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ToolTip_C>();
	}
};
static_assert(alignof(UWBP_ToolTip_C) == 0x000008, "Wrong alignment on UWBP_ToolTip_C");
static_assert(sizeof(UWBP_ToolTip_C) == 0x000308, "Wrong size on UWBP_ToolTip_C");
static_assert(offsetof(UWBP_ToolTip_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_ToolTip_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ToolTip_C, AnimShow) == 0x0002E8, "Member 'UWBP_ToolTip_C::AnimShow' has a wrong offset!");
static_assert(offsetof(UWBP_ToolTip_C, MainText) == 0x0002F0, "Member 'UWBP_ToolTip_C::MainText' has a wrong offset!");
static_assert(offsetof(UWBP_ToolTip_C, Tooltip) == 0x0002F8, "Member 'UWBP_ToolTip_C::Tooltip' has a wrong offset!");

}

