#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ClassSlot

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ClassSlot.WBP_ClassSlot_C.BndEvt__WBP_ClassSlot_CheckBox_ChatHUD_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_ClassSlot_C_BndEvt__WBP_ClassSlot_CheckBox_ChatHUD_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClassSlot_C_BndEvt__WBP_ClassSlot_CheckBox_ChatHUD_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_ClassSlot_C_BndEvt__WBP_ClassSlot_CheckBox_ChatHUD_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_ClassSlot_C_BndEvt__WBP_ClassSlot_CheckBox_ChatHUD_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_ClassSlot_C_BndEvt__WBP_ClassSlot_CheckBox_ChatHUD_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_ClassSlot_C_BndEvt__WBP_ClassSlot_CheckBox_ChatHUD_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_ClassSlot_C_BndEvt__WBP_ClassSlot_CheckBox_ChatHUD_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_ClassSlot.WBP_ClassSlot_C.ExecuteUbergraph_WBP_ClassSlot
// 0x0010 (0x0010 - 0x0000)
struct WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsChecked;             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot) == 0x000004, "Wrong alignment on WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot");
static_assert(sizeof(WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot) == 0x000010, "Wrong size on WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot");
static_assert(offsetof(WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot, EntryPoint) == 0x000000, "Member 'WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot, Temp_byte_Variable) == 0x000004, "Member 'WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot, Temp_bool_Variable) == 0x000006, "Member 'WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot, Temp_byte_Variable_2) == 0x000007, "Member 'WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot, Temp_byte_Variable_3) == 0x000008, "Member 'WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot, Temp_bool_Variable_1) == 0x000009, "Member 'WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot, CallFunc_IsValid_ReturnValue) == 0x00000A, "Member 'WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot, K2Node_ComponentBoundEvent_bIsChecked) == 0x00000B, "Member 'WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot::K2Node_ComponentBoundEvent_bIsChecked' has a wrong offset!");
static_assert(offsetof(WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot, K2Node_Select_Default) == 0x00000C, "Member 'WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot, K2Node_Select_Default_1) == 0x00000D, "Member 'WBP_ClassSlot_C_ExecuteUbergraph_WBP_ClassSlot::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_ClassSlot.WBP_ClassSlot_C.Get_Hours_Text_0
// 0x0020 (0x0020 - 0x0000)
struct WBP_ClassSlot_C_Get_Hours_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0010(0x0010)()
};
static_assert(alignof(WBP_ClassSlot_C_Get_Hours_Text_0) == 0x000008, "Wrong alignment on WBP_ClassSlot_C_Get_Hours_Text_0");
static_assert(sizeof(WBP_ClassSlot_C_Get_Hours_Text_0) == 0x000020, "Wrong size on WBP_ClassSlot_C_Get_Hours_Text_0");
static_assert(offsetof(WBP_ClassSlot_C_Get_Hours_Text_0, ReturnValue) == 0x000000, "Member 'WBP_ClassSlot_C_Get_Hours_Text_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ClassSlot_C_Get_Hours_Text_0, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000010, "Member 'WBP_ClassSlot_C_Get_Hours_Text_0::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");

}

