#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SpecPlayersNames

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SpecPlayersNames.WBP_SpecPlayersNames_C
// 0x0168 (0x0448 - 0x02E0)
class UWBP_SpecPlayersNames_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Background;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ClassName;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Distancebox;                                       // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ExtraInfoBorder;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                HackerBackground;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             IdAndClassBAr;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NameTag;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_2;                                       // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_8;                                       // 0x0330(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_9;                                       // 0x0338(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_11;                                      // 0x0340(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_24;                                      // 0x0348(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   PlayerName;                                        // 0x0350(0x0010)(Edit, BlueprintVisible)
	class FText                                   ActorName;                                         // 0x0360(0x0010)(Edit, BlueprintVisible)
	class FText                                   SteamId;                                           // 0x0370(0x0010)(Edit, BlueprintVisible)
	class FText                                   DinoClass;                                         // 0x0380(0x0010)(Edit, BlueprintVisible)
	class FText                                   Gender;                                            // 0x0390(0x0010)(Edit, BlueprintVisible)
	class FText                                   Growth;                                            // 0x03A0(0x0010)(Edit, BlueprintVisible)
	class FText                                   Distance;                                          // 0x03B0(0x0010)(Edit, BlueprintVisible)
	bool                                          bExtraInfoOpened;                                  // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Group;                                             // 0x03C8(0x0010)(Edit, BlueprintVisible)
	class FText                                   Health;                                            // 0x03D8(0x0010)(Edit, BlueprintVisible)
	class FText                                   Stamina;                                           // 0x03E8(0x0010)(Edit, BlueprintVisible)
	class FText                                   Hunger;                                            // 0x03F8(0x0010)(Edit, BlueprintVisible)
	class FText                                   Thirst;                                            // 0x0408(0x0010)(Edit, BlueprintVisible)
	bool                                          bIsAdmin;                                          // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDev;                                            // 0x0419(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAI;                                              // 0x041A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41B[0x5];                                      // 0x041B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Speed;                                             // 0x0420(0x0010)(Edit, BlueprintVisible)
	bool                                          bIsDead;                                           // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlant;                                           // 0x0431(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_432[0x2];                                      // 0x0432(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           PlantColor;                                        // 0x0434(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPossibleHacker;                                   // 0x0444(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsAIDebugFocus;                                   // 0x0445(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_SpecPlayersNames(int32 EntryPoint);
	void ExternalConstruct();
	ESlateVisibility Get_Distancebox_Visibility_0();
	class FText Get_NameTag_Text_0();
	class FText Get_SteamID_Text();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SpecPlayersNames_C">();
	}
	static class UWBP_SpecPlayersNames_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SpecPlayersNames_C>();
	}
};
static_assert(alignof(UWBP_SpecPlayersNames_C) == 0x000008, "Wrong alignment on UWBP_SpecPlayersNames_C");
static_assert(sizeof(UWBP_SpecPlayersNames_C) == 0x000448, "Wrong size on UWBP_SpecPlayersNames_C");
static_assert(offsetof(UWBP_SpecPlayersNames_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_SpecPlayersNames_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, Background) == 0x0002E8, "Member 'UWBP_SpecPlayersNames_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, ClassName) == 0x0002F0, "Member 'UWBP_SpecPlayersNames_C::ClassName' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, Distancebox) == 0x0002F8, "Member 'UWBP_SpecPlayersNames_C::Distancebox' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, ExtraInfoBorder) == 0x000300, "Member 'UWBP_SpecPlayersNames_C::ExtraInfoBorder' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, HackerBackground) == 0x000308, "Member 'UWBP_SpecPlayersNames_C::HackerBackground' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, IdAndClassBAr) == 0x000310, "Member 'UWBP_SpecPlayersNames_C::IdAndClassBAr' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, NameTag) == 0x000318, "Member 'UWBP_SpecPlayersNames_C::NameTag' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, TextBlock) == 0x000320, "Member 'UWBP_SpecPlayersNames_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, TextBlock_2) == 0x000328, "Member 'UWBP_SpecPlayersNames_C::TextBlock_2' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, TextBlock_8) == 0x000330, "Member 'UWBP_SpecPlayersNames_C::TextBlock_8' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, TextBlock_9) == 0x000338, "Member 'UWBP_SpecPlayersNames_C::TextBlock_9' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, TextBlock_11) == 0x000340, "Member 'UWBP_SpecPlayersNames_C::TextBlock_11' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, TextBlock_24) == 0x000348, "Member 'UWBP_SpecPlayersNames_C::TextBlock_24' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, PlayerName) == 0x000350, "Member 'UWBP_SpecPlayersNames_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, ActorName) == 0x000360, "Member 'UWBP_SpecPlayersNames_C::ActorName' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, SteamId) == 0x000370, "Member 'UWBP_SpecPlayersNames_C::SteamId' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, DinoClass) == 0x000380, "Member 'UWBP_SpecPlayersNames_C::DinoClass' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, Gender) == 0x000390, "Member 'UWBP_SpecPlayersNames_C::Gender' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, Growth) == 0x0003A0, "Member 'UWBP_SpecPlayersNames_C::Growth' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, Distance) == 0x0003B0, "Member 'UWBP_SpecPlayersNames_C::Distance' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, bExtraInfoOpened) == 0x0003C0, "Member 'UWBP_SpecPlayersNames_C::bExtraInfoOpened' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, Group) == 0x0003C8, "Member 'UWBP_SpecPlayersNames_C::Group' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, Health) == 0x0003D8, "Member 'UWBP_SpecPlayersNames_C::Health' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, Stamina) == 0x0003E8, "Member 'UWBP_SpecPlayersNames_C::Stamina' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, Hunger) == 0x0003F8, "Member 'UWBP_SpecPlayersNames_C::Hunger' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, Thirst) == 0x000408, "Member 'UWBP_SpecPlayersNames_C::Thirst' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, bIsAdmin) == 0x000418, "Member 'UWBP_SpecPlayersNames_C::bIsAdmin' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, bIsDev) == 0x000419, "Member 'UWBP_SpecPlayersNames_C::bIsDev' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, IsAI) == 0x00041A, "Member 'UWBP_SpecPlayersNames_C::IsAI' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, Speed) == 0x000420, "Member 'UWBP_SpecPlayersNames_C::Speed' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, bIsDead) == 0x000430, "Member 'UWBP_SpecPlayersNames_C::bIsDead' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, IsPlant) == 0x000431, "Member 'UWBP_SpecPlayersNames_C::IsPlant' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, PlantColor) == 0x000434, "Member 'UWBP_SpecPlayersNames_C::PlantColor' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, bPossibleHacker) == 0x000444, "Member 'UWBP_SpecPlayersNames_C::bPossibleHacker' has a wrong offset!");
static_assert(offsetof(UWBP_SpecPlayersNames_C, bIsAIDebugFocus) == 0x000445, "Member 'UWBP_SpecPlayersNames_C::bIsAIDebugFocus' has a wrong offset!");

}

