#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HardwareButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HardwareButton.WBP_HardwareButton_C
// 0x0088 (0x0418 - 0x0390)
class UWBP_HardwareButton_C final : public UTIUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                MainButton;                                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MainText;                                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x03A8(0x0010)(Edit, BlueprintVisible)
	class FText                                   Tooltip;                                           // 0x03B8(0x0010)(Edit, BlueprintVisible)
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnHovered;                                         // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bEnabled;                                          // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnUnhovered;                                       // 0x03F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FButtonStyle>                   StyleType;                                         // 0x0400(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         ButtonStyle;                                       // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__MainButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__MainButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__MainButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_HardwareButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetEnabled(bool bNewEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HardwareButton_C">();
	}
	static class UWBP_HardwareButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HardwareButton_C>();
	}
};
static_assert(alignof(UWBP_HardwareButton_C) == 0x000008, "Wrong alignment on UWBP_HardwareButton_C");
static_assert(sizeof(UWBP_HardwareButton_C) == 0x000418, "Wrong size on UWBP_HardwareButton_C");
static_assert(offsetof(UWBP_HardwareButton_C, UberGraphFrame) == 0x000390, "Member 'UWBP_HardwareButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HardwareButton_C, MainButton) == 0x000398, "Member 'UWBP_HardwareButton_C::MainButton' has a wrong offset!");
static_assert(offsetof(UWBP_HardwareButton_C, MainText) == 0x0003A0, "Member 'UWBP_HardwareButton_C::MainText' has a wrong offset!");
static_assert(offsetof(UWBP_HardwareButton_C, Text) == 0x0003A8, "Member 'UWBP_HardwareButton_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_HardwareButton_C, Tooltip) == 0x0003B8, "Member 'UWBP_HardwareButton_C::Tooltip' has a wrong offset!");
static_assert(offsetof(UWBP_HardwareButton_C, OnClicked) == 0x0003C8, "Member 'UWBP_HardwareButton_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UWBP_HardwareButton_C, OnHovered) == 0x0003D8, "Member 'UWBP_HardwareButton_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UWBP_HardwareButton_C, bEnabled) == 0x0003E8, "Member 'UWBP_HardwareButton_C::bEnabled' has a wrong offset!");
static_assert(offsetof(UWBP_HardwareButton_C, OnUnhovered) == 0x0003F0, "Member 'UWBP_HardwareButton_C::OnUnhovered' has a wrong offset!");
static_assert(offsetof(UWBP_HardwareButton_C, StyleType) == 0x000400, "Member 'UWBP_HardwareButton_C::StyleType' has a wrong offset!");
static_assert(offsetof(UWBP_HardwareButton_C, ButtonStyle) == 0x000410, "Member 'UWBP_HardwareButton_C::ButtonStyle' has a wrong offset!");

}

