#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PairedStatusWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PairedStatusWidget.WBP_PairedStatusWidget_C
// 0x0030 (0x0310 - 0x02E0)
class UWBP_PairedStatusWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                UnpairButton;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             UnpairText;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SimpleText_C*                      WBP_SimpleText;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Status_Text;                                       // 0x0300(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_WBP_PairedStatusWidget(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PairedStatusWidget_C">();
	}
	static class UWBP_PairedStatusWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PairedStatusWidget_C>();
	}
};
static_assert(alignof(UWBP_PairedStatusWidget_C) == 0x000008, "Wrong alignment on UWBP_PairedStatusWidget_C");
static_assert(sizeof(UWBP_PairedStatusWidget_C) == 0x000310, "Wrong size on UWBP_PairedStatusWidget_C");
static_assert(offsetof(UWBP_PairedStatusWidget_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_PairedStatusWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PairedStatusWidget_C, UnpairButton) == 0x0002E8, "Member 'UWBP_PairedStatusWidget_C::UnpairButton' has a wrong offset!");
static_assert(offsetof(UWBP_PairedStatusWidget_C, UnpairText) == 0x0002F0, "Member 'UWBP_PairedStatusWidget_C::UnpairText' has a wrong offset!");
static_assert(offsetof(UWBP_PairedStatusWidget_C, WBP_SimpleText) == 0x0002F8, "Member 'UWBP_PairedStatusWidget_C::WBP_SimpleText' has a wrong offset!");
static_assert(offsetof(UWBP_PairedStatusWidget_C, Status_Text) == 0x000300, "Member 'UWBP_PairedStatusWidget_C::Status_Text' has a wrong offset!");

}

