#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NestSelect

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_NestSelect.WBP_NestSelect_C.BndEvt__WBP_NestSelect_FriendSpawnCode_K2Node_ComponentBoundEvent_5_OnEditableTextChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_NestSelect_C_BndEvt__WBP_NestSelect_FriendSpawnCode_K2Node_ComponentBoundEvent_5_OnEditableTextChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_NestSelect_C_BndEvt__WBP_NestSelect_FriendSpawnCode_K2Node_ComponentBoundEvent_5_OnEditableTextChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_NestSelect_C_BndEvt__WBP_NestSelect_FriendSpawnCode_K2Node_ComponentBoundEvent_5_OnEditableTextChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_NestSelect_C_BndEvt__WBP_NestSelect_FriendSpawnCode_K2Node_ComponentBoundEvent_5_OnEditableTextChangedEvent__DelegateSignature) == 0x000010, "Wrong size on WBP_NestSelect_C_BndEvt__WBP_NestSelect_FriendSpawnCode_K2Node_ComponentBoundEvent_5_OnEditableTextChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_NestSelect_C_BndEvt__WBP_NestSelect_FriendSpawnCode_K2Node_ComponentBoundEvent_5_OnEditableTextChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_NestSelect_C_BndEvt__WBP_NestSelect_FriendSpawnCode_K2Node_ComponentBoundEvent_5_OnEditableTextChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_NestSelect.WBP_NestSelect_C.BndEvt__WBP_NestSelect_NestCode_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_NestSelect_C_BndEvt__WBP_NestSelect_NestCode_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_NestSelect_C_BndEvt__WBP_NestSelect_NestCode_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_NestSelect_C_BndEvt__WBP_NestSelect_NestCode_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_NestSelect_C_BndEvt__WBP_NestSelect_NestCode_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature) == 0x000010, "Wrong size on WBP_NestSelect_C_BndEvt__WBP_NestSelect_NestCode_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_NestSelect_C_BndEvt__WBP_NestSelect_NestCode_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_NestSelect_C_BndEvt__WBP_NestSelect_NestCode_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_NestSelect.WBP_NestSelect_C.ExecuteUbergraph_WBP_NestSelect
// 0x0258 (0x0258 - 0x0000)
struct WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerController_C*                 K2Node_DynamicCast_AsBP_Player_Controller;         // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         K2Node_CustomEvent_Classes;                        // 0x0028(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0048(0x0010)(ReferenceParm)
	TArray<class FString>                         CallFunc_SortStringArray_ReturnValue;              // 0x0058(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Map_Find_Value;                           // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSteamIdString_ReturnValue;             // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsThe_Isle_Dinosaur_Base;  // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_2;            // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerController_C*                 K2Node_DynamicCast_AsBP_Player_Controller_1;       // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerController_C*                 K2Node_DynamicCast_AsBP_Player_Controller_2;       // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSteamIdString_ReturnValue_1;           // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x00F8(0x0010)()
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0108(0x0010)(ConstParm)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ToUpper_ReturnValue;                      // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0168(0x0010)()
	int32                                         CallFunc_Len_ReturnValue_1;                        // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x017E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17F[0x1];                                      // 0x017F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_NestSelectItem_C*                  CallFunc_Create_ReturnValue;                       // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_3;            // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerController_C*                 K2Node_DynamicCast_AsBP_Player_Controller_3;       // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSteamIdString_ReturnValue_2;           // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x01B8(0x0010)()
	int32                                         CallFunc_Len_ReturnValue_2;                        // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x01D0(0x0010)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_4;            // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue_2;                    // 0x01F0(0x0010)()
	class ABP_PlayerController_C*                 K2Node_DynamicCast_AsBP_Player_Controller_4;       // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_5;            // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item_1;                         // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerController_C*                 K2Node_DynamicCast_AsBP_Player_Controller_5;       // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect) == 0x000008, "Wrong alignment on WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect");
static_assert(sizeof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect) == 0x000258, "Wrong size on WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, EntryPoint) == 0x000000, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_GetOwningPlayer_ReturnValue) == 0x000010, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, K2Node_DynamicCast_AsBP_Player_Controller) == 0x000018, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::K2Node_DynamicCast_AsBP_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, K2Node_CustomEvent_Classes) == 0x000028, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::K2Node_CustomEvent_Classes' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, Temp_int_Loop_Counter_Variable_1) == 0x000038, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_Add_IntInt_ReturnValue_1) == 0x000040, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_Map_Keys_Keys) == 0x000048, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_SortStringArray_ReturnValue) == 0x000058, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_SortStringArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_Array_Get_Item) == 0x000068, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_Array_Length_ReturnValue_1) == 0x000078, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_Map_Find_Value) == 0x000080, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_Map_Find_ReturnValue) == 0x000088, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_Less_IntInt_ReturnValue_1) == 0x000089, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_GetSteamIdString_ReturnValue) == 0x000090, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_GetSteamIdString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, Temp_byte_Variable) == 0x0000A0, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, K2Node_ClassDynamicCast_AsThe_Isle_Dinosaur_Base) == 0x0000A8, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::K2Node_ClassDynamicCast_AsThe_Isle_Dinosaur_Base' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, K2Node_ClassDynamicCast_bSuccess) == 0x0000B0, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, Temp_byte_Variable_1) == 0x0000B1, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x0000B8, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_GetOwningPlayer_ReturnValue_2) == 0x0000C0, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_GetOwningPlayer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, K2Node_DynamicCast_AsBP_Player_Controller_1) == 0x0000C8, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::K2Node_DynamicCast_AsBP_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, K2Node_DynamicCast_AsBP_Player_Controller_2) == 0x0000D8, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::K2Node_DynamicCast_AsBP_Player_Controller_2' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, K2Node_DynamicCast_bSuccess_2) == 0x0000E0, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_GetSteamIdString_ReturnValue_1) == 0x0000E8, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_GetSteamIdString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_GetText_ReturnValue) == 0x0000F8, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, K2Node_ComponentBoundEvent_Text_1) == 0x000108, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_Len_ReturnValue) == 0x000118, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_Conv_TextToString_ReturnValue) == 0x000120, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000130, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_GetSubstring_ReturnValue) == 0x000138, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_ToUpper_ReturnValue) == 0x000148, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_ToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000158, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_Conv_StringToText_ReturnValue) == 0x000168, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_Len_ReturnValue_1) == 0x000178, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_Len_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_Greater_IntInt_ReturnValue) == 0x00017C, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, Temp_bool_Variable) == 0x00017D, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, K2Node_Select_Default) == 0x00017E, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_Create_ReturnValue) == 0x000180, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_GetOwningPlayer_ReturnValue_3) == 0x000188, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_GetOwningPlayer_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, K2Node_DynamicCast_AsBP_Player_Controller_3) == 0x000190, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::K2Node_DynamicCast_AsBP_Player_Controller_3' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, K2Node_DynamicCast_bSuccess_3) == 0x000198, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_AddChild_ReturnValue) == 0x0001A0, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_GetSteamIdString_ReturnValue_2) == 0x0001A8, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_GetSteamIdString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_GetText_ReturnValue_1) == 0x0001B8, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_GetText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_Len_ReturnValue_2) == 0x0001C8, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_Len_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0001CC, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, K2Node_ComponentBoundEvent_Text) == 0x0001D0, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_TextIsEmpty_ReturnValue) == 0x0001E0, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_GetOwningPlayer_ReturnValue_4) == 0x0001E8, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_GetOwningPlayer_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_GetText_ReturnValue_2) == 0x0001F0, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_GetText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, K2Node_DynamicCast_AsBP_Player_Controller_4) == 0x000200, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::K2Node_DynamicCast_AsBP_Player_Controller_4' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, K2Node_DynamicCast_bSuccess_4) == 0x000208, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000210, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_TextIsEmpty_ReturnValue_1) == 0x000220, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, Temp_int_Array_Index_Variable_1) == 0x000224, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_GetOwningPlayer_ReturnValue_5) == 0x000228, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_GetOwningPlayer_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_Array_Get_Item_1) == 0x000230, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, K2Node_DynamicCast_AsBP_Player_Controller_5) == 0x000238, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::K2Node_DynamicCast_AsBP_Player_Controller_5' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, K2Node_DynamicCast_bSuccess_5) == 0x000240, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect, CallFunc_Conv_NameToString_ReturnValue) == 0x000248, "Member 'WBP_NestSelect_C_ExecuteUbergraph_WBP_NestSelect::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");

// Function WBP_NestSelect.WBP_NestSelect_C.Get_FriendSpawnCode_Visibility
// 0x0005 (0x0005 - 0x0000)
struct WBP_NestSelect_C_Get_FriendSpawnCode_Visibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NestSelect_C_Get_FriendSpawnCode_Visibility) == 0x000001, "Wrong alignment on WBP_NestSelect_C_Get_FriendSpawnCode_Visibility");
static_assert(sizeof(WBP_NestSelect_C_Get_FriendSpawnCode_Visibility) == 0x000005, "Wrong size on WBP_NestSelect_C_Get_FriendSpawnCode_Visibility");
static_assert(offsetof(WBP_NestSelect_C_Get_FriendSpawnCode_Visibility, ReturnValue) == 0x000000, "Member 'WBP_NestSelect_C_Get_FriendSpawnCode_Visibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_Get_FriendSpawnCode_Visibility, Temp_bool_Variable) == 0x000001, "Member 'WBP_NestSelect_C_Get_FriendSpawnCode_Visibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_Get_FriendSpawnCode_Visibility, Temp_byte_Variable) == 0x000002, "Member 'WBP_NestSelect_C_Get_FriendSpawnCode_Visibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_Get_FriendSpawnCode_Visibility, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_NestSelect_C_Get_FriendSpawnCode_Visibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_NestSelect_C_Get_FriendSpawnCode_Visibility, K2Node_Select_Default) == 0x000004, "Member 'WBP_NestSelect_C_Get_FriendSpawnCode_Visibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_NestSelect.WBP_NestSelect_C.OnReceivedNestSpecies
// 0x0010 (0x0010 - 0x0000)
struct WBP_NestSelect_C_OnReceivedNestSpecies final
{
public:
	TArray<class UClass*>                         Classes_0;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_NestSelect_C_OnReceivedNestSpecies) == 0x000008, "Wrong alignment on WBP_NestSelect_C_OnReceivedNestSpecies");
static_assert(sizeof(WBP_NestSelect_C_OnReceivedNestSpecies) == 0x000010, "Wrong size on WBP_NestSelect_C_OnReceivedNestSpecies");
static_assert(offsetof(WBP_NestSelect_C_OnReceivedNestSpecies, Classes_0) == 0x000000, "Member 'WBP_NestSelect_C_OnReceivedNestSpecies::Classes_0' has a wrong offset!");

}

