#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ToolTip

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ToolTip.WBP_ToolTip_C.ExecuteUbergraph_WBP_ToolTip
// 0x0010 (0x0010 - 0x0000)
struct WBP_ToolTip_C_ExecuteUbergraph_WBP_ToolTip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ToolTip_C_ExecuteUbergraph_WBP_ToolTip) == 0x000008, "Wrong alignment on WBP_ToolTip_C_ExecuteUbergraph_WBP_ToolTip");
static_assert(sizeof(WBP_ToolTip_C_ExecuteUbergraph_WBP_ToolTip) == 0x000010, "Wrong size on WBP_ToolTip_C_ExecuteUbergraph_WBP_ToolTip");
static_assert(offsetof(WBP_ToolTip_C_ExecuteUbergraph_WBP_ToolTip, EntryPoint) == 0x000000, "Member 'WBP_ToolTip_C_ExecuteUbergraph_WBP_ToolTip::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ToolTip_C_ExecuteUbergraph_WBP_ToolTip, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_ToolTip_C_ExecuteUbergraph_WBP_ToolTip::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_ToolTip.WBP_ToolTip_C.GetToolTipText
// 0x0010 (0x0010 - 0x0000)
struct WBP_ToolTip_C_GetToolTipText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(WBP_ToolTip_C_GetToolTipText) == 0x000008, "Wrong alignment on WBP_ToolTip_C_GetToolTipText");
static_assert(sizeof(WBP_ToolTip_C_GetToolTipText) == 0x000010, "Wrong size on WBP_ToolTip_C_GetToolTipText");
static_assert(offsetof(WBP_ToolTip_C_GetToolTipText, ReturnValue) == 0x000000, "Member 'WBP_ToolTip_C_GetToolTipText::ReturnValue' has a wrong offset!");

}

