#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PerkSlot

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_PerkSlot.WBP_PerkSlot_C.ExecuteUbergraph_WBP_PerkSlot
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PerkSlot_C*                        K2Node_DynamicCast_AsWBP_Perk_Slot;                // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0044(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0088(0x0010)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot) == 0x000008, "Wrong alignment on WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot");
static_assert(sizeof(WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot) == 0x0000A0, "Wrong size on WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot");
static_assert(offsetof(WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot, EntryPoint) == 0x000000, "Member 'WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot, Temp_byte_Variable) == 0x000004, "Member 'WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot, CallFunc_GetAllChildren_ReturnValue) == 0x000008, "Member 'WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot, K2Node_DynamicCast_AsWBP_Perk_Slot) == 0x000030, "Member 'WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot::K2Node_DynamicCast_AsWBP_Perk_Slot' has a wrong offset!");
static_assert(offsetof(WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot, CallFunc_Less_IntInt_ReturnValue) == 0x000039, "Member 'WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot, Temp_bool_Variable) == 0x000040, "Member 'WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot, K2Node_Event_IsDesignTime) == 0x000041, "Member 'WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot, K2Node_Event_MyGeometry) == 0x000044, "Member 'WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot, K2Node_Event_InDeltaTime) == 0x00007C, "Member 'WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot, CallFunc_Conv_NameToText_ReturnValue) == 0x000088, "Member 'WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot, K2Node_Select_Default) == 0x000098, "Member 'WBP_PerkSlot_C_ExecuteUbergraph_WBP_PerkSlot::K2Node_Select_Default' has a wrong offset!");

// Function WBP_PerkSlot.WBP_PerkSlot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_PerkSlot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PerkSlot_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_PerkSlot_C_PreConstruct");
static_assert(sizeof(WBP_PerkSlot_C_PreConstruct) == 0x000001, "Wrong size on WBP_PerkSlot_C_PreConstruct");
static_assert(offsetof(WBP_PerkSlot_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_PerkSlot_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_PerkSlot.WBP_PerkSlot_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_PerkSlot_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PerkSlot_C_Tick) == 0x000004, "Wrong alignment on WBP_PerkSlot_C_Tick");
static_assert(sizeof(WBP_PerkSlot_C_Tick) == 0x00003C, "Wrong size on WBP_PerkSlot_C_Tick");
static_assert(offsetof(WBP_PerkSlot_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_PerkSlot_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_PerkSlot_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_PerkSlot_C_Tick::InDeltaTime' has a wrong offset!");

}

