#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DinoSelectSlot

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "S_CharacterClasses_structs.hpp"


namespace SDK::Params
{

// Function WBP_DinoSelectSlot.WBP_DinoSelectSlot_C.ExecuteUbergraph_WBP_DinoSelectSlot
// 0x0550 (0x0550 - 0x0000)
struct WBP_DinoSelectSlot_C_ExecuteUbergraph_WBP_DinoSelectSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_CharacterClasses                    CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0060(0x00D0)()
	class FText                                   K2Node_CustomEvent_ClassName;                      // 0x0130(0x0010)(ConstParm)
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle;                     // 0x0140(0x03F0)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0530(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Map_Find_Value;                           // 0x0540(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_DinoSelectSlot_C_ExecuteUbergraph_WBP_DinoSelectSlot) == 0x000010, "Wrong alignment on WBP_DinoSelectSlot_C_ExecuteUbergraph_WBP_DinoSelectSlot");
static_assert(sizeof(WBP_DinoSelectSlot_C_ExecuteUbergraph_WBP_DinoSelectSlot) == 0x000550, "Wrong size on WBP_DinoSelectSlot_C_ExecuteUbergraph_WBP_DinoSelectSlot");
static_assert(offsetof(WBP_DinoSelectSlot_C_ExecuteUbergraph_WBP_DinoSelectSlot, EntryPoint) == 0x000000, "Member 'WBP_DinoSelectSlot_C_ExecuteUbergraph_WBP_DinoSelectSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DinoSelectSlot_C_ExecuteUbergraph_WBP_DinoSelectSlot, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'WBP_DinoSelectSlot_C_ExecuteUbergraph_WBP_DinoSelectSlot::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_DinoSelectSlot_C_ExecuteUbergraph_WBP_DinoSelectSlot, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000058, "Member 'WBP_DinoSelectSlot_C_ExecuteUbergraph_WBP_DinoSelectSlot::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DinoSelectSlot_C_ExecuteUbergraph_WBP_DinoSelectSlot, K2Node_MakeStruct_SlateBrush) == 0x000060, "Member 'WBP_DinoSelectSlot_C_ExecuteUbergraph_WBP_DinoSelectSlot::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WBP_DinoSelectSlot_C_ExecuteUbergraph_WBP_DinoSelectSlot, K2Node_CustomEvent_ClassName) == 0x000130, "Member 'WBP_DinoSelectSlot_C_ExecuteUbergraph_WBP_DinoSelectSlot::K2Node_CustomEvent_ClassName' has a wrong offset!");
static_assert(offsetof(WBP_DinoSelectSlot_C_ExecuteUbergraph_WBP_DinoSelectSlot, K2Node_MakeStruct_ButtonStyle) == 0x000140, "Member 'WBP_DinoSelectSlot_C_ExecuteUbergraph_WBP_DinoSelectSlot::K2Node_MakeStruct_ButtonStyle' has a wrong offset!");
static_assert(offsetof(WBP_DinoSelectSlot_C_ExecuteUbergraph_WBP_DinoSelectSlot, CallFunc_Conv_TextToString_ReturnValue) == 0x000530, "Member 'WBP_DinoSelectSlot_C_ExecuteUbergraph_WBP_DinoSelectSlot::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DinoSelectSlot_C_ExecuteUbergraph_WBP_DinoSelectSlot, CallFunc_Map_Find_Value) == 0x000540, "Member 'WBP_DinoSelectSlot_C_ExecuteUbergraph_WBP_DinoSelectSlot::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_DinoSelectSlot_C_ExecuteUbergraph_WBP_DinoSelectSlot, CallFunc_Map_Find_ReturnValue) == 0x000548, "Member 'WBP_DinoSelectSlot_C_ExecuteUbergraph_WBP_DinoSelectSlot::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_DinoSelectSlot.WBP_DinoSelectSlot_C.UpdateDinoSlot
// 0x0010 (0x0010 - 0x0000)
struct WBP_DinoSelectSlot_C_UpdateDinoSlot final
{
public:
	class FText                                   ClassName;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_DinoSelectSlot_C_UpdateDinoSlot) == 0x000008, "Wrong alignment on WBP_DinoSelectSlot_C_UpdateDinoSlot");
static_assert(sizeof(WBP_DinoSelectSlot_C_UpdateDinoSlot) == 0x000010, "Wrong size on WBP_DinoSelectSlot_C_UpdateDinoSlot");
static_assert(offsetof(WBP_DinoSelectSlot_C_UpdateDinoSlot, ClassName) == 0x000000, "Member 'WBP_DinoSelectSlot_C_UpdateDinoSlot::ClassName' has a wrong offset!");

}

