#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ClassSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TheIsle_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ClassSlot.WBP_ClassSlot_C
// 0x0090 (0x0370 - 0x02E0)
class UWBP_ClassSlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCheckBox*                              CheckBox_ClassToggle;                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_129;                                     // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                UncheckedBorder;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_PlayerController_C*                 PlayerController;                                  // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   ClassName;                                         // 0x0308(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMulticastInlineDelegate<void()>              SpamCheck;                                         // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_AdminPanel_C*                      WBP_Owner;                                         // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bClassEnabled;                                     // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTIAvailableClassData                  OriginalSpecieData;                                // 0x0338(0x0038)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void BndEvt__WBP_ClassSlot_CheckBox_ChatHUD_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void Construct();
	void ExecuteUbergraph_WBP_ClassSlot(int32 EntryPoint);
	class FText Get_Hours_Text_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ClassSlot_C">();
	}
	static class UWBP_ClassSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ClassSlot_C>();
	}
};
static_assert(alignof(UWBP_ClassSlot_C) == 0x000008, "Wrong alignment on UWBP_ClassSlot_C");
static_assert(sizeof(UWBP_ClassSlot_C) == 0x000370, "Wrong size on UWBP_ClassSlot_C");
static_assert(offsetof(UWBP_ClassSlot_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_ClassSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSlot_C, CheckBox_ClassToggle) == 0x0002E8, "Member 'UWBP_ClassSlot_C::CheckBox_ClassToggle' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSlot_C, TextBlock_129) == 0x0002F0, "Member 'UWBP_ClassSlot_C::TextBlock_129' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSlot_C, UncheckedBorder) == 0x0002F8, "Member 'UWBP_ClassSlot_C::UncheckedBorder' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSlot_C, PlayerController) == 0x000300, "Member 'UWBP_ClassSlot_C::PlayerController' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSlot_C, ClassName) == 0x000308, "Member 'UWBP_ClassSlot_C::ClassName' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSlot_C, SpamCheck) == 0x000318, "Member 'UWBP_ClassSlot_C::SpamCheck' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSlot_C, WBP_Owner) == 0x000328, "Member 'UWBP_ClassSlot_C::WBP_Owner' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSlot_C, bClassEnabled) == 0x000330, "Member 'UWBP_ClassSlot_C::bClassEnabled' has a wrong offset!");
static_assert(offsetof(UWBP_ClassSlot_C, OriginalSpecieData) == 0x000338, "Member 'UWBP_ClassSlot_C::OriginalSpecieData' has a wrong offset!");

}

