#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Charges

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Charges.WBP_Charges_C.ExecuteUbergraph_WBP_Charges
// 0x0138 (0x0138 - 0x0000)
struct WBP_Charges_C_ExecuteUbergraph_WBP_Charges final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHatchling_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxSparCharges_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHatchling_ReturnValue_1;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable;                                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Select_Default;                             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_1;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_2;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Select_Default_1;                           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHatchling_ReturnValue_2;                // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_3;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_4;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Object;                         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Select_Default_2;                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIStegosaurus*                         K2Node_DynamicCast_AsTIStegosaurus;                // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIHumanBase*                           K2Node_DynamicCast_AsThe_Isle_Human_Base;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIDinosaurBase*                        K2Node_DynamicCast_AsThe_Isle_Dinosaur_Base;       // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxSparCharges_ReturnValue_1;          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATIDilophosaurus*                       K2Node_DynamicCast_AsThe_Isle_Dilophosaurus;       // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIDryosaurus*                          K2Node_DynamicCast_AsThe_Isle_Dryosaurus;          // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentWeaponMaxAmmo_ReturnValue;      // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_MaxCharges;                     // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_ByteToDouble_ReturnValue;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0090(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGrowthFromJuvenileToAdult_ReturnValue; // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Select_Default_3;                           // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetCurrentCharges_Charges;                // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCooldownActive_ReturnValue;             // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FB[0x5];                                       // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_ByteToDouble_ReturnValue_1;          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Round_A_ImplicitCast;                     // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges) == 0x000008, "Wrong alignment on WBP_Charges_C_ExecuteUbergraph_WBP_Charges");
static_assert(sizeof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges) == 0x000138, "Wrong size on WBP_Charges_C_ExecuteUbergraph_WBP_Charges");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, EntryPoint) == 0x000000, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_IsHatchling_ReturnValue) == 0x000006, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_IsHatchling_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_GetMaxSparCharges_ReturnValue) == 0x000008, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_GetMaxSparCharges_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_Round_ReturnValue) == 0x00000C, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_IsHatchling_ReturnValue_1) == 0x000010, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_IsHatchling_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_Conv_IntToByte_ReturnValue) == 0x000011, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, Temp_bool_Variable) == 0x000012, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, Temp_byte_Variable) == 0x000013, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, Temp_bool_Variable_1) == 0x000014, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, K2Node_Select_Default) == 0x000015, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, Temp_byte_Variable_1) == 0x000016, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, Temp_bool_Variable_2) == 0x000017, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, Temp_byte_Variable_2) == 0x000018, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, K2Node_Select_Default_1) == 0x000019, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_IsValid_ReturnValue_2) == 0x00001A, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_IsHatchling_ReturnValue_2) == 0x00001B, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_IsHatchling_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, Temp_bool_Variable_3) == 0x00001C, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, Temp_byte_Variable_3) == 0x00001D, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, Temp_byte_Variable_4) == 0x00001E, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, K2Node_CustomEvent_Object) == 0x000020, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::K2Node_CustomEvent_Object' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, K2Node_Select_Default_2) == 0x000028, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, K2Node_DynamicCast_AsTIStegosaurus) == 0x000030, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::K2Node_DynamicCast_AsTIStegosaurus' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, K2Node_DynamicCast_AsThe_Isle_Human_Base) == 0x000040, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::K2Node_DynamicCast_AsThe_Isle_Human_Base' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, K2Node_DynamicCast_AsThe_Isle_Dinosaur_Base) == 0x000050, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::K2Node_DynamicCast_AsThe_Isle_Dinosaur_Base' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_GetMaxSparCharges_ReturnValue_1) == 0x00005C, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_GetMaxSparCharges_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, K2Node_DynamicCast_AsThe_Isle_Dilophosaurus) == 0x000060, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::K2Node_DynamicCast_AsThe_Isle_Dilophosaurus' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, K2Node_DynamicCast_bSuccess_3) == 0x000068, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000069, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, K2Node_DynamicCast_AsThe_Isle_Dryosaurus) == 0x000070, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::K2Node_DynamicCast_AsThe_Isle_Dryosaurus' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, K2Node_DynamicCast_bSuccess_4) == 0x000078, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_IsValid_ReturnValue_3) == 0x000079, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_GetCurrentWeaponMaxAmmo_ReturnValue) == 0x00007C, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_GetCurrentWeaponMaxAmmo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000080, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, K2Node_CustomEvent_MaxCharges) == 0x000081, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::K2Node_CustomEvent_MaxCharges' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000082, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_Conv_ByteToDouble_ReturnValue) == 0x000088, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_Conv_ByteToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, K2Node_Event_MyGeometry) == 0x000090, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, K2Node_Event_InDeltaTime) == 0x0000C8, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, K2Node_CreateDelegate_OutputDelegate) == 0x0000CC, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_IsValid_ReturnValue_4) == 0x0000DC, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000E0, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_GetGrowthFromJuvenileToAdult_ReturnValue) == 0x0000E8, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_GetGrowthFromJuvenileToAdult_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000EC, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000F0, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, K2Node_Select_Default_3) == 0x0000F8, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_GetCurrentCharges_Charges) == 0x0000F9, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_GetCurrentCharges_Charges' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_IsCooldownActive_ReturnValue) == 0x0000FA, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_IsCooldownActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_Conv_ByteToDouble_ReturnValue_1) == 0x000100, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_Conv_ByteToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_Conv_BoolToDouble_ReturnValue) == 0x000108, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_Conv_BoolToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_Round_A_ImplicitCast) == 0x000110, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_Round_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000118, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000120, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000128, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000130, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_ExecuteUbergraph_WBP_Charges, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x000134, "Member 'WBP_Charges_C_ExecuteUbergraph_WBP_Charges::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");

// Function WBP_Charges.WBP_Charges_C.GetChargeVisibility
// 0x0054 (0x0054 - 0x0000)
struct WBP_Charges_C_GetChargeVisibility final
{
public:
	uint8                                         ChargeIndex;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            Tint;                                              // 0x0004(0x0014)(Parm, OutParm)
	bool                                          CallFunc_IsCooldownActive_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetCurrentCharges_Charges;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_ByteByte_ReturnValue;                // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0040(0x0014)()
};
static_assert(alignof(WBP_Charges_C_GetChargeVisibility) == 0x000004, "Wrong alignment on WBP_Charges_C_GetChargeVisibility");
static_assert(sizeof(WBP_Charges_C_GetChargeVisibility) == 0x000054, "Wrong size on WBP_Charges_C_GetChargeVisibility");
static_assert(offsetof(WBP_Charges_C_GetChargeVisibility, ChargeIndex) == 0x000000, "Member 'WBP_Charges_C_GetChargeVisibility::ChargeIndex' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_GetChargeVisibility, Tint) == 0x000004, "Member 'WBP_Charges_C_GetChargeVisibility::Tint' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_GetChargeVisibility, CallFunc_IsCooldownActive_ReturnValue) == 0x000018, "Member 'WBP_Charges_C_GetChargeVisibility::CallFunc_IsCooldownActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_GetChargeVisibility, CallFunc_GetCurrentCharges_Charges) == 0x000019, "Member 'WBP_Charges_C_GetChargeVisibility::CallFunc_GetCurrentCharges_Charges' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_GetChargeVisibility, CallFunc_SelectColor_ReturnValue) == 0x00001C, "Member 'WBP_Charges_C_GetChargeVisibility::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_GetChargeVisibility, CallFunc_Less_ByteByte_ReturnValue) == 0x00002C, "Member 'WBP_Charges_C_GetChargeVisibility::CallFunc_Less_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_GetChargeVisibility, CallFunc_SelectColor_ReturnValue_1) == 0x000030, "Member 'WBP_Charges_C_GetChargeVisibility::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_GetChargeVisibility, K2Node_MakeStruct_SlateColor) == 0x000040, "Member 'WBP_Charges_C_GetChargeVisibility::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WBP_Charges.WBP_Charges_C.GetCurrentCharges
// 0x0020 (0x0020 - 0x0000)
struct WBP_Charges_C_GetCurrentCharges final
{
public:
	uint8                                         Charges;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetAbilityCharges_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHatchling_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHatchling_ReturnValue_1;                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSparCharges_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetAbilityCharges_ReturnValue_1;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHatchling_ReturnValue_2;                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Round_A_ImplicitCast;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Charges_C_GetCurrentCharges) == 0x000008, "Wrong alignment on WBP_Charges_C_GetCurrentCharges");
static_assert(sizeof(WBP_Charges_C_GetCurrentCharges) == 0x000020, "Wrong size on WBP_Charges_C_GetCurrentCharges");
static_assert(offsetof(WBP_Charges_C_GetCurrentCharges, Charges) == 0x000000, "Member 'WBP_Charges_C_GetCurrentCharges::Charges' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_GetCurrentCharges, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WBP_Charges_C_GetCurrentCharges::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_GetCurrentCharges, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'WBP_Charges_C_GetCurrentCharges::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_GetCurrentCharges, CallFunc_GetAbilityCharges_ReturnValue) == 0x000003, "Member 'WBP_Charges_C_GetCurrentCharges::CallFunc_GetAbilityCharges_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_GetCurrentCharges, CallFunc_IsHatchling_ReturnValue) == 0x000004, "Member 'WBP_Charges_C_GetCurrentCharges::CallFunc_IsHatchling_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_GetCurrentCharges, CallFunc_Conv_IntToByte_ReturnValue) == 0x000005, "Member 'WBP_Charges_C_GetCurrentCharges::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_GetCurrentCharges, CallFunc_IsValid_ReturnValue_2) == 0x000006, "Member 'WBP_Charges_C_GetCurrentCharges::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_GetCurrentCharges, CallFunc_IsHatchling_ReturnValue_1) == 0x000007, "Member 'WBP_Charges_C_GetCurrentCharges::CallFunc_IsHatchling_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_GetCurrentCharges, CallFunc_GetSparCharges_ReturnValue) == 0x000008, "Member 'WBP_Charges_C_GetCurrentCharges::CallFunc_GetSparCharges_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_GetCurrentCharges, CallFunc_Round_ReturnValue) == 0x00000C, "Member 'WBP_Charges_C_GetCurrentCharges::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_GetCurrentCharges, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000010, "Member 'WBP_Charges_C_GetCurrentCharges::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_GetCurrentCharges, CallFunc_IsValid_ReturnValue_3) == 0x000011, "Member 'WBP_Charges_C_GetCurrentCharges::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_GetCurrentCharges, CallFunc_GetAbilityCharges_ReturnValue_1) == 0x000012, "Member 'WBP_Charges_C_GetCurrentCharges::CallFunc_GetAbilityCharges_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_GetCurrentCharges, CallFunc_IsHatchling_ReturnValue_2) == 0x000013, "Member 'WBP_Charges_C_GetCurrentCharges::CallFunc_IsHatchling_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_GetCurrentCharges, CallFunc_IsValid_ReturnValue_4) == 0x000014, "Member 'WBP_Charges_C_GetCurrentCharges::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_GetCurrentCharges, CallFunc_Round_A_ImplicitCast) == 0x000018, "Member 'WBP_Charges_C_GetCurrentCharges::CallFunc_Round_A_ImplicitCast' has a wrong offset!");

// Function WBP_Charges.WBP_Charges_C.IsCooldownActive
// 0x000D (0x000D - 0x0000)
struct WBP_Charges_C_IsCooldownActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSecondaryOnCooldown_ReturnValue;        // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSecondaryOnCooldown_ReturnValue_1;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_2;                     // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Charges_C_IsCooldownActive) == 0x000001, "Wrong alignment on WBP_Charges_C_IsCooldownActive");
static_assert(sizeof(WBP_Charges_C_IsCooldownActive) == 0x00000D, "Wrong size on WBP_Charges_C_IsCooldownActive");
static_assert(offsetof(WBP_Charges_C_IsCooldownActive, ReturnValue) == 0x000000, "Member 'WBP_Charges_C_IsCooldownActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_IsCooldownActive, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WBP_Charges_C_IsCooldownActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_IsCooldownActive, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'WBP_Charges_C_IsCooldownActive::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_IsCooldownActive, CallFunc_HasTag_ReturnValue) == 0x000003, "Member 'WBP_Charges_C_IsCooldownActive::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_IsCooldownActive, CallFunc_IsValid_ReturnValue_2) == 0x000004, "Member 'WBP_Charges_C_IsCooldownActive::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_IsCooldownActive, CallFunc_IsValid_ReturnValue_3) == 0x000005, "Member 'WBP_Charges_C_IsCooldownActive::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_IsCooldownActive, CallFunc_HasTag_ReturnValue_1) == 0x000006, "Member 'WBP_Charges_C_IsCooldownActive::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_IsCooldownActive, CallFunc_IsSecondaryOnCooldown_ReturnValue) == 0x000007, "Member 'WBP_Charges_C_IsCooldownActive::CallFunc_IsSecondaryOnCooldown_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_IsCooldownActive, CallFunc_BooleanOR_ReturnValue) == 0x000008, "Member 'WBP_Charges_C_IsCooldownActive::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_IsCooldownActive, CallFunc_IsSecondaryOnCooldown_ReturnValue_1) == 0x000009, "Member 'WBP_Charges_C_IsCooldownActive::CallFunc_IsSecondaryOnCooldown_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_IsCooldownActive, CallFunc_IsValid_ReturnValue_4) == 0x00000A, "Member 'WBP_Charges_C_IsCooldownActive::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_IsCooldownActive, CallFunc_HasTag_ReturnValue_2) == 0x00000B, "Member 'WBP_Charges_C_IsCooldownActive::CallFunc_HasTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_IsCooldownActive, CallFunc_BooleanOR_ReturnValue_1) == 0x00000C, "Member 'WBP_Charges_C_IsCooldownActive::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function WBP_Charges.WBP_Charges_C.SetDinosaur
// 0x0008 (0x0008 - 0x0000)
struct WBP_Charges_C_SetDinosaur final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Charges_C_SetDinosaur) == 0x000008, "Wrong alignment on WBP_Charges_C_SetDinosaur");
static_assert(sizeof(WBP_Charges_C_SetDinosaur) == 0x000008, "Wrong size on WBP_Charges_C_SetDinosaur");
static_assert(offsetof(WBP_Charges_C_SetDinosaur, Object) == 0x000000, "Member 'WBP_Charges_C_SetDinosaur::Object' has a wrong offset!");

// Function WBP_Charges.WBP_Charges_C.SetMaxCharges
// 0x0001 (0x0001 - 0x0000)
struct WBP_Charges_C_SetMaxCharges final
{
public:
	uint8                                         MaxCharges;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Charges_C_SetMaxCharges) == 0x000001, "Wrong alignment on WBP_Charges_C_SetMaxCharges");
static_assert(sizeof(WBP_Charges_C_SetMaxCharges) == 0x000001, "Wrong size on WBP_Charges_C_SetMaxCharges");
static_assert(offsetof(WBP_Charges_C_SetMaxCharges, MaxCharges) == 0x000000, "Member 'WBP_Charges_C_SetMaxCharges::MaxCharges' has a wrong offset!");

// Function WBP_Charges.WBP_Charges_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Charges_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Charges_C_Tick) == 0x000004, "Wrong alignment on WBP_Charges_C_Tick");
static_assert(sizeof(WBP_Charges_C_Tick) == 0x00003C, "Wrong size on WBP_Charges_C_Tick");
static_assert(offsetof(WBP_Charges_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Charges_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Charges_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_Charges_C_Tick::InDeltaTime' has a wrong offset!");

}

