#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AdminPanelSlot_Owner

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_AdminPanelSlot_Owner.WBP_AdminPanelSlot_Owner_C.BndEvt__BloodEditableTextBox_K2Node_ComponentBoundEvent_16_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_AdminPanelSlot_Owner_C_BndEvt__BloodEditableTextBox_K2Node_ComponentBoundEvent_16_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_AdminPanelSlot_Owner_C_BndEvt__BloodEditableTextBox_K2Node_ComponentBoundEvent_16_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AdminPanelSlot_Owner_C_BndEvt__BloodEditableTextBox_K2Node_ComponentBoundEvent_16_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_AdminPanelSlot_Owner_C_BndEvt__BloodEditableTextBox_K2Node_ComponentBoundEvent_16_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000010, "Wrong size on WBP_AdminPanelSlot_Owner_C_BndEvt__BloodEditableTextBox_K2Node_ComponentBoundEvent_16_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_BndEvt__BloodEditableTextBox_K2Node_ComponentBoundEvent_16_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_AdminPanelSlot_Owner_C_BndEvt__BloodEditableTextBox_K2Node_ComponentBoundEvent_16_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_AdminPanelSlot_Owner.WBP_AdminPanelSlot_Owner_C.BndEvt__EditableTextBox_384_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_AdminPanelSlot_Owner_C_BndEvt__EditableTextBox_384_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_AdminPanelSlot_Owner_C_BndEvt__EditableTextBox_384_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AdminPanelSlot_Owner_C_BndEvt__EditableTextBox_384_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_AdminPanelSlot_Owner_C_BndEvt__EditableTextBox_384_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000010, "Wrong size on WBP_AdminPanelSlot_Owner_C_BndEvt__EditableTextBox_384_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_BndEvt__EditableTextBox_384_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_AdminPanelSlot_Owner_C_BndEvt__EditableTextBox_384_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_AdminPanelSlot_Owner.WBP_AdminPanelSlot_Owner_C.BndEvt__HungerEditableTextBox_K2Node_ComponentBoundEvent_11_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_AdminPanelSlot_Owner_C_BndEvt__HungerEditableTextBox_K2Node_ComponentBoundEvent_11_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_AdminPanelSlot_Owner_C_BndEvt__HungerEditableTextBox_K2Node_ComponentBoundEvent_11_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AdminPanelSlot_Owner_C_BndEvt__HungerEditableTextBox_K2Node_ComponentBoundEvent_11_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_AdminPanelSlot_Owner_C_BndEvt__HungerEditableTextBox_K2Node_ComponentBoundEvent_11_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000010, "Wrong size on WBP_AdminPanelSlot_Owner_C_BndEvt__HungerEditableTextBox_K2Node_ComponentBoundEvent_11_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_BndEvt__HungerEditableTextBox_K2Node_ComponentBoundEvent_11_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_AdminPanelSlot_Owner_C_BndEvt__HungerEditableTextBox_K2Node_ComponentBoundEvent_11_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_AdminPanelSlot_Owner.WBP_AdminPanelSlot_Owner_C.BndEvt__ThirstEditableTextBox_K2Node_ComponentBoundEvent_13_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_AdminPanelSlot_Owner_C_BndEvt__ThirstEditableTextBox_K2Node_ComponentBoundEvent_13_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_AdminPanelSlot_Owner_C_BndEvt__ThirstEditableTextBox_K2Node_ComponentBoundEvent_13_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AdminPanelSlot_Owner_C_BndEvt__ThirstEditableTextBox_K2Node_ComponentBoundEvent_13_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_AdminPanelSlot_Owner_C_BndEvt__ThirstEditableTextBox_K2Node_ComponentBoundEvent_13_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000010, "Wrong size on WBP_AdminPanelSlot_Owner_C_BndEvt__ThirstEditableTextBox_K2Node_ComponentBoundEvent_13_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_BndEvt__ThirstEditableTextBox_K2Node_ComponentBoundEvent_13_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_AdminPanelSlot_Owner_C_BndEvt__ThirstEditableTextBox_K2Node_ComponentBoundEvent_13_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_AdminPanelSlot_Owner.WBP_AdminPanelSlot_Owner_C.BndEvt__WBP_AdminPanelSlot_Owner_HealthEditableTextBox_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_AdminPanelSlot_Owner_C_BndEvt__WBP_AdminPanelSlot_Owner_HealthEditableTextBox_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_AdminPanelSlot_Owner_C_BndEvt__WBP_AdminPanelSlot_Owner_HealthEditableTextBox_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AdminPanelSlot_Owner_C_BndEvt__WBP_AdminPanelSlot_Owner_HealthEditableTextBox_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_AdminPanelSlot_Owner_C_BndEvt__WBP_AdminPanelSlot_Owner_HealthEditableTextBox_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000010, "Wrong size on WBP_AdminPanelSlot_Owner_C_BndEvt__WBP_AdminPanelSlot_Owner_HealthEditableTextBox_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_BndEvt__WBP_AdminPanelSlot_Owner_HealthEditableTextBox_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_AdminPanelSlot_Owner_C_BndEvt__WBP_AdminPanelSlot_Owner_HealthEditableTextBox_K2Node_ComponentBoundEvent_4_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_AdminPanelSlot_Owner.WBP_AdminPanelSlot_Owner_C.BndEvt__WBP_AdminPanelSlot_Owner_StaminaEditableTextBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_AdminPanelSlot_Owner_C_BndEvt__WBP_AdminPanelSlot_Owner_StaminaEditableTextBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_AdminPanelSlot_Owner_C_BndEvt__WBP_AdminPanelSlot_Owner_StaminaEditableTextBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AdminPanelSlot_Owner_C_BndEvt__WBP_AdminPanelSlot_Owner_StaminaEditableTextBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_AdminPanelSlot_Owner_C_BndEvt__WBP_AdminPanelSlot_Owner_StaminaEditableTextBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000010, "Wrong size on WBP_AdminPanelSlot_Owner_C_BndEvt__WBP_AdminPanelSlot_Owner_StaminaEditableTextBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_BndEvt__WBP_AdminPanelSlot_Owner_StaminaEditableTextBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_AdminPanelSlot_Owner_C_BndEvt__WBP_AdminPanelSlot_Owner_StaminaEditableTextBox_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_AdminPanelSlot_Owner.WBP_AdminPanelSlot_Owner_C.ExecuteUbergraph_WBP_AdminPanelSlot_Owner
// 0x0338 (0x0338 - 0x0000)
struct WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_StringToDouble_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text_5;                 // 0x0070(0x0010)(ConstParm)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_1;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_5;          // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue_1;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_6;          // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_7;          // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_2;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_8;          // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_9;          // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text_4;                 // 0x00E8(0x0010)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_10;         // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text_3;                 // 0x0108(0x0010)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_11;         // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text_2;                 // 0x0128(0x0010)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_12;         // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_3;        // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue_2;                  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_13;         // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_14;         // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerController_C*                 K2Node_DynamicCast_AsBP_Player_Controller;         // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_15;         // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x01A0(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x01B0(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x01C0(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x01D0(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x01E0(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_5;            // 0x01F0(0x0010)()
	bool                                          CallFunc_bIsEditor_ReturnValue;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsAdminCred_ReturnValue;               // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsDevCred_ReturnValue;                 // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_bIsEditor_ReturnValue_1;                  // 0x0203(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0205(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsAdminCred_ReturnValue_1;             // 0x0206(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsDevCred_ReturnValue_1;               // 0x0207(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_bIsEditor_ReturnValue_2;                  // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsAdminCred_ReturnValue_2;             // 0x020B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsDevCred_ReturnValue_2;               // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_bIsEditor_ReturnValue_3;                  // 0x020D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x020E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x020F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsAdminCred_ReturnValue_3;             // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsDevCred_ReturnValue_3;               // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x0213(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_bIsEditor_ReturnValue_4;                  // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0218(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0228(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsAdminCred_ReturnValue_4;             // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsDevCred_ReturnValue_4;               // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_9;                  // 0x0233(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_bIsEditor_ReturnValue_5;                  // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsAdminCred_ReturnValue_5;             // 0x0235(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsDevCred_ReturnValue_5;               // 0x0236(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_10;                 // 0x0237(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue_3;                  // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_11;                 // 0x0239(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23A[0x6];                                      // 0x023A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0240(0x0010)(ConstParm)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0250(0x0010)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_16;         // 0x0260(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_17;         // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_18;         // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_19;         // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_6;            // 0x02A0(0x0010)()
	bool                                          CallFunc_bIsEditor_ReturnValue_6;                  // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x02B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsAdminCred_ReturnValue_6;             // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsDevCred_ReturnValue_6;               // 0x02C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_12;                 // 0x02C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_13;                 // 0x02C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_4;        // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue_4;                  // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_20;         // 0x02D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_21;         // 0x02E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_7;            // 0x02F8(0x0010)()
	bool                                          CallFunc_bIsEditor_ReturnValue_7;                  // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsAdminCred_ReturnValue_7;             // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsDevCred_ReturnValue_7;               // 0x030A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_14;                 // 0x030B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_5;        // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_15;                 // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue_5;                  // 0x0319(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31A[0x2];                                      // 0x031A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ServerGrow_Percent_ImplicitCast;          // 0x031C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ServerSetHunger_Percent_ImplicitCast;     // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ServerSetThirst_Percent_ImplicitCast;     // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ServerSetBlood_Percent_ImplicitCast;      // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ServerSetHealth_Percent_ImplicitCast;     // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ServerSetStamina_Percent_ImplicitCast;    // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner) == 0x000008, "Wrong alignment on WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner");
static_assert(sizeof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner) == 0x000338, "Wrong size on WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, EntryPoint) == 0x000000, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_StringToDouble_ReturnValue) == 0x000008, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_StringToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_FClamp_ReturnValue) == 0x000010, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_IsNumeric_ReturnValue) == 0x000018, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_IsNumeric_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_TextToString_ReturnValue) == 0x000020, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000030, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000040, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_TextToString_ReturnValue_3) == 0x000050, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_TextToString_ReturnValue_4) == 0x000060, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_TextToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, K2Node_ComponentBoundEvent_Text_5) == 0x000070, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::K2Node_ComponentBoundEvent_Text_5' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_StringToDouble_ReturnValue_1) == 0x000080, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_StringToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_TextToString_ReturnValue_5) == 0x000088, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_TextToString_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_IsNumeric_ReturnValue_1) == 0x000098, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_IsNumeric_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_TextToString_ReturnValue_6) == 0x0000A0, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_TextToString_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_TextToString_ReturnValue_7) == 0x0000B0, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_TextToString_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_StringToDouble_ReturnValue_2) == 0x0000C0, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_StringToDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_TextToString_ReturnValue_8) == 0x0000C8, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_TextToString_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_TextToString_ReturnValue_9) == 0x0000D8, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_TextToString_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, K2Node_ComponentBoundEvent_Text_4) == 0x0000E8, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::K2Node_ComponentBoundEvent_Text_4' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_TextToString_ReturnValue_10) == 0x0000F8, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_TextToString_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, K2Node_ComponentBoundEvent_Text_3) == 0x000108, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::K2Node_ComponentBoundEvent_Text_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_TextToString_ReturnValue_11) == 0x000118, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_TextToString_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, K2Node_ComponentBoundEvent_Text_2) == 0x000128, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::K2Node_ComponentBoundEvent_Text_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_TextToString_ReturnValue_12) == 0x000138, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_TextToString_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_StringToDouble_ReturnValue_3) == 0x000148, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_StringToDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_IsNumeric_ReturnValue_2) == 0x000150, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_IsNumeric_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_TextToString_ReturnValue_13) == 0x000158, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_TextToString_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_TextToString_ReturnValue_14) == 0x000168, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_TextToString_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_GetOwningPlayer_ReturnValue) == 0x000178, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, K2Node_DynamicCast_AsBP_Player_Controller) == 0x000180, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::K2Node_DynamicCast_AsBP_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, K2Node_DynamicCast_bSuccess) == 0x000188, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_TextToString_ReturnValue_15) == 0x000190, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_TextToString_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_MakeLiteralText_ReturnValue) == 0x0001A0, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_MakeLiteralText_ReturnValue_1) == 0x0001B0, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_MakeLiteralText_ReturnValue_2) == 0x0001C0, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_MakeLiteralText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_MakeLiteralText_ReturnValue_3) == 0x0001D0, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_MakeLiteralText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_MakeLiteralText_ReturnValue_4) == 0x0001E0, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_MakeLiteralText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_MakeLiteralText_ReturnValue_5) == 0x0001F0, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_MakeLiteralText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_bIsEditor_ReturnValue) == 0x000200, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_bIsEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_GetIsAdminCred_ReturnValue) == 0x000201, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_GetIsAdminCred_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_GetIsDevCred_ReturnValue) == 0x000202, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_GetIsDevCred_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_bIsEditor_ReturnValue_1) == 0x000203, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_bIsEditor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_BooleanOR_ReturnValue) == 0x000204, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_BooleanOR_ReturnValue_1) == 0x000205, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_GetIsAdminCred_ReturnValue_1) == 0x000206, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_GetIsAdminCred_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_GetIsDevCred_ReturnValue_1) == 0x000207, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_GetIsDevCred_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_BooleanOR_ReturnValue_2) == 0x000208, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_BooleanOR_ReturnValue_3) == 0x000209, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_bIsEditor_ReturnValue_2) == 0x00020A, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_bIsEditor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_GetIsAdminCred_ReturnValue_2) == 0x00020B, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_GetIsAdminCred_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_GetIsDevCred_ReturnValue_2) == 0x00020C, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_GetIsDevCred_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_bIsEditor_ReturnValue_3) == 0x00020D, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_bIsEditor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_BooleanOR_ReturnValue_4) == 0x00020E, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_BooleanOR_ReturnValue_5) == 0x00020F, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_GetIsAdminCred_ReturnValue_3) == 0x000210, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_GetIsAdminCred_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_GetIsDevCred_ReturnValue_3) == 0x000211, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_GetIsDevCred_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_BooleanOR_ReturnValue_6) == 0x000212, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_BooleanOR_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_BooleanOR_ReturnValue_7) == 0x000213, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_BooleanOR_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_bIsEditor_ReturnValue_4) == 0x000214, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_bIsEditor_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, K2Node_CreateDelegate_OutputDelegate) == 0x000218, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000228, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_GetIsAdminCred_ReturnValue_4) == 0x000230, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_GetIsAdminCred_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_GetIsDevCred_ReturnValue_4) == 0x000231, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_GetIsDevCred_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_BooleanOR_ReturnValue_8) == 0x000232, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_BooleanOR_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_BooleanOR_ReturnValue_9) == 0x000233, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_BooleanOR_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_bIsEditor_ReturnValue_5) == 0x000234, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_bIsEditor_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_GetIsAdminCred_ReturnValue_5) == 0x000235, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_GetIsAdminCred_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_GetIsDevCred_ReturnValue_5) == 0x000236, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_GetIsDevCred_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_BooleanOR_ReturnValue_10) == 0x000237, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_BooleanOR_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_IsNumeric_ReturnValue_3) == 0x000238, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_IsNumeric_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_BooleanOR_ReturnValue_11) == 0x000239, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_BooleanOR_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, K2Node_ComponentBoundEvent_Text_1) == 0x000240, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, K2Node_ComponentBoundEvent_Text) == 0x000250, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_TextToString_ReturnValue_16) == 0x000260, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_TextToString_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_TextToString_ReturnValue_17) == 0x000270, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_TextToString_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_TextToString_ReturnValue_18) == 0x000280, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_TextToString_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_TextToString_ReturnValue_19) == 0x000290, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_TextToString_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_MakeLiteralText_ReturnValue_6) == 0x0002A0, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_MakeLiteralText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_bIsEditor_ReturnValue_6) == 0x0002B0, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_bIsEditor_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002B4, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_GetIsAdminCred_ReturnValue_6) == 0x0002C4, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_GetIsAdminCred_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_GetIsDevCred_ReturnValue_6) == 0x0002C5, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_GetIsDevCred_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_BooleanOR_ReturnValue_12) == 0x0002C6, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_BooleanOR_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_BooleanOR_ReturnValue_13) == 0x0002C7, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_BooleanOR_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_StringToDouble_ReturnValue_4) == 0x0002C8, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_StringToDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_IsNumeric_ReturnValue_4) == 0x0002D0, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_IsNumeric_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_TextToString_ReturnValue_20) == 0x0002D8, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_TextToString_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_TextToString_ReturnValue_21) == 0x0002E8, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_TextToString_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_MakeLiteralText_ReturnValue_7) == 0x0002F8, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_MakeLiteralText_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_bIsEditor_ReturnValue_7) == 0x000308, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_bIsEditor_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_GetIsAdminCred_ReturnValue_7) == 0x000309, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_GetIsAdminCred_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_GetIsDevCred_ReturnValue_7) == 0x00030A, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_GetIsDevCred_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_BooleanOR_ReturnValue_14) == 0x00030B, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_BooleanOR_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_Conv_StringToDouble_ReturnValue_5) == 0x000310, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_Conv_StringToDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_BooleanOR_ReturnValue_15) == 0x000318, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_BooleanOR_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_IsNumeric_ReturnValue_5) == 0x000319, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_IsNumeric_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_ServerGrow_Percent_ImplicitCast) == 0x00031C, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_ServerGrow_Percent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_ServerSetHunger_Percent_ImplicitCast) == 0x000320, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_ServerSetHunger_Percent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_ServerSetThirst_Percent_ImplicitCast) == 0x000324, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_ServerSetThirst_Percent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_ServerSetBlood_Percent_ImplicitCast) == 0x000328, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_ServerSetBlood_Percent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_ServerSetHealth_Percent_ImplicitCast) == 0x00032C, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_ServerSetHealth_Percent_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner, CallFunc_ServerSetStamina_Percent_ImplicitCast) == 0x000330, "Member 'WBP_AdminPanelSlot_Owner_C_ExecuteUbergraph_WBP_AdminPanelSlot_Owner::CallFunc_ServerSetStamina_Percent_ImplicitCast' has a wrong offset!");

// Function WBP_AdminPanelSlot_Owner.WBP_AdminPanelSlot_Owner_C.Get_Hours_Text_0
// 0x0020 (0x0020 - 0x0000)
struct WBP_AdminPanelSlot_Owner_C_Get_Hours_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0010(0x0010)()
};
static_assert(alignof(WBP_AdminPanelSlot_Owner_C_Get_Hours_Text_0) == 0x000008, "Wrong alignment on WBP_AdminPanelSlot_Owner_C_Get_Hours_Text_0");
static_assert(sizeof(WBP_AdminPanelSlot_Owner_C_Get_Hours_Text_0) == 0x000020, "Wrong size on WBP_AdminPanelSlot_Owner_C_Get_Hours_Text_0");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_Get_Hours_Text_0, ReturnValue) == 0x000000, "Member 'WBP_AdminPanelSlot_Owner_C_Get_Hours_Text_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanelSlot_Owner_C_Get_Hours_Text_0, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000010, "Member 'WBP_AdminPanelSlot_Owner_C_Get_Hours_Text_0::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");

}

