#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FactionSelect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TheIsle_structs.hpp"
#include "TheIsle_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_FactionSelect.WBP_FactionSelect_C
// 0x00C0 (0x04A0 - 0x03E0)
class UWBP_FactionSelect_C final : public UTIFactionSelectWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USizeBox*                               AssetPanelSizeBox;                                 // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PanelButton_C*                     CarnivoreButton;                                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SquareCheckBox_C*                  DeveloperCheckBox;                                 // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SquareButton_C*                    EggButton;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PanelButton_C*                     GenerationOneButton;                               // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PanelButton_C*                     GenerationTwoButton;                               // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PanelButton_C*                     GenerationTwoButtonOff;                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PanelButton_C*                     HerbivoreButton;                                   // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBoxEggs;                                 // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SquareButton_C*                    LogoutButton;                                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        MainSwitcher;                                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MonitorStaticImage;                                // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PanelButton_C*                     OmnivoreButton;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_135;                                     // 0x0450(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CharacterSelect_C*                 WBP_CharacterSelect;                               // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NestSelect_C*                      WBP_NestSelect;                                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PanelButtonBroken_C*               WBP_PanelButtonBroken;                             // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UClass*                                 DinoClass;                                         // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerController_C*                 PlayerControllerRef;                               // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EDietType                                     SelectedDiet;                                      // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundMix*                              WeatherDisabledSoundMix;                           // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseSpawnZoneSelection;                            // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AUltra_Dynamic_Weather_C*               BP_MapWeather;                                     // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__CarnivoreButton_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature();
	void BndEvt__CarnivoreButton_K2Node_ComponentBoundEvent_2_OnHovered__DelegateSignature();
	void BndEvt__CarnivoreButton_K2Node_ComponentBoundEvent_3_OnUnhovered__DelegateSignature();
	void BndEvt__GenerationOneButton_K2Node_ComponentBoundEvent_4_OnUnhovered__DelegateSignature();
	void BndEvt__GenerationOneButton_K2Node_ComponentBoundEvent_6_OnHovered__DelegateSignature();
	void BndEvt__GenerationTwoButton_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature();
	void BndEvt__GenerationTwoButton_K2Node_ComponentBoundEvent_5_OnUnhovered__DelegateSignature();
	void BndEvt__GenerationTwoButton_K2Node_ComponentBoundEvent_9_OnHovered__DelegateSignature();
	void BndEvt__HerbivoreButton_K2Node_ComponentBoundEvent_0_OnUnhovered__DelegateSignature();
	void BndEvt__HerbivoreButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();
	void BndEvt__HerbivoreButton_K2Node_ComponentBoundEvent_1_OnHovered__DelegateSignature();
	void BndEvt__LogoutButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();
	void BndEvt__OmnivoreButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();
	void BndEvt__OmnivoreButton_K2Node_ComponentBoundEvent_7_OnUnhovered__DelegateSignature();
	void BndEvt__OmnivoreButton_K2Node_ComponentBoundEvent_8_OnHovered__DelegateSignature();
	void BndEvt__WBP_FactionSelect_WBP_PanelButtonBroken_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature();
	void BndEvt__WBP_FactionSelect_WBP_SquareButton_C_0_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature();
	void Construct();
	void Destruct();
	void DisableFactionPanel();
	void ExecuteUbergraph_WBP_FactionSelect(int32 EntryPoint);
	class FText Get_TextBlock_135_Text();
	bool OnClosed(bool bInstant);
	bool OnOpened(bool bInstant);
	void OnReceivedAvailableClasses(const TArray<struct FTIAvailableClassData>& Classes);
	void OnReceivedNestSpecies(const TArray<class UClass*>& Classes);
	void ReturnToCharacterSelect();
	void ReturnToFactionSelect();
	void SetHumanButtonEnabled(bool Enabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_FactionSelect_C">();
	}
	static class UWBP_FactionSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_FactionSelect_C>();
	}
};
static_assert(alignof(UWBP_FactionSelect_C) == 0x000008, "Wrong alignment on UWBP_FactionSelect_C");
static_assert(sizeof(UWBP_FactionSelect_C) == 0x0004A0, "Wrong size on UWBP_FactionSelect_C");
static_assert(offsetof(UWBP_FactionSelect_C, UberGraphFrame) == 0x0003E0, "Member 'UWBP_FactionSelect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_FactionSelect_C, AssetPanelSizeBox) == 0x0003E8, "Member 'UWBP_FactionSelect_C::AssetPanelSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_FactionSelect_C, CarnivoreButton) == 0x0003F0, "Member 'UWBP_FactionSelect_C::CarnivoreButton' has a wrong offset!");
static_assert(offsetof(UWBP_FactionSelect_C, DeveloperCheckBox) == 0x0003F8, "Member 'UWBP_FactionSelect_C::DeveloperCheckBox' has a wrong offset!");
static_assert(offsetof(UWBP_FactionSelect_C, EggButton) == 0x000400, "Member 'UWBP_FactionSelect_C::EggButton' has a wrong offset!");
static_assert(offsetof(UWBP_FactionSelect_C, GenerationOneButton) == 0x000408, "Member 'UWBP_FactionSelect_C::GenerationOneButton' has a wrong offset!");
static_assert(offsetof(UWBP_FactionSelect_C, GenerationTwoButton) == 0x000410, "Member 'UWBP_FactionSelect_C::GenerationTwoButton' has a wrong offset!");
static_assert(offsetof(UWBP_FactionSelect_C, GenerationTwoButtonOff) == 0x000418, "Member 'UWBP_FactionSelect_C::GenerationTwoButtonOff' has a wrong offset!");
static_assert(offsetof(UWBP_FactionSelect_C, HerbivoreButton) == 0x000420, "Member 'UWBP_FactionSelect_C::HerbivoreButton' has a wrong offset!");
static_assert(offsetof(UWBP_FactionSelect_C, HorizontalBoxEggs) == 0x000428, "Member 'UWBP_FactionSelect_C::HorizontalBoxEggs' has a wrong offset!");
static_assert(offsetof(UWBP_FactionSelect_C, LogoutButton) == 0x000430, "Member 'UWBP_FactionSelect_C::LogoutButton' has a wrong offset!");
static_assert(offsetof(UWBP_FactionSelect_C, MainSwitcher) == 0x000438, "Member 'UWBP_FactionSelect_C::MainSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_FactionSelect_C, MonitorStaticImage) == 0x000440, "Member 'UWBP_FactionSelect_C::MonitorStaticImage' has a wrong offset!");
static_assert(offsetof(UWBP_FactionSelect_C, OmnivoreButton) == 0x000448, "Member 'UWBP_FactionSelect_C::OmnivoreButton' has a wrong offset!");
static_assert(offsetof(UWBP_FactionSelect_C, TextBlock_135) == 0x000450, "Member 'UWBP_FactionSelect_C::TextBlock_135' has a wrong offset!");
static_assert(offsetof(UWBP_FactionSelect_C, WBP_CharacterSelect) == 0x000458, "Member 'UWBP_FactionSelect_C::WBP_CharacterSelect' has a wrong offset!");
static_assert(offsetof(UWBP_FactionSelect_C, WBP_NestSelect) == 0x000460, "Member 'UWBP_FactionSelect_C::WBP_NestSelect' has a wrong offset!");
static_assert(offsetof(UWBP_FactionSelect_C, WBP_PanelButtonBroken) == 0x000468, "Member 'UWBP_FactionSelect_C::WBP_PanelButtonBroken' has a wrong offset!");
static_assert(offsetof(UWBP_FactionSelect_C, DinoClass) == 0x000470, "Member 'UWBP_FactionSelect_C::DinoClass' has a wrong offset!");
static_assert(offsetof(UWBP_FactionSelect_C, PlayerControllerRef) == 0x000478, "Member 'UWBP_FactionSelect_C::PlayerControllerRef' has a wrong offset!");
static_assert(offsetof(UWBP_FactionSelect_C, SelectedDiet) == 0x000480, "Member 'UWBP_FactionSelect_C::SelectedDiet' has a wrong offset!");
static_assert(offsetof(UWBP_FactionSelect_C, WeatherDisabledSoundMix) == 0x000488, "Member 'UWBP_FactionSelect_C::WeatherDisabledSoundMix' has a wrong offset!");
static_assert(offsetof(UWBP_FactionSelect_C, bUseSpawnZoneSelection) == 0x000490, "Member 'UWBP_FactionSelect_C::bUseSpawnZoneSelection' has a wrong offset!");
static_assert(offsetof(UWBP_FactionSelect_C, BP_MapWeather) == 0x000498, "Member 'UWBP_FactionSelect_C::BP_MapWeather' has a wrong offset!");

}

