#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NotificationMessage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NotificationMessage.WBP_NotificationMessage_C
// 0x0030 (0x0310 - 0x02E0)
class UWBP_NotificationMessage_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NotificaitonText;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NotificationStack_C*               NotificationWidget;                                // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   NotificationText;                                  // 0x0300(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_WBP_NotificationMessage(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NotificationMessage_C">();
	}
	static class UWBP_NotificationMessage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NotificationMessage_C>();
	}
};
static_assert(alignof(UWBP_NotificationMessage_C) == 0x000008, "Wrong alignment on UWBP_NotificationMessage_C");
static_assert(sizeof(UWBP_NotificationMessage_C) == 0x000310, "Wrong size on UWBP_NotificationMessage_C");
static_assert(offsetof(UWBP_NotificationMessage_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_NotificationMessage_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_NotificationMessage_C, InvalidationBox_0) == 0x0002E8, "Member 'UWBP_NotificationMessage_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_NotificationMessage_C, NotificaitonText) == 0x0002F0, "Member 'UWBP_NotificationMessage_C::NotificaitonText' has a wrong offset!");
static_assert(offsetof(UWBP_NotificationMessage_C, NotificationWidget) == 0x0002F8, "Member 'UWBP_NotificationMessage_C::NotificationWidget' has a wrong offset!");
static_assert(offsetof(UWBP_NotificationMessage_C, NotificationText) == 0x000300, "Member 'UWBP_NotificationMessage_C::NotificationText' has a wrong offset!");

}

