#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AIDebug_NameWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AIDebug_NameWidget.WBP_AIDebug_NameWidget_C
// 0x0020 (0x0328 - 0x0308)
class UWBP_AIDebug_NameWidget_C final : public UTIAIDebugNameWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_186;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_1;                                            // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_AIDebug_NameWidget(int32 EntryPoint);
	struct FSlateColor Get_Name_ColorAndOpacity();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_AIDebug_NameWidget_C">();
	}
	static class UWBP_AIDebug_NameWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AIDebug_NameWidget_C>();
	}
};
static_assert(alignof(UWBP_AIDebug_NameWidget_C) == 0x000008, "Wrong alignment on UWBP_AIDebug_NameWidget_C");
static_assert(sizeof(UWBP_AIDebug_NameWidget_C) == 0x000328, "Wrong size on UWBP_AIDebug_NameWidget_C");
static_assert(offsetof(UWBP_AIDebug_NameWidget_C, UberGraphFrame) == 0x000308, "Member 'UWBP_AIDebug_NameWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_AIDebug_NameWidget_C, Image_186) == 0x000310, "Member 'UWBP_AIDebug_NameWidget_C::Image_186' has a wrong offset!");
static_assert(offsetof(UWBP_AIDebug_NameWidget_C, Name_0) == 0x000318, "Member 'UWBP_AIDebug_NameWidget_C::Name_0' has a wrong offset!");
static_assert(offsetof(UWBP_AIDebug_NameWidget_C, Name_1) == 0x000320, "Member 'UWBP_AIDebug_NameWidget_C::Name_1' has a wrong offset!");

}

