#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayersList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PlayersList.WBP_PlayersList_C
// 0x00B0 (0x0440 - 0x0390)
class UWBP_PlayersList_C final : public UTIUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Glow;                                              // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ListScrollBox;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Overlay;                                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       PlayerFilterText;                                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Players;                                 // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ServerName;                                   // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_PlayerCount;                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_PlayerMax;                               // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ServerUptime;                            // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerListSlot_C*                  WBP_PlayerListSlot;                                // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerListSlot_C*                  WBP_PlayerListSlot_175;                            // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               WrapBox_125;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         AmountOfPlayers;                                   // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC[0x4];                                      // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ServerName_0;                                      // 0x0400(0x0010)(Edit, BlueprintVisible)
	int32                                         ServerTimeInS;                                     // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SurvivalGameState_C*                GameState;                                         // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         ServerMinutes;                                     // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ServerHours;                                       // 0x0424(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ServerDays;                                        // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerController_C*                 MyPlayerController;                                // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         ServerTotalPlayers;                                // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void EscapeDelegate_Event_0();
	void ExecuteUbergraph_WBP_PlayersList(int32 EntryPoint);
	void RefreshList();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PlayersList_C">();
	}
	static class UWBP_PlayersList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PlayersList_C>();
	}
};
static_assert(alignof(UWBP_PlayersList_C) == 0x000008, "Wrong alignment on UWBP_PlayersList_C");
static_assert(sizeof(UWBP_PlayersList_C) == 0x000440, "Wrong size on UWBP_PlayersList_C");
static_assert(offsetof(UWBP_PlayersList_C, UberGraphFrame) == 0x000390, "Member 'UWBP_PlayersList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PlayersList_C, Glow) == 0x000398, "Member 'UWBP_PlayersList_C::Glow' has a wrong offset!");
static_assert(offsetof(UWBP_PlayersList_C, ListScrollBox) == 0x0003A0, "Member 'UWBP_PlayersList_C::ListScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_PlayersList_C, Overlay) == 0x0003A8, "Member 'UWBP_PlayersList_C::Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_PlayersList_C, PlayerFilterText) == 0x0003B0, "Member 'UWBP_PlayersList_C::PlayerFilterText' has a wrong offset!");
static_assert(offsetof(UWBP_PlayersList_C, ScrollBox_Players) == 0x0003B8, "Member 'UWBP_PlayersList_C::ScrollBox_Players' has a wrong offset!");
static_assert(offsetof(UWBP_PlayersList_C, Text_ServerName) == 0x0003C0, "Member 'UWBP_PlayersList_C::Text_ServerName' has a wrong offset!");
static_assert(offsetof(UWBP_PlayersList_C, TextBlock_PlayerCount) == 0x0003C8, "Member 'UWBP_PlayersList_C::TextBlock_PlayerCount' has a wrong offset!");
static_assert(offsetof(UWBP_PlayersList_C, TextBlock_PlayerMax) == 0x0003D0, "Member 'UWBP_PlayersList_C::TextBlock_PlayerMax' has a wrong offset!");
static_assert(offsetof(UWBP_PlayersList_C, TextBlock_ServerUptime) == 0x0003D8, "Member 'UWBP_PlayersList_C::TextBlock_ServerUptime' has a wrong offset!");
static_assert(offsetof(UWBP_PlayersList_C, WBP_PlayerListSlot) == 0x0003E0, "Member 'UWBP_PlayersList_C::WBP_PlayerListSlot' has a wrong offset!");
static_assert(offsetof(UWBP_PlayersList_C, WBP_PlayerListSlot_175) == 0x0003E8, "Member 'UWBP_PlayersList_C::WBP_PlayerListSlot_175' has a wrong offset!");
static_assert(offsetof(UWBP_PlayersList_C, WrapBox_125) == 0x0003F0, "Member 'UWBP_PlayersList_C::WrapBox_125' has a wrong offset!");
static_assert(offsetof(UWBP_PlayersList_C, AmountOfPlayers) == 0x0003F8, "Member 'UWBP_PlayersList_C::AmountOfPlayers' has a wrong offset!");
static_assert(offsetof(UWBP_PlayersList_C, ServerName_0) == 0x000400, "Member 'UWBP_PlayersList_C::ServerName_0' has a wrong offset!");
static_assert(offsetof(UWBP_PlayersList_C, ServerTimeInS) == 0x000410, "Member 'UWBP_PlayersList_C::ServerTimeInS' has a wrong offset!");
static_assert(offsetof(UWBP_PlayersList_C, GameState) == 0x000418, "Member 'UWBP_PlayersList_C::GameState' has a wrong offset!");
static_assert(offsetof(UWBP_PlayersList_C, ServerMinutes) == 0x000420, "Member 'UWBP_PlayersList_C::ServerMinutes' has a wrong offset!");
static_assert(offsetof(UWBP_PlayersList_C, ServerHours) == 0x000424, "Member 'UWBP_PlayersList_C::ServerHours' has a wrong offset!");
static_assert(offsetof(UWBP_PlayersList_C, ServerDays) == 0x000428, "Member 'UWBP_PlayersList_C::ServerDays' has a wrong offset!");
static_assert(offsetof(UWBP_PlayersList_C, MyPlayerController) == 0x000430, "Member 'UWBP_PlayersList_C::MyPlayerController' has a wrong offset!");
static_assert(offsetof(UWBP_PlayersList_C, ServerTotalPlayers) == 0x000438, "Member 'UWBP_PlayersList_C::ServerTotalPlayers' has a wrong offset!");

}

