#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TextInputBox

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_TextInputBox.WBP_TextInputBox_C.BndEvt__MainEditableText_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_TextInputBox_C_BndEvt__MainEditableText_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text_0;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_TextInputBox_C_BndEvt__MainEditableText_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TextInputBox_C_BndEvt__MainEditableText_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_TextInputBox_C_BndEvt__MainEditableText_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature) == 0x000010, "Wrong size on WBP_TextInputBox_C_BndEvt__MainEditableText_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_TextInputBox_C_BndEvt__MainEditableText_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature, Text_0) == 0x000000, "Member 'WBP_TextInputBox_C_BndEvt__MainEditableText_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature::Text_0' has a wrong offset!");

// Function WBP_TextInputBox.WBP_TextInputBox_C.BndEvt__WBP_TextInputBox_MainEditableText_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_TextInputBox_C_BndEvt__WBP_TextInputBox_MainEditableText_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text_0;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TextInputBox_C_BndEvt__WBP_TextInputBox_MainEditableText_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_TextInputBox_C_BndEvt__WBP_TextInputBox_MainEditableText_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_TextInputBox_C_BndEvt__WBP_TextInputBox_MainEditableText_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_TextInputBox_C_BndEvt__WBP_TextInputBox_MainEditableText_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_TextInputBox_C_BndEvt__WBP_TextInputBox_MainEditableText_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature, Text_0) == 0x000000, "Member 'WBP_TextInputBox_C_BndEvt__WBP_TextInputBox_MainEditableText_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature::Text_0' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_BndEvt__WBP_TextInputBox_MainEditableText_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature, CommitMethod) == 0x000010, "Member 'WBP_TextInputBox_C_BndEvt__WBP_TextInputBox_MainEditableText_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_TextInputBox.WBP_TextInputBox_C.ExecuteUbergraph_WBP_TextInputBox
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0038(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue;             // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue_1;           // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0080(0x0010)(ConstParm)
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue_2;           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x00B0(0x0010)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox) == 0x000008, "Wrong alignment on WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox");
static_assert(sizeof(WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox) == 0x0000C8, "Wrong size on WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox");
static_assert(offsetof(WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox, EntryPoint) == 0x000000, "Member 'WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox, Temp_struct_Variable) == 0x000004, "Member 'WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox, Temp_struct_Variable_1) == 0x000014, "Member 'WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox, Temp_bool_Variable) == 0x000024, "Member 'WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox, Temp_object_Variable) == 0x000028, "Member 'WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox, Temp_object_Variable_1) == 0x000030, "Member 'WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox, K2Node_Event_MyGeometry) == 0x000038, "Member 'WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox, K2Node_Event_InDeltaTime) == 0x000070, "Member 'WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox, CallFunc_IsValid_ReturnValue) == 0x000074, "Member 'WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox, CallFunc_HasKeyboardFocus_ReturnValue) == 0x000075, "Member 'WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox::CallFunc_HasKeyboardFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox, CallFunc_HasKeyboardFocus_ReturnValue_1) == 0x000076, "Member 'WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox::CallFunc_HasKeyboardFocus_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000077, "Member 'WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox, K2Node_Event_IsDesignTime) == 0x000078, "Member 'WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox, K2Node_ComponentBoundEvent_Text_1) == 0x000080, "Member 'WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox, CallFunc_HasKeyboardFocus_ReturnValue_2) == 0x000090, "Member 'WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox::CallFunc_HasKeyboardFocus_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox, Temp_bool_Variable_1) == 0x000091, "Member 'WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox, K2Node_Select_Default) == 0x000098, "Member 'WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox, K2Node_Select_Default_1) == 0x0000A0, "Member 'WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox, K2Node_ComponentBoundEvent_Text) == 0x0000B0, "Member 'WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox, K2Node_ComponentBoundEvent_CommitMethod) == 0x0000C0, "Member 'WBP_TextInputBox_C_ExecuteUbergraph_WBP_TextInputBox::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");

// Function WBP_TextInputBox.WBP_TextInputBox_C.HandleInputLimit
// 0x0068 (0x0068 - 0x0000)
struct WBP_TextInputBox_C_HandleInputLimit final
{
public:
	class FText                                   Text_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InText;                                            // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0010)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TextInputBox_C_HandleInputLimit) == 0x000008, "Wrong alignment on WBP_TextInputBox_C_HandleInputLimit");
static_assert(sizeof(WBP_TextInputBox_C_HandleInputLimit) == 0x000068, "Wrong size on WBP_TextInputBox_C_HandleInputLimit");
static_assert(offsetof(WBP_TextInputBox_C_HandleInputLimit, Text_0) == 0x000000, "Member 'WBP_TextInputBox_C_HandleInputLimit::Text_0' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_HandleInputLimit, InText) == 0x000010, "Member 'WBP_TextInputBox_C_HandleInputLimit::InText' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_HandleInputLimit, CallFunc_Len_ReturnValue) == 0x000020, "Member 'WBP_TextInputBox_C_HandleInputLimit::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_HandleInputLimit, CallFunc_Conv_TextToString_ReturnValue) == 0x000028, "Member 'WBP_TextInputBox_C_HandleInputLimit::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_HandleInputLimit, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'WBP_TextInputBox_C_HandleInputLimit::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_HandleInputLimit, CallFunc_GetSubstring_ReturnValue) == 0x000040, "Member 'WBP_TextInputBox_C_HandleInputLimit::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_HandleInputLimit, CallFunc_Conv_StringToText_ReturnValue) == 0x000050, "Member 'WBP_TextInputBox_C_HandleInputLimit::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_HandleInputLimit, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000060, "Member 'WBP_TextInputBox_C_HandleInputLimit::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_TextInputBox.WBP_TextInputBox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_TextInputBox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TextInputBox_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_TextInputBox_C_PreConstruct");
static_assert(sizeof(WBP_TextInputBox_C_PreConstruct) == 0x000001, "Wrong size on WBP_TextInputBox_C_PreConstruct");
static_assert(offsetof(WBP_TextInputBox_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_TextInputBox_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_TextInputBox.WBP_TextInputBox_C.SetFontColor
// 0x0010 (0x0010 - 0x0000)
struct WBP_TextInputBox_C_SetFontColor final
{
public:
	struct FLinearColor                           NewColor;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TextInputBox_C_SetFontColor) == 0x000004, "Wrong alignment on WBP_TextInputBox_C_SetFontColor");
static_assert(sizeof(WBP_TextInputBox_C_SetFontColor) == 0x000010, "Wrong size on WBP_TextInputBox_C_SetFontColor");
static_assert(offsetof(WBP_TextInputBox_C_SetFontColor, NewColor) == 0x000000, "Member 'WBP_TextInputBox_C_SetFontColor::NewColor' has a wrong offset!");

// Function WBP_TextInputBox.WBP_TextInputBox_C.SetFontSize
// 0x0370 (0x0370 - 0x0000)
struct WBP_TextInputBox_C_SetFontSize final
{
public:
	int32                                         Size;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0010(0x0060)(HasGetValueTypeHash)
	struct FEditableTextStyle                     K2Node_MakeStruct_EditableTextStyle;               // 0x0070(0x02F0)()
	float                                         K2Node_MakeStruct_Size_ImplicitCast;               // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TextInputBox_C_SetFontSize) == 0x000010, "Wrong alignment on WBP_TextInputBox_C_SetFontSize");
static_assert(sizeof(WBP_TextInputBox_C_SetFontSize) == 0x000370, "Wrong size on WBP_TextInputBox_C_SetFontSize");
static_assert(offsetof(WBP_TextInputBox_C_SetFontSize, Size) == 0x000000, "Member 'WBP_TextInputBox_C_SetFontSize::Size' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_SetFontSize, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000008, "Member 'WBP_TextInputBox_C_SetFontSize::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_SetFontSize, K2Node_MakeStruct_SlateFontInfo) == 0x000010, "Member 'WBP_TextInputBox_C_SetFontSize::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_SetFontSize, K2Node_MakeStruct_EditableTextStyle) == 0x000070, "Member 'WBP_TextInputBox_C_SetFontSize::K2Node_MakeStruct_EditableTextStyle' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_SetFontSize, K2Node_MakeStruct_Size_ImplicitCast) == 0x000360, "Member 'WBP_TextInputBox_C_SetFontSize::K2Node_MakeStruct_Size_ImplicitCast' has a wrong offset!");

// Function WBP_TextInputBox.WBP_TextInputBox_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_TextInputBox_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_TextInputBox_C_Tick) == 0x000004, "Wrong alignment on WBP_TextInputBox_C_Tick");
static_assert(sizeof(WBP_TextInputBox_C_Tick) == 0x00003C, "Wrong size on WBP_TextInputBox_C_Tick");
static_assert(offsetof(WBP_TextInputBox_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_TextInputBox_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_TextInputBox_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_TextInputBox_C_Tick::InDeltaTime' has a wrong offset!");

}

