#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Charges

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Charges.WBP_Charges_C
// 0x0040 (0x0320 - 0x02E0)
class UWBP_Charges_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ChargeIndicator;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ATIDryosaurus*                          Dryosaurus;                                        // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ATIDinosaurBase*                        SparringDinosaur;                                  // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ATIDilophosaurus*                       Dilophosaurus;                                     // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ATIHumanBase*                           Human;                                             // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ChargeMaterial;                                    // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ATIStegosaurus*                         Stegosaurus;                                       // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_Charges(int32 EntryPoint);
	void GetChargeVisibility(uint8 ChargeIndex, struct FSlateColor* Tint);
	void GetCurrentCharges(uint8* Charges);
	bool IsCooldownActive();
	void OnInitialized();
	void SetDinosaur(class UObject* Object);
	void SetMaxCharges(uint8 MaxCharges);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateMaxCharges();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Charges_C">();
	}
	static class UWBP_Charges_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Charges_C>();
	}
};
static_assert(alignof(UWBP_Charges_C) == 0x000008, "Wrong alignment on UWBP_Charges_C");
static_assert(sizeof(UWBP_Charges_C) == 0x000320, "Wrong size on UWBP_Charges_C");
static_assert(offsetof(UWBP_Charges_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Charges_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Charges_C, ChargeIndicator) == 0x0002E8, "Member 'UWBP_Charges_C::ChargeIndicator' has a wrong offset!");
static_assert(offsetof(UWBP_Charges_C, Dryosaurus) == 0x0002F0, "Member 'UWBP_Charges_C::Dryosaurus' has a wrong offset!");
static_assert(offsetof(UWBP_Charges_C, SparringDinosaur) == 0x0002F8, "Member 'UWBP_Charges_C::SparringDinosaur' has a wrong offset!");
static_assert(offsetof(UWBP_Charges_C, Dilophosaurus) == 0x000300, "Member 'UWBP_Charges_C::Dilophosaurus' has a wrong offset!");
static_assert(offsetof(UWBP_Charges_C, Human) == 0x000308, "Member 'UWBP_Charges_C::Human' has a wrong offset!");
static_assert(offsetof(UWBP_Charges_C, ChargeMaterial) == 0x000310, "Member 'UWBP_Charges_C::ChargeMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_Charges_C, Stegosaurus) == 0x000318, "Member 'UWBP_Charges_C::Stegosaurus' has a wrong offset!");

}

