#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NestSelect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NestSelect.WBP_NestSelect_C
// 0x01A0 (0x0480 - 0x02E0)
class UWBP_NestSelect_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CodeFades;                                         // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Black;                                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Cancel;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Cancel_1;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Cancel_2;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Cancel_SpawnCode;                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_ConfirmFriendCode;                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_ConfirmNest;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Help;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonBG;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DNAscroll;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fade;                                              // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          FriendSpawnCode;                                   // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LowerFade;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          NestCode;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Notification;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NotificationBackground;                            // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           NotificationPanel;                                 // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NotificationText;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Overlay;                                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RedGlowL;                                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                RenderImageBorder;                                 // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScreenBorder;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Dinosaurs;                               // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollBoxBG;                                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollCover;                                       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollDarken;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SlidersBG;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UpperFade;                                         // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DinoSelectSlot_C*                  WBP_DinoSelectSlot;                                // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_UMG_Dossier_C*                      DossierUMG;                                        // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              EventCancel;                                       // 0x03F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_FactionSelect_C*                   OwnerWidget;                                       // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     GameInstanceRef;                                   // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, class UClass*>            Classes;                                           // 0x0410(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         SortedArray;                                       // 0x0460(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 NestSpecies;                                       // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerController_C*                 OwnerPCRef;                                        // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_NestSelect_Button_Cancel_1_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_NestSelect_Button_Cancel_2_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_NestSelect_Button_Cancel_3_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_NestSelect_Button_Cancel_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_NestSelect_Button_Confirm_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_NestSelect_Button_ConfirmFriendCode_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_NestSelect_FriendSpawnCode_K2Node_ComponentBoundEvent_5_OnEditableTextChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__WBP_NestSelect_NestCode_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature(const class FText& Text);
	void Construct();
	void ExecuteUbergraph_WBP_NestSelect(int32 EntryPoint);
	ESlateVisibility Get_FriendSpawnCode_Visibility();
	void OnReceivedNestSpecies(const TArray<class UClass*>& Classes_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NestSelect_C">();
	}
	static class UWBP_NestSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NestSelect_C>();
	}
};
static_assert(alignof(UWBP_NestSelect_C) == 0x000008, "Wrong alignment on UWBP_NestSelect_C");
static_assert(sizeof(UWBP_NestSelect_C) == 0x000480, "Wrong size on UWBP_NestSelect_C");
static_assert(offsetof(UWBP_NestSelect_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_NestSelect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, CodeFades) == 0x0002E8, "Member 'UWBP_NestSelect_C::CodeFades' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, FadeIn) == 0x0002F0, "Member 'UWBP_NestSelect_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, Black) == 0x0002F8, "Member 'UWBP_NestSelect_C::Black' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, Button_Cancel) == 0x000300, "Member 'UWBP_NestSelect_C::Button_Cancel' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, Button_Cancel_1) == 0x000308, "Member 'UWBP_NestSelect_C::Button_Cancel_1' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, Button_Cancel_2) == 0x000310, "Member 'UWBP_NestSelect_C::Button_Cancel_2' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, Button_Cancel_SpawnCode) == 0x000318, "Member 'UWBP_NestSelect_C::Button_Cancel_SpawnCode' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, Button_ConfirmFriendCode) == 0x000320, "Member 'UWBP_NestSelect_C::Button_ConfirmFriendCode' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, Button_ConfirmNest) == 0x000328, "Member 'UWBP_NestSelect_C::Button_ConfirmNest' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, Button_Help) == 0x000330, "Member 'UWBP_NestSelect_C::Button_Help' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, ButtonBG) == 0x000338, "Member 'UWBP_NestSelect_C::ButtonBG' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, DNAscroll) == 0x000340, "Member 'UWBP_NestSelect_C::DNAscroll' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, Fade) == 0x000348, "Member 'UWBP_NestSelect_C::Fade' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, FriendSpawnCode) == 0x000350, "Member 'UWBP_NestSelect_C::FriendSpawnCode' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, Image_0) == 0x000358, "Member 'UWBP_NestSelect_C::Image_0' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, LowerFade) == 0x000360, "Member 'UWBP_NestSelect_C::LowerFade' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, NestCode) == 0x000368, "Member 'UWBP_NestSelect_C::NestCode' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, Notification) == 0x000370, "Member 'UWBP_NestSelect_C::Notification' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, NotificationBackground) == 0x000378, "Member 'UWBP_NestSelect_C::NotificationBackground' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, NotificationPanel) == 0x000380, "Member 'UWBP_NestSelect_C::NotificationPanel' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, NotificationText) == 0x000388, "Member 'UWBP_NestSelect_C::NotificationText' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, Overlay) == 0x000390, "Member 'UWBP_NestSelect_C::Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, RedGlowL) == 0x000398, "Member 'UWBP_NestSelect_C::RedGlowL' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, RenderImageBorder) == 0x0003A0, "Member 'UWBP_NestSelect_C::RenderImageBorder' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, ScreenBorder) == 0x0003A8, "Member 'UWBP_NestSelect_C::ScreenBorder' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, ScrollBox_Dinosaurs) == 0x0003B0, "Member 'UWBP_NestSelect_C::ScrollBox_Dinosaurs' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, ScrollBoxBG) == 0x0003B8, "Member 'UWBP_NestSelect_C::ScrollBoxBG' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, ScrollCover) == 0x0003C0, "Member 'UWBP_NestSelect_C::ScrollCover' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, ScrollDarken) == 0x0003C8, "Member 'UWBP_NestSelect_C::ScrollDarken' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, SlidersBG) == 0x0003D0, "Member 'UWBP_NestSelect_C::SlidersBG' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, UpperFade) == 0x0003D8, "Member 'UWBP_NestSelect_C::UpperFade' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, WBP_DinoSelectSlot) == 0x0003E0, "Member 'UWBP_NestSelect_C::WBP_DinoSelectSlot' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, DossierUMG) == 0x0003E8, "Member 'UWBP_NestSelect_C::DossierUMG' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, EventCancel) == 0x0003F0, "Member 'UWBP_NestSelect_C::EventCancel' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, OwnerWidget) == 0x000400, "Member 'UWBP_NestSelect_C::OwnerWidget' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, GameInstanceRef) == 0x000408, "Member 'UWBP_NestSelect_C::GameInstanceRef' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, Classes) == 0x000410, "Member 'UWBP_NestSelect_C::Classes' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, SortedArray) == 0x000460, "Member 'UWBP_NestSelect_C::SortedArray' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, NestSpecies) == 0x000470, "Member 'UWBP_NestSelect_C::NestSpecies' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelect_C, OwnerPCRef) == 0x000478, "Member 'UWBP_NestSelect_C::OwnerPCRef' has a wrong offset!");

}

