#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AdminPanel

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "TheIsle_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_AdminPanel.WBP_AdminPanel_C.AISpawners
// 0x0002 (0x0002 - 0x0000)
struct WBP_AdminPanel_C_AISpawners final
{
public:
	bool                                          bIsAISpawningOn;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsAIEventsOn;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AdminPanel_C_AISpawners) == 0x000001, "Wrong alignment on WBP_AdminPanel_C_AISpawners");
static_assert(sizeof(WBP_AdminPanel_C_AISpawners) == 0x000002, "Wrong size on WBP_AdminPanel_C_AISpawners");
static_assert(offsetof(WBP_AdminPanel_C_AISpawners, bIsAISpawningOn) == 0x000000, "Member 'WBP_AdminPanel_C_AISpawners::bIsAISpawningOn' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_AISpawners, bIsAIEventsOn) == 0x000001, "Member 'WBP_AdminPanel_C_AISpawners::bIsAIEventsOn' has a wrong offset!");

// Function WBP_AdminPanel.WBP_AdminPanel_C.BndEvt__DayLightingVal_K2Node_ComponentBoundEvent_14_OnEditableTextCommittedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_AdminPanel_C_BndEvt__DayLightingVal_K2Node_ComponentBoundEvent_14_OnEditableTextCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AdminPanel_C_BndEvt__DayLightingVal_K2Node_ComponentBoundEvent_14_OnEditableTextCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AdminPanel_C_BndEvt__DayLightingVal_K2Node_ComponentBoundEvent_14_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_AdminPanel_C_BndEvt__DayLightingVal_K2Node_ComponentBoundEvent_14_OnEditableTextCommittedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_AdminPanel_C_BndEvt__DayLightingVal_K2Node_ComponentBoundEvent_14_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_AdminPanel_C_BndEvt__DayLightingVal_K2Node_ComponentBoundEvent_14_OnEditableTextCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_AdminPanel_C_BndEvt__DayLightingVal_K2Node_ComponentBoundEvent_14_OnEditableTextCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_BndEvt__DayLightingVal_K2Node_ComponentBoundEvent_14_OnEditableTextCommittedEvent__DelegateSignature, CommitMethod) == 0x000010, "Member 'WBP_AdminPanel_C_BndEvt__DayLightingVal_K2Node_ComponentBoundEvent_14_OnEditableTextCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_AdminPanel.WBP_AdminPanel_C.BndEvt__LightingDay_K2Node_ComponentBoundEvent_11_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_AdminPanel_C_BndEvt__LightingDay_K2Node_ComponentBoundEvent_11_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AdminPanel_C_BndEvt__LightingDay_K2Node_ComponentBoundEvent_11_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_AdminPanel_C_BndEvt__LightingDay_K2Node_ComponentBoundEvent_11_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_AdminPanel_C_BndEvt__LightingDay_K2Node_ComponentBoundEvent_11_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_AdminPanel_C_BndEvt__LightingDay_K2Node_ComponentBoundEvent_11_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_AdminPanel_C_BndEvt__LightingDay_K2Node_ComponentBoundEvent_11_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'WBP_AdminPanel_C_BndEvt__LightingDay_K2Node_ComponentBoundEvent_11_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function WBP_AdminPanel.WBP_AdminPanel_C.BndEvt__LightingNight_K2Node_ComponentBoundEvent_12_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_AdminPanel_C_BndEvt__LightingNight_K2Node_ComponentBoundEvent_12_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AdminPanel_C_BndEvt__LightingNight_K2Node_ComponentBoundEvent_12_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_AdminPanel_C_BndEvt__LightingNight_K2Node_ComponentBoundEvent_12_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_AdminPanel_C_BndEvt__LightingNight_K2Node_ComponentBoundEvent_12_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_AdminPanel_C_BndEvt__LightingNight_K2Node_ComponentBoundEvent_12_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_AdminPanel_C_BndEvt__LightingNight_K2Node_ComponentBoundEvent_12_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'WBP_AdminPanel_C_BndEvt__LightingNight_K2Node_ComponentBoundEvent_12_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function WBP_AdminPanel.WBP_AdminPanel_C.BndEvt__PlayerFilterText_1_K2Node_ComponentBoundEvent_20_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_AdminPanel_C_BndEvt__PlayerFilterText_1_K2Node_ComponentBoundEvent_20_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_AdminPanel_C_BndEvt__PlayerFilterText_1_K2Node_ComponentBoundEvent_20_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AdminPanel_C_BndEvt__PlayerFilterText_1_K2Node_ComponentBoundEvent_20_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_AdminPanel_C_BndEvt__PlayerFilterText_1_K2Node_ComponentBoundEvent_20_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000010, "Wrong size on WBP_AdminPanel_C_BndEvt__PlayerFilterText_1_K2Node_ComponentBoundEvent_20_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_AdminPanel_C_BndEvt__PlayerFilterText_1_K2Node_ComponentBoundEvent_20_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_AdminPanel_C_BndEvt__PlayerFilterText_1_K2Node_ComponentBoundEvent_20_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_AdminPanel.WBP_AdminPanel_C.BndEvt__PlayerFilterText_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_AdminPanel_C_BndEvt__PlayerFilterText_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_AdminPanel_C_BndEvt__PlayerFilterText_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AdminPanel_C_BndEvt__PlayerFilterText_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_AdminPanel_C_BndEvt__PlayerFilterText_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000010, "Wrong size on WBP_AdminPanel_C_BndEvt__PlayerFilterText_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_AdminPanel_C_BndEvt__PlayerFilterText_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_AdminPanel_C_BndEvt__PlayerFilterText_K2Node_ComponentBoundEvent_5_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_AdminPanel.WBP_AdminPanel_C.BndEvt__RenderScaleText_1_K2Node_ComponentBoundEvent_13_OnEditableTextCommittedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_AdminPanel_C_BndEvt__RenderScaleText_1_K2Node_ComponentBoundEvent_13_OnEditableTextCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AdminPanel_C_BndEvt__RenderScaleText_1_K2Node_ComponentBoundEvent_13_OnEditableTextCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AdminPanel_C_BndEvt__RenderScaleText_1_K2Node_ComponentBoundEvent_13_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_AdminPanel_C_BndEvt__RenderScaleText_1_K2Node_ComponentBoundEvent_13_OnEditableTextCommittedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_AdminPanel_C_BndEvt__RenderScaleText_1_K2Node_ComponentBoundEvent_13_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_AdminPanel_C_BndEvt__RenderScaleText_1_K2Node_ComponentBoundEvent_13_OnEditableTextCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_AdminPanel_C_BndEvt__RenderScaleText_1_K2Node_ComponentBoundEvent_13_OnEditableTextCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_BndEvt__RenderScaleText_1_K2Node_ComponentBoundEvent_13_OnEditableTextCommittedEvent__DelegateSignature, CommitMethod) == 0x000010, "Member 'WBP_AdminPanel_C_BndEvt__RenderScaleText_1_K2Node_ComponentBoundEvent_13_OnEditableTextCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_AdminPanel.WBP_AdminPanel_C.BndEvt__WBP_AdminPanel_BansFilterName_K2Node_ComponentBoundEvent_24_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_BansFilterName_K2Node_ComponentBoundEvent_24_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_BansFilterName_K2Node_ComponentBoundEvent_24_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_BansFilterName_K2Node_ComponentBoundEvent_24_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_BansFilterName_K2Node_ComponentBoundEvent_24_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000010, "Wrong size on WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_BansFilterName_K2Node_ComponentBoundEvent_24_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_BansFilterName_K2Node_ComponentBoundEvent_24_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_BansFilterName_K2Node_ComponentBoundEvent_24_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_AdminPanel.WBP_AdminPanel_C.BndEvt__WBP_AdminPanel_BansFilterSteamId_K2Node_ComponentBoundEvent_27_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_BansFilterSteamId_K2Node_ComponentBoundEvent_27_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_BansFilterSteamId_K2Node_ComponentBoundEvent_27_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_BansFilterSteamId_K2Node_ComponentBoundEvent_27_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_BansFilterSteamId_K2Node_ComponentBoundEvent_27_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000010, "Wrong size on WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_BansFilterSteamId_K2Node_ComponentBoundEvent_27_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_BansFilterSteamId_K2Node_ComponentBoundEvent_27_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_BansFilterSteamId_K2Node_ComponentBoundEvent_27_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_AdminPanel.WBP_AdminPanel_C.BndEvt__WBP_AdminPanel_CoordinatesTextInput_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_CoordinatesTextInput_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_CoordinatesTextInput_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_CoordinatesTextInput_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_CoordinatesTextInput_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature) == 0x000010, "Wrong size on WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_CoordinatesTextInput_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_CoordinatesTextInput_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_CoordinatesTextInput_K2Node_ComponentBoundEvent_2_OnEditableTextChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_AdminPanel.WBP_AdminPanel_C.BndEvt__WBP_AdminPanel_LongitudeCoordinates_1_K2Node_ComponentBoundEvent_21_OnEditableTextChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_LongitudeCoordinates_1_K2Node_ComponentBoundEvent_21_OnEditableTextChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_LongitudeCoordinates_1_K2Node_ComponentBoundEvent_21_OnEditableTextChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_LongitudeCoordinates_1_K2Node_ComponentBoundEvent_21_OnEditableTextChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_LongitudeCoordinates_1_K2Node_ComponentBoundEvent_21_OnEditableTextChangedEvent__DelegateSignature) == 0x000010, "Wrong size on WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_LongitudeCoordinates_1_K2Node_ComponentBoundEvent_21_OnEditableTextChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_LongitudeCoordinates_1_K2Node_ComponentBoundEvent_21_OnEditableTextChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_LongitudeCoordinates_1_K2Node_ComponentBoundEvent_21_OnEditableTextChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_AdminPanel.WBP_AdminPanel_C.BndEvt__WBP_AdminPanel_ManualTimeOfDay_K2Node_ComponentBoundEvent_22_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_ManualTimeOfDay_K2Node_ComponentBoundEvent_22_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_ManualTimeOfDay_K2Node_ComponentBoundEvent_22_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_ManualTimeOfDay_K2Node_ComponentBoundEvent_22_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_ManualTimeOfDay_K2Node_ComponentBoundEvent_22_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000010, "Wrong size on WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_ManualTimeOfDay_K2Node_ComponentBoundEvent_22_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_ManualTimeOfDay_K2Node_ComponentBoundEvent_22_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_ManualTimeOfDay_K2Node_ComponentBoundEvent_22_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_AdminPanel.WBP_AdminPanel_C.BndEvt__WBP_AdminPanel_MultiLineEditableTextBox_244_K2Node_ComponentBoundEvent_3_OnMultiLineEditableTextBoxChangedEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_MultiLineEditableTextBox_244_K2Node_ComponentBoundEvent_3_OnMultiLineEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_MultiLineEditableTextBox_244_K2Node_ComponentBoundEvent_3_OnMultiLineEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_MultiLineEditableTextBox_244_K2Node_ComponentBoundEvent_3_OnMultiLineEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_MultiLineEditableTextBox_244_K2Node_ComponentBoundEvent_3_OnMultiLineEditableTextBoxChangedEvent__DelegateSignature) == 0x000010, "Wrong size on WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_MultiLineEditableTextBox_244_K2Node_ComponentBoundEvent_3_OnMultiLineEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_MultiLineEditableTextBox_244_K2Node_ComponentBoundEvent_3_OnMultiLineEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_MultiLineEditableTextBox_244_K2Node_ComponentBoundEvent_3_OnMultiLineEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_AdminPanel.WBP_AdminPanel_C.BndEvt__WBP_AdminPanel_WeatherOptions_K2Node_ComponentBoundEvent_29_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_WeatherOptions_K2Node_ComponentBoundEvent_29_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_WeatherOptions_K2Node_ComponentBoundEvent_29_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_WeatherOptions_K2Node_ComponentBoundEvent_29_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_WeatherOptions_K2Node_ComponentBoundEvent_29_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_WeatherOptions_K2Node_ComponentBoundEvent_29_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_WeatherOptions_K2Node_ComponentBoundEvent_29_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_WeatherOptions_K2Node_ComponentBoundEvent_29_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_WeatherOptions_K2Node_ComponentBoundEvent_29_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'WBP_AdminPanel_C_BndEvt__WBP_AdminPanel_WeatherOptions_K2Node_ComponentBoundEvent_29_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function WBP_AdminPanel.WBP_AdminPanel_C.ExecuteUbergraph_WBP_AdminPanel
// 0x08D8 (0x08D8 - 0x0000)
struct WBP_AdminPanel_C_ExecuteUbergraph_WBP_AdminPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_RemoveBan_C*                       CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerController_C*                 K2Node_DynamicCast_AsBP_Player_Controller;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_9;                 // 0x0090(0x0010)(ConstParm)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_RemoveBan_C*                       CallFunc_Create_ReturnValue_1;                     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value_1;                // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x00B8(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_StringToDouble_ReturnValue;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x00E8(0x0010)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_2;          // 0x00F8(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_1;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_2;        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_3;          // 0x0128(0x0010)()
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_3;        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text_8;                 // 0x0140(0x0010)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod_1;         // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_5;          // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_4;          // 0x0170(0x0010)()
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_4;        // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_5;          // 0x0188(0x0010)()
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_6;          // 0x01A0(0x0010)()
	class FText                                   K2Node_ComponentBoundEvent_Text_7;                 // 0x01B0(0x0010)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_6;          // 0x01C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_1;                   // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue_1;                  // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x01E8(0x0010)()
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_5;        // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_7;          // 0x0200(0x0010)()
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0220(0x0010)()
	class AUltra_Dynamic_Sky_C*                   CallFunc_GetActorOfClass_ReturnValue;              // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_bIsEditor_ReturnValue;                    // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerController_C*                 K2Node_DynamicCast_AsBP_Player_Controller_1;       // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0260(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue;                // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0288(0x0010)()
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_SurvivalGameState_C*                K2Node_DynamicCast_AsBP_Survival_Game_State;       // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue_1;              // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AB[0x1];                                      // 0x02AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_RemoveBan_C*                       CallFunc_Create_ReturnValue_2;                     // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text_6;                 // 0x02C0(0x0010)(ConstParm)
	class FText                                   K2Node_ComponentBoundEvent_Text_5;                 // 0x02D0(0x0010)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_7;          // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x02F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0308(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_6;        // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue_2;                  // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_4;                 // 0x0330(0x0010)(ConstParm)
	class FText                                   K2Node_ComponentBoundEvent_Text_3;                 // 0x0340(0x0010)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_8;          // 0x0350(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0360(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0370(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_9;          // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_7;        // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text_2;                 // 0x0398(0x0010)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_10;         // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue_8;        // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTIAvailableClassData                  CallFunc_Array_Get_Item;                           // 0x03C8(0x0038)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0404(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_405[0x3];                                      // 0x0405(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0408(0x0010)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x041C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0430(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEnabled;                       // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTIAvailableClassData                  K2Node_CustomEvent_ClassData;                      // 0x0440(0x0038)(ConstParm)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue_2;              // 0x047C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x047D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47E[0x2];                                      // 0x047E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTIAvailableClassData                  CallFunc_Array_Get_Item_1;                         // 0x0490(0x0038)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x04CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x04CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CE[0x2];                                      // 0x04CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FIPlayerBannedData>             K2Node_CustomEvent_BanList;                        // 0x04D8(0x0010)(ConstParm, ReferenceParm)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x04E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_11;         // 0x04F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0508(0x0010)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_12;         // 0x0518(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0528(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0538(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FIPlayerBannedData                     CallFunc_Array_Get_Item_2;                         // 0x0540(0x0060)()
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x05A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A5[0x3];                                      // 0x05A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIPlayerBannedData                     CallFunc_Array_Get_Item_3;                         // 0x05A8(0x0060)()
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x060C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x060D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60E[0x2];                                      // 0x060E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0610(0x0010)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_13;         // 0x0620(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_2;                   // 0x0630(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FIPlayerBannedData                     CallFunc_Array_Get_Item_4;                         // 0x0638(0x0060)()
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_699[0x3];                                      // 0x0699(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x069C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A1[0x3];                                      // 0x06A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x06A4(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x06DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue_3;              // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x06E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x06E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E3[0x5];                                      // 0x06E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x06E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_bIsEditor_ReturnValue_1;                  // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x06F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F2[0x6];                                      // 0x06F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIDinosaurBase*                        K2Node_DynamicCast_AsThe_Isle_Dinosaur_Base;       // 0x06F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_701[0x3];                                      // 0x0701(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGrowthTimePercentInMinutes_ReturnValue; // 0x0704(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetVisualGrowth_ReturnValue;              // 0x0708(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_70C[0x4];                                      // 0x070C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_8;          // 0x0710(0x0010)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_9;          // 0x0720(0x0010)()
	float                                         CallFunc_GetAttackPower_ReturnValue;               // 0x0730(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWeight_ReturnValue;                    // 0x0734(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_10;         // 0x0738(0x0010)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_11;         // 0x0748(0x0010)()
	float                                         CallFunc_GetGrowth_ReturnValue;                    // 0x0758(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75C[0x4];                                      // 0x075C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_12;         // 0x0768(0x0010)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_13;         // 0x0778(0x0010)()
	TDelegate<void(bool bIsAISpawningOn, bool bIsAIEventsOn)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0788(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0798(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue_1;               // 0x07A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance;             // 0x07A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x07B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B1[0x7];                                      // 0x07B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SurvivalGameState_C*                K2Node_DynamicCast_AsBP_Survival_Game_State_1;     // 0x07B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C1[0x3];                                      // 0x07C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x07C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x07C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_bIsEditor_ReturnValue_2;                  // 0x07CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x07CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsAdminCred_ReturnValue;               // 0x07CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsDevCred_ReturnValue;                 // 0x07CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_bIsEditor_ReturnValue_3;                  // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x07D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x07D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D3[0x5];                                      // 0x07D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x07D8(0x0010)()
	bool                                          CallFunc_GetIsAdminCred_ReturnValue_1;             // 0x07E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E9[0x7];                                      // 0x07E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlayerName_ReturnValue_1;              // 0x07F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsDevCred_ReturnValue_1;               // 0x0800(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_801[0x7];                                      // 0x0801(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0808(0x0010)()
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0818(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
