#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_GroupInvite

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_GroupInvite.WBP_HUD_GroupInvite_C
// 0x0018 (0x0310 - 0x02F8)
class UWBP_HUD_GroupInvite_C final : public UTIGroupNotification
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             MessageText;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MessageText_1;                                     // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_HUD_GroupInvite(int32 EntryPoint);
	class FText GetAdditionalText();
	class FText GetInviteText();
	void SetMessage(const class FString& Message);
	void Timeout();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_GroupInvite_C">();
	}
	static class UWBP_HUD_GroupInvite_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_GroupInvite_C>();
	}
};
static_assert(alignof(UWBP_HUD_GroupInvite_C) == 0x000008, "Wrong alignment on UWBP_HUD_GroupInvite_C");
static_assert(sizeof(UWBP_HUD_GroupInvite_C) == 0x000310, "Wrong size on UWBP_HUD_GroupInvite_C");
static_assert(offsetof(UWBP_HUD_GroupInvite_C, UberGraphFrame) == 0x0002F8, "Member 'UWBP_HUD_GroupInvite_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_GroupInvite_C, MessageText) == 0x000300, "Member 'UWBP_HUD_GroupInvite_C::MessageText' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_GroupInvite_C, MessageText_1) == 0x000308, "Member 'UWBP_HUD_GroupInvite_C::MessageText_1' has a wrong offset!");

}

