#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GraphicSettingSlider

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_GraphicSettingSlider.WBP_GraphicSettingSlider_C.BndEvt__RenderScaleText_K2Node_ComponentBoundEvent_2_OnEditableTextCommittedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_GraphicSettingSlider_C_BndEvt__RenderScaleText_K2Node_ComponentBoundEvent_2_OnEditableTextCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GraphicSettingSlider_C_BndEvt__RenderScaleText_K2Node_ComponentBoundEvent_2_OnEditableTextCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_GraphicSettingSlider_C_BndEvt__RenderScaleText_K2Node_ComponentBoundEvent_2_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_GraphicSettingSlider_C_BndEvt__RenderScaleText_K2Node_ComponentBoundEvent_2_OnEditableTextCommittedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_GraphicSettingSlider_C_BndEvt__RenderScaleText_K2Node_ComponentBoundEvent_2_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_GraphicSettingSlider_C_BndEvt__RenderScaleText_K2Node_ComponentBoundEvent_2_OnEditableTextCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_GraphicSettingSlider_C_BndEvt__RenderScaleText_K2Node_ComponentBoundEvent_2_OnEditableTextCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_GraphicSettingSlider_C_BndEvt__RenderScaleText_K2Node_ComponentBoundEvent_2_OnEditableTextCommittedEvent__DelegateSignature, CommitMethod) == 0x000010, "Member 'WBP_GraphicSettingSlider_C_BndEvt__RenderScaleText_K2Node_ComponentBoundEvent_2_OnEditableTextCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_GraphicSettingSlider.WBP_GraphicSettingSlider_C.BndEvt__Slider_290_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_GraphicSettingSlider_C_BndEvt__Slider_290_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GraphicSettingSlider_C_BndEvt__Slider_290_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_GraphicSettingSlider_C_BndEvt__Slider_290_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_GraphicSettingSlider_C_BndEvt__Slider_290_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_GraphicSettingSlider_C_BndEvt__Slider_290_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_GraphicSettingSlider_C_BndEvt__Slider_290_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'WBP_GraphicSettingSlider_C_BndEvt__Slider_290_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function WBP_GraphicSettingSlider.WBP_GraphicSettingSlider_C.ExecuteUbergraph_WBP_GraphicSettingSlider
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0010(0x0010)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_StringToDouble_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0068(0x0010)()
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0080(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FTrunc_A_ImplicitCast;                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast;            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FTrunc_A_ImplicitCast_1;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider) == 0x000008, "Wrong alignment on WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider");
static_assert(sizeof(WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider) == 0x0000B0, "Wrong size on WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider");
static_assert(offsetof(WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider, EntryPoint) == 0x000000, "Member 'WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider, K2Node_ComponentBoundEvent_Value) == 0x000008, "Member 'WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider, CallFunc_FTrunc_ReturnValue) == 0x00000C, "Member 'WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider, K2Node_ComponentBoundEvent_Text) == 0x000010, "Member 'WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider, K2Node_ComponentBoundEvent_CommitMethod) == 0x000020, "Member 'WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider, CallFunc_Conv_TextToString_ReturnValue) == 0x000038, "Member 'WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider, CallFunc_IsNumeric_ReturnValue) == 0x000048, "Member 'WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider::CallFunc_IsNumeric_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider, CallFunc_Conv_StringToDouble_ReturnValue) == 0x000050, "Member 'WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider::CallFunc_Conv_StringToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider, CallFunc_FClamp_ReturnValue) == 0x000058, "Member 'WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider, CallFunc_FTrunc_ReturnValue_1) == 0x000060, "Member 'WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000068, "Member 'WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider, CallFunc_GetValue_ReturnValue) == 0x000078, "Member 'WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider::CallFunc_GetValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider, CallFunc_FTrunc_ReturnValue_2) == 0x00007C, "Member 'WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000080, "Member 'WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider, CallFunc_FTrunc_A_ImplicitCast) == 0x000098, "Member 'WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider::CallFunc_FTrunc_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider, CallFunc_SetValue_InValue_ImplicitCast) == 0x0000A0, "Member 'WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider::CallFunc_SetValue_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider, CallFunc_FTrunc_A_ImplicitCast_1) == 0x0000A8, "Member 'WBP_GraphicSettingSlider_C_ExecuteUbergraph_WBP_GraphicSettingSlider::CallFunc_FTrunc_A_ImplicitCast_1' has a wrong offset!");

// Function WBP_GraphicSettingSlider.WBP_GraphicSettingSlider_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_GraphicSettingSlider_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GraphicSettingSlider_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_GraphicSettingSlider_C_PreConstruct");
static_assert(sizeof(WBP_GraphicSettingSlider_C_PreConstruct) == 0x000001, "Wrong size on WBP_GraphicSettingSlider_C_PreConstruct");
static_assert(offsetof(WBP_GraphicSettingSlider_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_GraphicSettingSlider_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

