#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ManualBan

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_ManualBan.WBP_ManualBan_C.BndEvt__WBP_Duration_K2Node_ComponentBoundEvent_3_OnTextChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_ManualBan_C_BndEvt__WBP_Duration_K2Node_ComponentBoundEvent_3_OnTextChanged__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ManualBan_C_BndEvt__WBP_Duration_K2Node_ComponentBoundEvent_3_OnTextChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ManualBan_C_BndEvt__WBP_Duration_K2Node_ComponentBoundEvent_3_OnTextChanged__DelegateSignature");
static_assert(sizeof(WBP_ManualBan_C_BndEvt__WBP_Duration_K2Node_ComponentBoundEvent_3_OnTextChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_ManualBan_C_BndEvt__WBP_Duration_K2Node_ComponentBoundEvent_3_OnTextChanged__DelegateSignature");
static_assert(offsetof(WBP_ManualBan_C_BndEvt__WBP_Duration_K2Node_ComponentBoundEvent_3_OnTextChanged__DelegateSignature, Text) == 0x000000, "Member 'WBP_ManualBan_C_BndEvt__WBP_Duration_K2Node_ComponentBoundEvent_3_OnTextChanged__DelegateSignature::Text' has a wrong offset!");

// Function WBP_ManualBan.WBP_ManualBan_C.BndEvt__WBP_SteamID_K2Node_ComponentBoundEvent_2_OnTextChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_ManualBan_C_BndEvt__WBP_SteamID_K2Node_ComponentBoundEvent_2_OnTextChanged__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ManualBan_C_BndEvt__WBP_SteamID_K2Node_ComponentBoundEvent_2_OnTextChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ManualBan_C_BndEvt__WBP_SteamID_K2Node_ComponentBoundEvent_2_OnTextChanged__DelegateSignature");
static_assert(sizeof(WBP_ManualBan_C_BndEvt__WBP_SteamID_K2Node_ComponentBoundEvent_2_OnTextChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_ManualBan_C_BndEvt__WBP_SteamID_K2Node_ComponentBoundEvent_2_OnTextChanged__DelegateSignature");
static_assert(offsetof(WBP_ManualBan_C_BndEvt__WBP_SteamID_K2Node_ComponentBoundEvent_2_OnTextChanged__DelegateSignature, Text) == 0x000000, "Member 'WBP_ManualBan_C_BndEvt__WBP_SteamID_K2Node_ComponentBoundEvent_2_OnTextChanged__DelegateSignature::Text' has a wrong offset!");

// Function WBP_ManualBan.WBP_ManualBan_C.ExecuteUbergraph_WBP_ManualBan
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerController_C*                 K2Node_DynamicCast_AsBP_Player_Controller;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0060(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0088(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNumeric_ReturnValue_1;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan) == 0x000008, "Wrong alignment on WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan");
static_assert(sizeof(WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan) == 0x0000B0, "Wrong size on WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan");
static_assert(offsetof(WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan, EntryPoint) == 0x000000, "Member 'WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan, K2Node_DynamicCast_AsBP_Player_Controller) == 0x000010, "Member 'WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan::K2Node_DynamicCast_AsBP_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan, CallFunc_Conv_TextToString_ReturnValue) == 0x000020, "Member 'WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000030, "Member 'WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan, CallFunc_Conv_StringToDouble_ReturnValue) == 0x000040, "Member 'WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan::CallFunc_Conv_StringToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan, CallFunc_Len_ReturnValue) == 0x000048, "Member 'WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x00004C, "Member 'WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00004D, "Member 'WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan, CallFunc_BooleanAND_ReturnValue) == 0x00004E, "Member 'WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000050, "Member 'WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan, K2Node_ComponentBoundEvent_Text_1) == 0x000060, "Member 'WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan, CallFunc_Conv_TextToString_ReturnValue_3) == 0x000070, "Member 'WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan, CallFunc_IsNumeric_ReturnValue) == 0x000080, "Member 'WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan::CallFunc_IsNumeric_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan, K2Node_ComponentBoundEvent_Text) == 0x000088, "Member 'WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan, CallFunc_Conv_TextToString_ReturnValue_4) == 0x000098, "Member 'WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan::CallFunc_Conv_TextToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan, CallFunc_IsNumeric_ReturnValue_1) == 0x0000A8, "Member 'WBP_ManualBan_C_ExecuteUbergraph_WBP_ManualBan::CallFunc_IsNumeric_ReturnValue_1' has a wrong offset!");

}

