#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DietSource

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "TheIsle_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DietSource.WBP_DietSource_C
// 0x0038 (0x0318 - 0x02E0)
class UWBP_DietSource_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Icon;                                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ETINutrientType                               Nutrient;                                          // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Description;                                       // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bGiveAllNutrients;                                 // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_DietSource(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DietSource_C">();
	}
	static class UWBP_DietSource_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DietSource_C>();
	}
};
static_assert(alignof(UWBP_DietSource_C) == 0x000008, "Wrong alignment on UWBP_DietSource_C");
static_assert(sizeof(UWBP_DietSource_C) == 0x000318, "Wrong size on UWBP_DietSource_C");
static_assert(offsetof(UWBP_DietSource_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_DietSource_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DietSource_C, Icon) == 0x0002E8, "Member 'UWBP_DietSource_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_DietSource_C, Text) == 0x0002F0, "Member 'UWBP_DietSource_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_DietSource_C, Nutrient) == 0x0002F8, "Member 'UWBP_DietSource_C::Nutrient' has a wrong offset!");
static_assert(offsetof(UWBP_DietSource_C, Description) == 0x000300, "Member 'UWBP_DietSource_C::Description' has a wrong offset!");
static_assert(offsetof(UWBP_DietSource_C, bGiveAllNutrients) == 0x000310, "Member 'UWBP_DietSource_C::bGiveAllNutrients' has a wrong offset!");

}

