#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MyDinosaurProfile

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "TheIsle_structs.hpp"
#include "S_FoodLocationsByClass_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "S_ProfileCharacterClasses_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_MyDinosaurProfile.WBP_MyDinosaurProfile_C.AddGroupJoinRequest
// 0x0020 (0x0020 - 0x0000)
struct WBP_MyDinosaurProfile_C_AddGroupJoinRequest final
{
public:
	class FString                                 NameOfRequester;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 RequesterSteamID;                                  // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MyDinosaurProfile_C_AddGroupJoinRequest) == 0x000008, "Wrong alignment on WBP_MyDinosaurProfile_C_AddGroupJoinRequest");
static_assert(sizeof(WBP_MyDinosaurProfile_C_AddGroupJoinRequest) == 0x000020, "Wrong size on WBP_MyDinosaurProfile_C_AddGroupJoinRequest");
static_assert(offsetof(WBP_MyDinosaurProfile_C_AddGroupJoinRequest, NameOfRequester) == 0x000000, "Member 'WBP_MyDinosaurProfile_C_AddGroupJoinRequest::NameOfRequester' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_AddGroupJoinRequest, RequesterSteamID) == 0x000010, "Member 'WBP_MyDinosaurProfile_C_AddGroupJoinRequest::RequesterSteamID' has a wrong offset!");

// Function WBP_MyDinosaurProfile.WBP_MyDinosaurProfile_C.BleedResistBoost
// 0x01D0 (0x01D0 - 0x0000)
struct WBP_MyDinosaurProfile_C_BleedResistBoost final
{
public:
	class FText                                   Result;                                            // 0x0000(0x0010)(Parm, OutParm)
	class FText                                   TextReturn;                                        // 0x0010(0x0010)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0028(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0038(0x0010)()
	float                                         CallFunc_GetMaxHunger_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxHunger_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_2;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x00B8(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x00C8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00D8(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0120(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0168(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0180(0x0010)()
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_1;        // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast_1;     // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast_1;        // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast_2;        // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MyDinosaurProfile_C_BleedResistBoost) == 0x000008, "Wrong alignment on WBP_MyDinosaurProfile_C_BleedResistBoost");
static_assert(sizeof(WBP_MyDinosaurProfile_C_BleedResistBoost) == 0x0001D0, "Wrong size on WBP_MyDinosaurProfile_C_BleedResistBoost");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, Result) == 0x000000, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::Result' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, TextReturn) == 0x000010, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::TextReturn' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, Temp_bool_Variable) == 0x000020, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, Temp_text_Variable) == 0x000028, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, Temp_text_Variable_1) == 0x000038, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_GetMaxHunger_ReturnValue) == 0x000048, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_GetMaxHunger_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x00004C, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_GetMaxHunger_ReturnValue_1) == 0x000050, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_GetMaxHunger_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000058, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000060, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000068, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_Add_DoubleDouble_ReturnValue_2) == 0x000070, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_Add_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000078, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000080, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_FClamp_ReturnValue) == 0x000088, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x000090, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_FClamp_ReturnValue_1) == 0x000098, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_SelectFloat_ReturnValue) == 0x0000A0, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000B0, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_Conv_DoubleToText_ReturnValue) == 0x0000B8, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, K2Node_Select_Default) == 0x0000C8, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, K2Node_MakeStruct_FormatArgumentData) == 0x0000D8, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, K2Node_MakeStruct_FormatArgumentData_1) == 0x000120, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, K2Node_MakeArray_Array) == 0x000168, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000178, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_Format_ReturnValue) == 0x000180, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x000190, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_BooleanOR_ReturnValue) == 0x000191, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000198, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x0001A0, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x0001A8, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_Add_DoubleDouble_B_ImplicitCast_1) == 0x0001B0, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_Add_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_Divide_DoubleDouble_B_ImplicitCast_1) == 0x0001B8, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_Divide_DoubleDouble_B_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_Add_DoubleDouble_A_ImplicitCast_1) == 0x0001C0, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_Add_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BleedResistBoost, CallFunc_Add_DoubleDouble_B_ImplicitCast_2) == 0x0001C8, "Member 'WBP_MyDinosaurProfile_C_BleedResistBoost::CallFunc_Add_DoubleDouble_B_ImplicitCast_2' has a wrong offset!");

// Function WBP_MyDinosaurProfile.WBP_MyDinosaurProfile_C.BloodRegenBoost
// 0x0180 (0x0180 - 0x0000)
struct WBP_MyDinosaurProfile_C_BloodRegenBoost final
{
public:
	class FText                                   Result;                                            // 0x0000(0x0010)(Parm, OutParm)
	class FText                                   TextReturn;                                        // 0x0010(0x0010)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0028(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0038(0x0010)()
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0068(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0078(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_4;          // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_5;          // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_6;          // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxHunger_ReturnValue;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x00F8(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0108(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0150(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0160(0x0010)()
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MyDinosaurProfile_C_BloodRegenBoost) == 0x000008, "Wrong alignment on WBP_MyDinosaurProfile_C_BloodRegenBoost");
static_assert(sizeof(WBP_MyDinosaurProfile_C_BloodRegenBoost) == 0x000180, "Wrong size on WBP_MyDinosaurProfile_C_BloodRegenBoost");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, Result) == 0x000000, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::Result' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, TextReturn) == 0x000010, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::TextReturn' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, Temp_bool_Variable) == 0x000020, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, Temp_text_Variable) == 0x000028, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, Temp_text_Variable_1) == 0x000038, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000048, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x000049, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, CallFunc_SelectFloat_ReturnValue) == 0x000050, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x000058, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, CallFunc_BooleanOR_ReturnValue) == 0x000059, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x00005A, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, CallFunc_SelectFloat_ReturnValue_1) == 0x000060, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, K2Node_Select_Default) == 0x000068, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, K2Node_MakeStruct_FormatArgumentData) == 0x000078, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, CallFunc_EqualEqual_StrStr_ReturnValue_3) == 0x0000C0, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::CallFunc_EqualEqual_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, CallFunc_EqualEqual_StrStr_ReturnValue_4) == 0x0000C1, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::CallFunc_EqualEqual_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, CallFunc_EqualEqual_StrStr_ReturnValue_5) == 0x0000C2, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::CallFunc_EqualEqual_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, CallFunc_EqualEqual_StrStr_ReturnValue_6) == 0x0000C3, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::CallFunc_EqualEqual_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, CallFunc_BooleanOR_ReturnValue_1) == 0x0000C4, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, CallFunc_GetMaxHunger_ReturnValue) == 0x0000C8, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::CallFunc_GetMaxHunger_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, CallFunc_BooleanOR_ReturnValue_2) == 0x0000CC, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, CallFunc_BooleanOR_ReturnValue_3) == 0x0000CD, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0000D0, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x0000D8, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000E0, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, CallFunc_FClamp_ReturnValue) == 0x0000E8, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000F0, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, CallFunc_Conv_DoubleToText_ReturnValue) == 0x0000F8, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, K2Node_MakeStruct_FormatArgumentData_1) == 0x000108, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, K2Node_MakeArray_Array) == 0x000150, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, CallFunc_Format_ReturnValue) == 0x000160, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000170, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BloodRegenBoost, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000178, "Member 'WBP_MyDinosaurProfile_C_BloodRegenBoost::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_MyDinosaurProfile.WBP_MyDinosaurProfile_C.BndEvt__CheckBox_GroupInvites_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_MyDinosaurProfile_C_BndEvt__CheckBox_GroupInvites_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MyDinosaurProfile_C_BndEvt__CheckBox_GroupInvites_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_MyDinosaurProfile_C_BndEvt__CheckBox_GroupInvites_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_MyDinosaurProfile_C_BndEvt__CheckBox_GroupInvites_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_MyDinosaurProfile_C_BndEvt__CheckBox_GroupInvites_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BndEvt__CheckBox_GroupInvites_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_MyDinosaurProfile_C_BndEvt__CheckBox_GroupInvites_K2Node_ComponentBoundEvent_2_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_MyDinosaurProfile.WBP_MyDinosaurProfile_C.BndEvt__CheckBox_Nametags_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_MyDinosaurProfile_C_BndEvt__CheckBox_Nametags_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature final
{
public:
	bool                                          bIsChecked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MyDinosaurProfile_C_BndEvt__CheckBox_Nametags_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_MyDinosaurProfile_C_BndEvt__CheckBox_Nametags_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(sizeof(WBP_MyDinosaurProfile_C_BndEvt__CheckBox_Nametags_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_MyDinosaurProfile_C_BndEvt__CheckBox_Nametags_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature");
static_assert(offsetof(WBP_MyDinosaurProfile_C_BndEvt__CheckBox_Nametags_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature, bIsChecked) == 0x000000, "Member 'WBP_MyDinosaurProfile_C_BndEvt__CheckBox_Nametags_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature::bIsChecked' has a wrong offset!");

// Function WBP_MyDinosaurProfile.WBP_MyDinosaurProfile_C.DemoteTeamMember
// 0x0010 (0x0010 - 0x0000)
struct WBP_MyDinosaurProfile_C_DemoteTeamMember final
{
public:
	class FString                                 SteamIdToDemote;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MyDinosaurProfile_C_DemoteTeamMember) == 0x000008, "Wrong alignment on WBP_MyDinosaurProfile_C_DemoteTeamMember");
static_assert(sizeof(WBP_MyDinosaurProfile_C_DemoteTeamMember) == 0x000010, "Wrong size on WBP_MyDinosaurProfile_C_DemoteTeamMember");
static_assert(offsetof(WBP_MyDinosaurProfile_C_DemoteTeamMember, SteamIdToDemote) == 0x000000, "Member 'WBP_MyDinosaurProfile_C_DemoteTeamMember::SteamIdToDemote' has a wrong offset!");

// Function WBP_MyDinosaurProfile.WBP_MyDinosaurProfile_C.EggEncubationSpeedBoost
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost final
{
public:
	class FText                                   Result;                                            // 0x0000(0x0010)(Parm, OutParm)
	class FText                                   TextReturn;                                        // 0x0010(0x0010)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0028(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0038(0x0010)()
	bool                                          Temp_bool_Variable_1;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0050(0x0010)()
	class FText                                   Temp_text_Variable_3;                              // 0x0060(0x0010)()
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0080(0x0010)()
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0098(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x00E0(0x0010)()
	class FText                                   K2Node_Select_Default_1;                           // 0x00F0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0100(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0148(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0190(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01A0(0x0010)()
};
static_assert(alignof(WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost) == 0x000008, "Wrong alignment on WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost");
static_assert(sizeof(WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost) == 0x0001B0, "Wrong size on WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost");
static_assert(offsetof(WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost, Result) == 0x000000, "Member 'WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost::Result' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost, TextReturn) == 0x000010, "Member 'WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost::TextReturn' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost, Temp_bool_Variable) == 0x000020, "Member 'WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost, Temp_text_Variable) == 0x000028, "Member 'WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost, Temp_text_Variable_1) == 0x000038, "Member 'WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost, Temp_bool_Variable_1) == 0x000048, "Member 'WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost, Temp_text_Variable_2) == 0x000050, "Member 'WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost, Temp_text_Variable_3) == 0x000060, "Member 'WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000070, "Member 'WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000078, "Member 'WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000079, "Member 'WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost, K2Node_Select_Default) == 0x000080, "Member 'WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000090, "Member 'WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost, K2Node_MakeStruct_FormatArgumentData) == 0x000098, "Member 'WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost, CallFunc_Conv_DoubleToText_ReturnValue) == 0x0000E0, "Member 'WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost, K2Node_Select_Default_1) == 0x0000F0, "Member 'WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost, K2Node_MakeStruct_FormatArgumentData_1) == 0x000100, "Member 'WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost, K2Node_MakeStruct_FormatArgumentData_2) == 0x000148, "Member 'WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost, K2Node_MakeArray_Array) == 0x000190, "Member 'WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost, CallFunc_Format_ReturnValue) == 0x0001A0, "Member 'WBP_MyDinosaurProfile_C_EggEncubationSpeedBoost::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_MyDinosaurProfile.WBP_MyDinosaurProfile_C.ExecuteUbergraph_WBP_MyDinosaurProfile
// 0x1618 (0x1618 - 0x0000)
struct WBP_MyDinosaurProfile_C_ExecuteUbergraph_WBP_MyDinosaurProfile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PerkSlot_C*                        CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PerkSlot_C*                        CallFunc_Create_ReturnValue_1;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PerkSlot_C*                        CallFunc_Create_ReturnValue_2;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F[0x1];                                       // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GroupMemberRequester_C*            CallFunc_Create_ReturnValue_3;                     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PerkSlot_C*                        CallFunc_Create_ReturnValue_4;                     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_7;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_8;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTINestJoinRequest>             CallFunc_GetEggJoinRequests_ReturnValue;           // 0x00C0(0x0010)(ConstParm, ReferenceParm)
	TArray<bool>                                  CallFunc_GetEggsPrivate_ReturnValue;               // 0x00D0(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FTIEgg>                         CallFunc_GetEggs_ReturnValue;                      // 0x00E0(0x0010)(ConstParm, ReferenceParm)
	uint8                                         CallFunc_GetEggClutchSize_ReturnValue;             // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanGestateEggs_ReturnValue;               // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFemale_ReturnValue;                     // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFemale_ReturnValue_1;                   // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FF[0x1];                                       // 0x00FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGrowthFromJuvenileToAdult_ReturnValue; // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0104(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0143(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAbilityState                                 CallFunc_GetAbilityState_ReturnValue;              // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15B[0x5];                                      // 0x015B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomizerDataBase                    CallFunc_GetCustomizerData_ReturnValue;            // 0x0160(0x0098)(ConstParm)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0200(0x0010)()
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute_1; // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
