#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_JoinServer

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_JoinServer.WBP_JoinServer_C.ExecuteUbergraph_WBP_JoinServer
// 0x0038 (0x0038 - 0x0000)
struct WBP_JoinServer_C_ExecuteUbergraph_WBP_JoinServer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bHighlight;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float PingTime)>               K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_JoinServer_C_ExecuteUbergraph_WBP_JoinServer) == 0x000008, "Wrong alignment on WBP_JoinServer_C_ExecuteUbergraph_WBP_JoinServer");
static_assert(sizeof(WBP_JoinServer_C_ExecuteUbergraph_WBP_JoinServer) == 0x000038, "Wrong size on WBP_JoinServer_C_ExecuteUbergraph_WBP_JoinServer");
static_assert(offsetof(WBP_JoinServer_C_ExecuteUbergraph_WBP_JoinServer, EntryPoint) == 0x000000, "Member 'WBP_JoinServer_C_ExecuteUbergraph_WBP_JoinServer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_JoinServer_C_ExecuteUbergraph_WBP_JoinServer, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_JoinServer_C_ExecuteUbergraph_WBP_JoinServer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_JoinServer_C_ExecuteUbergraph_WBP_JoinServer, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'WBP_JoinServer_C_ExecuteUbergraph_WBP_JoinServer::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JoinServer_C_ExecuteUbergraph_WBP_JoinServer, K2Node_CustomEvent_bHighlight) == 0x000020, "Member 'WBP_JoinServer_C_ExecuteUbergraph_WBP_JoinServer::K2Node_CustomEvent_bHighlight' has a wrong offset!");
static_assert(offsetof(WBP_JoinServer_C_ExecuteUbergraph_WBP_JoinServer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'WBP_JoinServer_C_ExecuteUbergraph_WBP_JoinServer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function WBP_JoinServer.WBP_JoinServer_C.Get_Favourite_Visibility_0
// 0x0001 (0x0001 - 0x0000)
struct WBP_JoinServer_C_Get_Favourite_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_JoinServer_C_Get_Favourite_Visibility_0) == 0x000001, "Wrong alignment on WBP_JoinServer_C_Get_Favourite_Visibility_0");
static_assert(sizeof(WBP_JoinServer_C_Get_Favourite_Visibility_0) == 0x000001, "Wrong size on WBP_JoinServer_C_Get_Favourite_Visibility_0");
static_assert(offsetof(WBP_JoinServer_C_Get_Favourite_Visibility_0, ReturnValue) == 0x000000, "Member 'WBP_JoinServer_C_Get_Favourite_Visibility_0::ReturnValue' has a wrong offset!");

// Function WBP_JoinServer.WBP_JoinServer_C.Get_SecureRow_Visibility_0
// 0x0001 (0x0001 - 0x0000)
struct WBP_JoinServer_C_Get_SecureRow_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_JoinServer_C_Get_SecureRow_Visibility_0) == 0x000001, "Wrong alignment on WBP_JoinServer_C_Get_SecureRow_Visibility_0");
static_assert(sizeof(WBP_JoinServer_C_Get_SecureRow_Visibility_0) == 0x000001, "Wrong size on WBP_JoinServer_C_Get_SecureRow_Visibility_0");
static_assert(offsetof(WBP_JoinServer_C_Get_SecureRow_Visibility_0, ReturnValue) == 0x000000, "Member 'WBP_JoinServer_C_Get_SecureRow_Visibility_0::ReturnValue' has a wrong offset!");

// Function WBP_JoinServer.WBP_JoinServer_C.GetColorAndOpacity_0
// 0x0038 (0x0038 - 0x0000)
struct WBP_JoinServer_C_GetColorAndOpacity_0 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0014)(Parm, OutParm, ReturnParm)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0024(0x0014)()
};
static_assert(alignof(WBP_JoinServer_C_GetColorAndOpacity_0) == 0x000004, "Wrong alignment on WBP_JoinServer_C_GetColorAndOpacity_0");
static_assert(sizeof(WBP_JoinServer_C_GetColorAndOpacity_0) == 0x000038, "Wrong size on WBP_JoinServer_C_GetColorAndOpacity_0");
static_assert(offsetof(WBP_JoinServer_C_GetColorAndOpacity_0, ReturnValue) == 0x000000, "Member 'WBP_JoinServer_C_GetColorAndOpacity_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JoinServer_C_GetColorAndOpacity_0, CallFunc_SelectColor_ReturnValue) == 0x000014, "Member 'WBP_JoinServer_C_GetColorAndOpacity_0::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JoinServer_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor) == 0x000024, "Member 'WBP_JoinServer_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WBP_JoinServer.WBP_JoinServer_C.HighlightServer
// 0x0001 (0x0001 - 0x0000)
struct WBP_JoinServer_C_HighlightServer final
{
public:
	bool                                          bHighlight;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_JoinServer_C_HighlightServer) == 0x000001, "Wrong alignment on WBP_JoinServer_C_HighlightServer");
static_assert(sizeof(WBP_JoinServer_C_HighlightServer) == 0x000001, "Wrong size on WBP_JoinServer_C_HighlightServer");
static_assert(offsetof(WBP_JoinServer_C_HighlightServer, bHighlight) == 0x000000, "Member 'WBP_JoinServer_C_HighlightServer::bHighlight' has a wrong offset!");

// Function WBP_JoinServer.WBP_JoinServer_C.Update Data
// 0x0040 (0x0040 - 0x0000)
struct WBP_JoinServer_C_Update_Data final
{
public:
	class FString                                 ServerVersion;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Desc;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0010)()
	int32                                         CallFunc_GetCurrentPlayers_ReturnValue;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxPlayers_ReturnValue;                // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_JoinServer_C_Update_Data) == 0x000008, "Wrong alignment on WBP_JoinServer_C_Update_Data");
static_assert(sizeof(WBP_JoinServer_C_Update_Data) == 0x000040, "Wrong size on WBP_JoinServer_C_Update_Data");
static_assert(offsetof(WBP_JoinServer_C_Update_Data, ServerVersion) == 0x000000, "Member 'WBP_JoinServer_C_Update_Data::ServerVersion' has a wrong offset!");
static_assert(offsetof(WBP_JoinServer_C_Update_Data, Desc) == 0x000010, "Member 'WBP_JoinServer_C_Update_Data::Desc' has a wrong offset!");
static_assert(offsetof(WBP_JoinServer_C_Update_Data, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'WBP_JoinServer_C_Update_Data::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JoinServer_C_Update_Data, CallFunc_GetCurrentPlayers_ReturnValue) == 0x000030, "Member 'WBP_JoinServer_C_Update_Data::CallFunc_GetCurrentPlayers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JoinServer_C_Update_Data, CallFunc_GetMaxPlayers_ReturnValue) == 0x000034, "Member 'WBP_JoinServer_C_Update_Data::CallFunc_GetMaxPlayers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JoinServer_C_Update_Data, CallFunc_Subtract_IntInt_ReturnValue) == 0x000038, "Member 'WBP_JoinServer_C_Update_Data::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_JoinServer.WBP_JoinServer_C.WBP_JoinServer_AutoGenFunc
// 0x0020 (0x0020 - 0x0000)
struct WBP_JoinServer_C_WBP_JoinServer_AutoGenFunc final
{
public:
	float                                         PingTime;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_IntFloat_B_ImplicitCast;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_JoinServer_C_WBP_JoinServer_AutoGenFunc) == 0x000008, "Wrong alignment on WBP_JoinServer_C_WBP_JoinServer_AutoGenFunc");
static_assert(sizeof(WBP_JoinServer_C_WBP_JoinServer_AutoGenFunc) == 0x000020, "Wrong size on WBP_JoinServer_C_WBP_JoinServer_AutoGenFunc");
static_assert(offsetof(WBP_JoinServer_C_WBP_JoinServer_AutoGenFunc, PingTime) == 0x000000, "Member 'WBP_JoinServer_C_WBP_JoinServer_AutoGenFunc::PingTime' has a wrong offset!");
static_assert(offsetof(WBP_JoinServer_C_WBP_JoinServer_AutoGenFunc, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000008, "Member 'WBP_JoinServer_C_WBP_JoinServer_AutoGenFunc::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JoinServer_C_WBP_JoinServer_AutoGenFunc, CallFunc_FTrunc_ReturnValue) == 0x000010, "Member 'WBP_JoinServer_C_WBP_JoinServer_AutoGenFunc::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_JoinServer_C_WBP_JoinServer_AutoGenFunc, CallFunc_Multiply_IntFloat_B_ImplicitCast) == 0x000018, "Member 'WBP_JoinServer_C_WBP_JoinServer_AutoGenFunc::CallFunc_Multiply_IntFloat_B_ImplicitCast' has a wrong offset!");

}

