#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterSelect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CharacterSelect.WBP_CharacterSelect_C
// 0x0140 (0x0420 - 0x02E0)
class UWBP_CharacterSelect_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CodeFades;                                         // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Black;                                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Cancel;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Confirm;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Female;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Help;                                       // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Male;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Nest;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_SkinLeft;                                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_SkinRight;                                  // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonBG;                                          // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              Checkbox_SkipGrowth;                               // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DNAscroll;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HighlightF;                                        // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HighlightM;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LowerFade;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Overlay;                                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RedGlowL;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                RenderImageBorder;                                 // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScreenBorder;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_Dinosaurs;                               // 0x0390(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollBoxBG;                                       // 0x0398(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollDarken;                                      // 0x03A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SlidersBG;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Gender;                                       // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_SkipGrowth;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UpperFade;                                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DinoSelectSlot_C*                  WBP_DinoSelectSlot;                                // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_UMG_Dossier_C*                      DossierUMG;                                        // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              EventCancel;                                       // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_FactionSelect_C*                   OwnerWidget;                                       // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     GameInstanceRef;                                   // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   BlankRef;                                          // 0x03F8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)

public:
	void BndEvt__Button_Female_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__Button_Male_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_CharacterSelect_Button_Cancel_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_CharacterSelect_Button_Confirm_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_CharacterSelect(int32 EntryPoint);
	class FText Get_Text_Gender_Text_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CharacterSelect_C">();
	}
	static class UWBP_CharacterSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CharacterSelect_C>();
	}
};
static_assert(alignof(UWBP_CharacterSelect_C) == 0x000008, "Wrong alignment on UWBP_CharacterSelect_C");
static_assert(sizeof(UWBP_CharacterSelect_C) == 0x000420, "Wrong size on UWBP_CharacterSelect_C");
static_assert(offsetof(UWBP_CharacterSelect_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_CharacterSelect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, CodeFades) == 0x0002E8, "Member 'UWBP_CharacterSelect_C::CodeFades' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, FadeIn) == 0x0002F0, "Member 'UWBP_CharacterSelect_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, Black) == 0x0002F8, "Member 'UWBP_CharacterSelect_C::Black' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, Button_Cancel) == 0x000300, "Member 'UWBP_CharacterSelect_C::Button_Cancel' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, Button_Confirm) == 0x000308, "Member 'UWBP_CharacterSelect_C::Button_Confirm' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, Button_Female) == 0x000310, "Member 'UWBP_CharacterSelect_C::Button_Female' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, Button_Help) == 0x000318, "Member 'UWBP_CharacterSelect_C::Button_Help' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, Button_Male) == 0x000320, "Member 'UWBP_CharacterSelect_C::Button_Male' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, Button_Nest) == 0x000328, "Member 'UWBP_CharacterSelect_C::Button_Nest' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, Button_SkinLeft) == 0x000330, "Member 'UWBP_CharacterSelect_C::Button_SkinLeft' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, Button_SkinRight) == 0x000338, "Member 'UWBP_CharacterSelect_C::Button_SkinRight' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, ButtonBG) == 0x000340, "Member 'UWBP_CharacterSelect_C::ButtonBG' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, Checkbox_SkipGrowth) == 0x000348, "Member 'UWBP_CharacterSelect_C::Checkbox_SkipGrowth' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, DNAscroll) == 0x000350, "Member 'UWBP_CharacterSelect_C::DNAscroll' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, HighlightF) == 0x000358, "Member 'UWBP_CharacterSelect_C::HighlightF' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, HighlightM) == 0x000360, "Member 'UWBP_CharacterSelect_C::HighlightM' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, LowerFade) == 0x000368, "Member 'UWBP_CharacterSelect_C::LowerFade' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, Overlay) == 0x000370, "Member 'UWBP_CharacterSelect_C::Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, RedGlowL) == 0x000378, "Member 'UWBP_CharacterSelect_C::RedGlowL' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, RenderImageBorder) == 0x000380, "Member 'UWBP_CharacterSelect_C::RenderImageBorder' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, ScreenBorder) == 0x000388, "Member 'UWBP_CharacterSelect_C::ScreenBorder' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, ScrollBox_Dinosaurs) == 0x000390, "Member 'UWBP_CharacterSelect_C::ScrollBox_Dinosaurs' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, ScrollBoxBG) == 0x000398, "Member 'UWBP_CharacterSelect_C::ScrollBoxBG' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, ScrollDarken) == 0x0003A0, "Member 'UWBP_CharacterSelect_C::ScrollDarken' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, SlidersBG) == 0x0003A8, "Member 'UWBP_CharacterSelect_C::SlidersBG' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, Text_Gender) == 0x0003B0, "Member 'UWBP_CharacterSelect_C::Text_Gender' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, Text_SkipGrowth) == 0x0003B8, "Member 'UWBP_CharacterSelect_C::Text_SkipGrowth' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, UpperFade) == 0x0003C0, "Member 'UWBP_CharacterSelect_C::UpperFade' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, WBP_DinoSelectSlot) == 0x0003C8, "Member 'UWBP_CharacterSelect_C::WBP_DinoSelectSlot' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, DossierUMG) == 0x0003D0, "Member 'UWBP_CharacterSelect_C::DossierUMG' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, EventCancel) == 0x0003D8, "Member 'UWBP_CharacterSelect_C::EventCancel' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, OwnerWidget) == 0x0003E8, "Member 'UWBP_CharacterSelect_C::OwnerWidget' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, GameInstanceRef) == 0x0003F0, "Member 'UWBP_CharacterSelect_C::GameInstanceRef' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterSelect_C, BlankRef) == 0x0003F8, "Member 'UWBP_CharacterSelect_C::BlankRef' has a wrong offset!");

}

