#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterSelectItem

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CharacterSelectItem.WBP_CharacterSelectItem_C.ExecuteUbergraph_WBP_CharacterSelectItem
// 0x0020 (0x0020 - 0x0000)
struct WBP_CharacterSelectItem_C_ExecuteUbergraph_WBP_CharacterSelectItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelectItem_C_ExecuteUbergraph_WBP_CharacterSelectItem) == 0x000008, "Wrong alignment on WBP_CharacterSelectItem_C_ExecuteUbergraph_WBP_CharacterSelectItem");
static_assert(sizeof(WBP_CharacterSelectItem_C_ExecuteUbergraph_WBP_CharacterSelectItem) == 0x000020, "Wrong size on WBP_CharacterSelectItem_C_ExecuteUbergraph_WBP_CharacterSelectItem");
static_assert(offsetof(WBP_CharacterSelectItem_C_ExecuteUbergraph_WBP_CharacterSelectItem, EntryPoint) == 0x000000, "Member 'WBP_CharacterSelectItem_C_ExecuteUbergraph_WBP_CharacterSelectItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectItem_C_ExecuteUbergraph_WBP_CharacterSelectItem, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'WBP_CharacterSelectItem_C_ExecuteUbergraph_WBP_CharacterSelectItem::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectItem_C_ExecuteUbergraph_WBP_CharacterSelectItem, K2Node_DynamicCast_AsBP_Game_Instance) == 0x000010, "Member 'WBP_CharacterSelectItem_C_ExecuteUbergraph_WBP_CharacterSelectItem::K2Node_DynamicCast_AsBP_Game_Instance' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelectItem_C_ExecuteUbergraph_WBP_CharacterSelectItem, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_CharacterSelectItem_C_ExecuteUbergraph_WBP_CharacterSelectItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

