#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GroupMember

#include "Basic.hpp"

#include "TheIsle_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GroupMember.WBP_GroupMember_C
// 0x0140 (0x0420 - 0x02E0)
class UWBP_GroupMember_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background_Name;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_81;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Kick;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               GiveLeaderBox;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                GiveLeaderButton;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Admin;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Leader;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               KickBox;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_0;                                            // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_2;                                            // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_3;                                            // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OnlineIcon;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PromoteText;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               RankUpBox;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                RankUpButton;                                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   PlayerName;                                        // 0x0360(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UWBP_MyDinosaurProfile_C*               OwningProfile;                                     // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 PlayersSteamId;                                    // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 OwnersSteamId;                                     // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bPromoteIsDemote;                                  // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGroupMemberDetails                    GroupMemberDetails;                                // 0x03A0(0x0080)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void BndEvt__Button_Kick_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_GroupMember_GiveLeaderButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_GroupMember_RankUpButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_GroupMember(int32 EntryPoint);
	void OwnerIsAdmin();
	void OwnerIsLeader();
	void OwnerIsNormal();
	void PlayerIsAdmin();
	void PlayerIsLeader();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_GroupMember_C">();
	}
	static class UWBP_GroupMember_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GroupMember_C>();
	}
};
static_assert(alignof(UWBP_GroupMember_C) == 0x000008, "Wrong alignment on UWBP_GroupMember_C");
static_assert(sizeof(UWBP_GroupMember_C) == 0x000420, "Wrong size on UWBP_GroupMember_C");
static_assert(offsetof(UWBP_GroupMember_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_GroupMember_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_GroupMember_C, Background_Name) == 0x0002E8, "Member 'UWBP_GroupMember_C::Background_Name' has a wrong offset!");
static_assert(offsetof(UWBP_GroupMember_C, Button_81) == 0x0002F0, "Member 'UWBP_GroupMember_C::Button_81' has a wrong offset!");
static_assert(offsetof(UWBP_GroupMember_C, Button_Kick) == 0x0002F8, "Member 'UWBP_GroupMember_C::Button_Kick' has a wrong offset!");
static_assert(offsetof(UWBP_GroupMember_C, GiveLeaderBox) == 0x000300, "Member 'UWBP_GroupMember_C::GiveLeaderBox' has a wrong offset!");
static_assert(offsetof(UWBP_GroupMember_C, GiveLeaderButton) == 0x000308, "Member 'UWBP_GroupMember_C::GiveLeaderButton' has a wrong offset!");
static_assert(offsetof(UWBP_GroupMember_C, Image_Admin) == 0x000310, "Member 'UWBP_GroupMember_C::Image_Admin' has a wrong offset!");
static_assert(offsetof(UWBP_GroupMember_C, Image_Leader) == 0x000318, "Member 'UWBP_GroupMember_C::Image_Leader' has a wrong offset!");
static_assert(offsetof(UWBP_GroupMember_C, KickBox) == 0x000320, "Member 'UWBP_GroupMember_C::KickBox' has a wrong offset!");
static_assert(offsetof(UWBP_GroupMember_C, Name_0) == 0x000328, "Member 'UWBP_GroupMember_C::Name_0' has a wrong offset!");
static_assert(offsetof(UWBP_GroupMember_C, Name_2) == 0x000330, "Member 'UWBP_GroupMember_C::Name_2' has a wrong offset!");
static_assert(offsetof(UWBP_GroupMember_C, Name_3) == 0x000338, "Member 'UWBP_GroupMember_C::Name_3' has a wrong offset!");
static_assert(offsetof(UWBP_GroupMember_C, OnlineIcon) == 0x000340, "Member 'UWBP_GroupMember_C::OnlineIcon' has a wrong offset!");
static_assert(offsetof(UWBP_GroupMember_C, PromoteText) == 0x000348, "Member 'UWBP_GroupMember_C::PromoteText' has a wrong offset!");
static_assert(offsetof(UWBP_GroupMember_C, RankUpBox) == 0x000350, "Member 'UWBP_GroupMember_C::RankUpBox' has a wrong offset!");
static_assert(offsetof(UWBP_GroupMember_C, RankUpButton) == 0x000358, "Member 'UWBP_GroupMember_C::RankUpButton' has a wrong offset!");
static_assert(offsetof(UWBP_GroupMember_C, PlayerName) == 0x000360, "Member 'UWBP_GroupMember_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UWBP_GroupMember_C, OwningProfile) == 0x000370, "Member 'UWBP_GroupMember_C::OwningProfile' has a wrong offset!");
static_assert(offsetof(UWBP_GroupMember_C, PlayersSteamId) == 0x000378, "Member 'UWBP_GroupMember_C::PlayersSteamId' has a wrong offset!");
static_assert(offsetof(UWBP_GroupMember_C, OwnersSteamId) == 0x000388, "Member 'UWBP_GroupMember_C::OwnersSteamId' has a wrong offset!");
static_assert(offsetof(UWBP_GroupMember_C, bPromoteIsDemote) == 0x000398, "Member 'UWBP_GroupMember_C::bPromoteIsDemote' has a wrong offset!");
static_assert(offsetof(UWBP_GroupMember_C, GroupMemberDetails) == 0x0003A0, "Member 'UWBP_GroupMember_C::GroupMemberDetails' has a wrong offset!");

}

