#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NestSelectItem

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_NestSelectItem.WBP_NestSelectItem_C.ExecuteUbergraph_WBP_NestSelectItem
// 0x0030 (0x0030 - 0x0000)
struct WBP_NestSelectItem_C_ExecuteUbergraph_WBP_NestSelectItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0008(0x0010)()
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NestSelectItem_C_ExecuteUbergraph_WBP_NestSelectItem) == 0x000008, "Wrong alignment on WBP_NestSelectItem_C_ExecuteUbergraph_WBP_NestSelectItem");
static_assert(sizeof(WBP_NestSelectItem_C_ExecuteUbergraph_WBP_NestSelectItem) == 0x000030, "Wrong size on WBP_NestSelectItem_C_ExecuteUbergraph_WBP_NestSelectItem");
static_assert(offsetof(WBP_NestSelectItem_C_ExecuteUbergraph_WBP_NestSelectItem, EntryPoint) == 0x000000, "Member 'WBP_NestSelectItem_C_ExecuteUbergraph_WBP_NestSelectItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_NestSelectItem_C_ExecuteUbergraph_WBP_NestSelectItem, CallFunc_Conv_NameToText_ReturnValue) == 0x000008, "Member 'WBP_NestSelectItem_C_ExecuteUbergraph_WBP_NestSelectItem::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NestSelectItem_C_ExecuteUbergraph_WBP_NestSelectItem, CallFunc_GetGameInstance_ReturnValue) == 0x000018, "Member 'WBP_NestSelectItem_C_ExecuteUbergraph_WBP_NestSelectItem::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NestSelectItem_C_ExecuteUbergraph_WBP_NestSelectItem, K2Node_DynamicCast_AsBP_Game_Instance) == 0x000020, "Member 'WBP_NestSelectItem_C_ExecuteUbergraph_WBP_NestSelectItem::K2Node_DynamicCast_AsBP_Game_Instance' has a wrong offset!");
static_assert(offsetof(WBP_NestSelectItem_C_ExecuteUbergraph_WBP_NestSelectItem, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_NestSelectItem_C_ExecuteUbergraph_WBP_NestSelectItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

