#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ComboBox

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ComboBox.WBP_ComboBox_C.AddOption
// 0x0018 (0x0018 - 0x0000)
struct WBP_ComboBox_C_AddOption final
{
public:
	class FString                                 Option;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Select;                                            // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_C_AddOption) == 0x000008, "Wrong alignment on WBP_ComboBox_C_AddOption");
static_assert(sizeof(WBP_ComboBox_C_AddOption) == 0x000018, "Wrong size on WBP_ComboBox_C_AddOption");
static_assert(offsetof(WBP_ComboBox_C_AddOption, Option) == 0x000000, "Member 'WBP_ComboBox_C_AddOption::Option' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_C_AddOption, Select) == 0x000010, "Member 'WBP_ComboBox_C_AddOption::Select' has a wrong offset!");

// Function WBP_ComboBox.WBP_ComboBox_C.BndEvt__MainComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_ComboBox_C_BndEvt__MainComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature final
{
public:
	class FString                                 SelectedItem;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   SelectionType;                                     // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_C_BndEvt__MainComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ComboBox_C_BndEvt__MainComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_ComboBox_C_BndEvt__MainComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_ComboBox_C_BndEvt__MainComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_ComboBox_C_BndEvt__MainComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature, SelectedItem) == 0x000000, "Member 'WBP_ComboBox_C_BndEvt__MainComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature::SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_C_BndEvt__MainComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature, SelectionType) == 0x000010, "Member 'WBP_ComboBox_C_BndEvt__MainComboBox_K2Node_ComponentBoundEvent_0_OnSelectionChangedEvent__DelegateSignature::SelectionType' has a wrong offset!");

// Function WBP_ComboBox.WBP_ComboBox_C.ExecuteUbergraph_WBP_ComboBox
// 0x0020 (0x0020 - 0x0000)
struct WBP_ComboBox_C_ExecuteUbergraph_WBP_ComboBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_SelectedItem;           // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESelectInfo                                   K2Node_ComponentBoundEvent_SelectionType;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_C_ExecuteUbergraph_WBP_ComboBox) == 0x000008, "Wrong alignment on WBP_ComboBox_C_ExecuteUbergraph_WBP_ComboBox");
static_assert(sizeof(WBP_ComboBox_C_ExecuteUbergraph_WBP_ComboBox) == 0x000020, "Wrong size on WBP_ComboBox_C_ExecuteUbergraph_WBP_ComboBox");
static_assert(offsetof(WBP_ComboBox_C_ExecuteUbergraph_WBP_ComboBox, EntryPoint) == 0x000000, "Member 'WBP_ComboBox_C_ExecuteUbergraph_WBP_ComboBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_C_ExecuteUbergraph_WBP_ComboBox, K2Node_ComponentBoundEvent_SelectedItem) == 0x000008, "Member 'WBP_ComboBox_C_ExecuteUbergraph_WBP_ComboBox::K2Node_ComponentBoundEvent_SelectedItem' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_C_ExecuteUbergraph_WBP_ComboBox, K2Node_ComponentBoundEvent_SelectionType) == 0x000018, "Member 'WBP_ComboBox_C_ExecuteUbergraph_WBP_ComboBox::K2Node_ComponentBoundEvent_SelectionType' has a wrong offset!");

// Function WBP_ComboBox.WBP_ComboBox_C.GetSelectedOption
// 0x0020 (0x0020 - 0x0000)
struct WBP_ComboBox_C_GetSelectedOption final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSelectedOption_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_C_GetSelectedOption) == 0x000008, "Wrong alignment on WBP_ComboBox_C_GetSelectedOption");
static_assert(sizeof(WBP_ComboBox_C_GetSelectedOption) == 0x000020, "Wrong size on WBP_ComboBox_C_GetSelectedOption");
static_assert(offsetof(WBP_ComboBox_C_GetSelectedOption, ReturnValue) == 0x000000, "Member 'WBP_ComboBox_C_GetSelectedOption::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_C_GetSelectedOption, CallFunc_GetSelectedOption_ReturnValue) == 0x000010, "Member 'WBP_ComboBox_C_GetSelectedOption::CallFunc_GetSelectedOption_ReturnValue' has a wrong offset!");

// Function WBP_ComboBox.WBP_ComboBox_C.SetSelectedOption
// 0x0010 (0x0010 - 0x0000)
struct WBP_ComboBox_C_SetSelectedOption final
{
public:
	class FString                                 Option;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_C_SetSelectedOption) == 0x000008, "Wrong alignment on WBP_ComboBox_C_SetSelectedOption");
static_assert(sizeof(WBP_ComboBox_C_SetSelectedOption) == 0x000010, "Wrong size on WBP_ComboBox_C_SetSelectedOption");
static_assert(offsetof(WBP_ComboBox_C_SetSelectedOption, Option) == 0x000000, "Member 'WBP_ComboBox_C_SetSelectedOption::Option' has a wrong offset!");

// Function WBP_ComboBox.WBP_ComboBox_C.GetOptionCount
// 0x0008 (0x0008 - 0x0000)
struct WBP_ComboBox_C_GetOptionCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetOptionCount_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ComboBox_C_GetOptionCount) == 0x000004, "Wrong alignment on WBP_ComboBox_C_GetOptionCount");
static_assert(sizeof(WBP_ComboBox_C_GetOptionCount) == 0x000008, "Wrong size on WBP_ComboBox_C_GetOptionCount");
static_assert(offsetof(WBP_ComboBox_C_GetOptionCount, ReturnValue) == 0x000000, "Member 'WBP_ComboBox_C_GetOptionCount::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComboBox_C_GetOptionCount, CallFunc_GetOptionCount_ReturnValue) == 0x000004, "Member 'WBP_ComboBox_C_GetOptionCount::CallFunc_GetOptionCount_ReturnValue' has a wrong offset!");

}

