#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Nest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Nest.WBP_Nest_C
// 0x0078 (0x0358 - 0x02E0)
class UWBP_Nest_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PlaceDebris;                                       // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AttentionImage;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           BuildProgress;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DebrisImage;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Flame;                                             // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NestImage;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NestingGroundImage;                                // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           NestPanel;                                         // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SmellImage;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Snowflake;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               TemperatureBox;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TemperatureSlider;                                 // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ATIDinosaurBase*                        Dinosaur;                                          // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	double                                        CurrentScentOpacity;                               // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Nest(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Nest_C">();
	}
	static class UWBP_Nest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Nest_C>();
	}
};
static_assert(alignof(UWBP_Nest_C) == 0x000008, "Wrong alignment on UWBP_Nest_C");
static_assert(sizeof(UWBP_Nest_C) == 0x000358, "Wrong size on UWBP_Nest_C");
static_assert(offsetof(UWBP_Nest_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Nest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Nest_C, PlaceDebris) == 0x0002E8, "Member 'UWBP_Nest_C::PlaceDebris' has a wrong offset!");
static_assert(offsetof(UWBP_Nest_C, AttentionImage) == 0x0002F0, "Member 'UWBP_Nest_C::AttentionImage' has a wrong offset!");
static_assert(offsetof(UWBP_Nest_C, BuildProgress) == 0x0002F8, "Member 'UWBP_Nest_C::BuildProgress' has a wrong offset!");
static_assert(offsetof(UWBP_Nest_C, DebrisImage) == 0x000300, "Member 'UWBP_Nest_C::DebrisImage' has a wrong offset!");
static_assert(offsetof(UWBP_Nest_C, Flame) == 0x000308, "Member 'UWBP_Nest_C::Flame' has a wrong offset!");
static_assert(offsetof(UWBP_Nest_C, NestImage) == 0x000310, "Member 'UWBP_Nest_C::NestImage' has a wrong offset!");
static_assert(offsetof(UWBP_Nest_C, NestingGroundImage) == 0x000318, "Member 'UWBP_Nest_C::NestingGroundImage' has a wrong offset!");
static_assert(offsetof(UWBP_Nest_C, NestPanel) == 0x000320, "Member 'UWBP_Nest_C::NestPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Nest_C, SmellImage) == 0x000328, "Member 'UWBP_Nest_C::SmellImage' has a wrong offset!");
static_assert(offsetof(UWBP_Nest_C, Snowflake) == 0x000330, "Member 'UWBP_Nest_C::Snowflake' has a wrong offset!");
static_assert(offsetof(UWBP_Nest_C, TemperatureBox) == 0x000338, "Member 'UWBP_Nest_C::TemperatureBox' has a wrong offset!");
static_assert(offsetof(UWBP_Nest_C, TemperatureSlider) == 0x000340, "Member 'UWBP_Nest_C::TemperatureSlider' has a wrong offset!");
static_assert(offsetof(UWBP_Nest_C, Dinosaur) == 0x000348, "Member 'UWBP_Nest_C::Dinosaur' has a wrong offset!");
static_assert(offsetof(UWBP_Nest_C, CurrentScentOpacity) == 0x000350, "Member 'UWBP_Nest_C::CurrentScentOpacity' has a wrong offset!");

}

