#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ScalarParameterValue

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ScalarParameterValue.WBP_ScalarParameterValue_C.BndEvt__WBP_ScalarParameterValue_EditableTextBox_154_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_ScalarParameterValue_C_BndEvt__WBP_ScalarParameterValue_EditableTextBox_154_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScalarParameterValue_C_BndEvt__WBP_ScalarParameterValue_EditableTextBox_154_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ScalarParameterValue_C_BndEvt__WBP_ScalarParameterValue_EditableTextBox_154_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_ScalarParameterValue_C_BndEvt__WBP_ScalarParameterValue_EditableTextBox_154_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_ScalarParameterValue_C_BndEvt__WBP_ScalarParameterValue_EditableTextBox_154_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_ScalarParameterValue_C_BndEvt__WBP_ScalarParameterValue_EditableTextBox_154_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_ScalarParameterValue_C_BndEvt__WBP_ScalarParameterValue_EditableTextBox_154_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_BndEvt__WBP_ScalarParameterValue_EditableTextBox_154_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature, CommitMethod) == 0x000010, "Member 'WBP_ScalarParameterValue_C_BndEvt__WBP_ScalarParameterValue_EditableTextBox_154_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_ScalarParameterValue.WBP_ScalarParameterValue_C.BndEvt__WBP_ScalarParameterValue_ParameterValueSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_ScalarParameterValue_C_BndEvt__WBP_ScalarParameterValue_ParameterValueSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScalarParameterValue_C_BndEvt__WBP_ScalarParameterValue_ParameterValueSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_ScalarParameterValue_C_BndEvt__WBP_ScalarParameterValue_ParameterValueSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_ScalarParameterValue_C_BndEvt__WBP_ScalarParameterValue_ParameterValueSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_ScalarParameterValue_C_BndEvt__WBP_ScalarParameterValue_ParameterValueSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_ScalarParameterValue_C_BndEvt__WBP_ScalarParameterValue_ParameterValueSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'WBP_ScalarParameterValue_C_BndEvt__WBP_ScalarParameterValue_ParameterValueSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function WBP_ScalarParameterValue.WBP_ScalarParameterValue_C.ExecuteUbergraph_WBP_ScalarParameterValue
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0008(0x0010)()
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0020(0x0010)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_StringToDouble_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SpecialValue_;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_SpecialValue;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_Customization_C*>           CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_Customization_C*                   CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_Customization_C*>           CallFunc_GetAllWidgetsOfClass_FoundWidgets_1;      // 0x0088(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_Customization_C*                   CallFunc_Array_Get_Item_1;                         // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x00A8(0x0010)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x00B8(0x0010)()
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetValue_InValue_ImplicitCast;            // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_CurrentValue_ImplicitCast;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast;     // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToText_Value_ImplicitCast_1;   // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue) == 0x000008, "Wrong alignment on WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue");
static_assert(sizeof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue) == 0x0000F8, "Wrong size on WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, EntryPoint) == 0x000000, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, CallFunc_Conv_NameToText_ReturnValue) == 0x000008, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, K2Node_ComponentBoundEvent_Value) == 0x000018, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, CallFunc_IsValid_ReturnValue_1) == 0x00001C, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, K2Node_ComponentBoundEvent_Text) == 0x000020, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, K2Node_ComponentBoundEvent_CommitMethod) == 0x000030, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, CallFunc_Conv_TextToString_ReturnValue) == 0x000038, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, CallFunc_Conv_StringToDouble_ReturnValue) == 0x000048, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::CallFunc_Conv_StringToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, K2Node_CustomEvent_SpecialValue_) == 0x000050, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::K2Node_CustomEvent_SpecialValue_' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, K2Node_CustomEvent_SpecialValue) == 0x000058, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::K2Node_CustomEvent_SpecialValue' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, CallFunc_IsValid_ReturnValue_2) == 0x000060, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000068, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, CallFunc_Array_Get_Item) == 0x000078, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, CallFunc_IsValid_ReturnValue_3) == 0x000080, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, CallFunc_GetAllWidgetsOfClass_FoundWidgets_1) == 0x000088, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::CallFunc_GetAllWidgetsOfClass_FoundWidgets_1' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, CallFunc_Array_Get_Item_1) == 0x000098, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, CallFunc_IsValid_ReturnValue_4) == 0x0000A0, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000A1, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, CallFunc_Conv_DoubleToText_ReturnValue) == 0x0000A8, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, CallFunc_Conv_DoubleToText_ReturnValue_1) == 0x0000B8, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::CallFunc_Conv_DoubleToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, CallFunc_Less_DoubleDouble_ReturnValue) == 0x0000C8, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, CallFunc_SetValue_InValue_ImplicitCast) == 0x0000CC, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::CallFunc_SetValue_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, K2Node_VariableSet_CurrentValue_ImplicitCast) == 0x0000D0, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::K2Node_VariableSet_CurrentValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x0000D8, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x0000DC, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, CallFunc_Conv_DoubleToText_Value_ImplicitCast) == 0x0000E0, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::CallFunc_Conv_DoubleToText_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, CallFunc_Conv_DoubleToText_Value_ImplicitCast_1) == 0x0000E8, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::CallFunc_Conv_DoubleToText_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x0000F0, "Member 'WBP_ScalarParameterValue_C_ExecuteUbergraph_WBP_ScalarParameterValue::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");

// Function WBP_ScalarParameterValue.WBP_ScalarParameterValue_C.GetText
// 0x0020 (0x0020 - 0x0000)
struct WBP_ScalarParameterValue_C_GetText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0010(0x0010)()
};
static_assert(alignof(WBP_ScalarParameterValue_C_GetText) == 0x000008, "Wrong alignment on WBP_ScalarParameterValue_C_GetText");
static_assert(sizeof(WBP_ScalarParameterValue_C_GetText) == 0x000020, "Wrong size on WBP_ScalarParameterValue_C_GetText");
static_assert(offsetof(WBP_ScalarParameterValue_C_GetText, ReturnValue) == 0x000000, "Member 'WBP_ScalarParameterValue_C_GetText::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_GetText, CallFunc_Conv_DoubleToText_ReturnValue) == 0x000010, "Member 'WBP_ScalarParameterValue_C_GetText::CallFunc_Conv_DoubleToText_ReturnValue' has a wrong offset!");

// Function WBP_ScalarParameterValue.WBP_ScalarParameterValue_C.InitDefaults
// 0x0001 (0x0001 - 0x0000)
struct WBP_ScalarParameterValue_C_InitDefaults final
{
public:
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScalarParameterValue_C_InitDefaults) == 0x000001, "Wrong alignment on WBP_ScalarParameterValue_C_InitDefaults");
static_assert(sizeof(WBP_ScalarParameterValue_C_InitDefaults) == 0x000001, "Wrong size on WBP_ScalarParameterValue_C_InitDefaults");
static_assert(offsetof(WBP_ScalarParameterValue_C_InitDefaults, K2Node_SwitchName_CmpSuccess) == 0x000000, "Member 'WBP_ScalarParameterValue_C_InitDefaults::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function WBP_ScalarParameterValue.WBP_ScalarParameterValue_C.InitialiseMinMax
// 0x0001 (0x0001 - 0x0000)
struct WBP_ScalarParameterValue_C_InitialiseMinMax final
{
public:
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScalarParameterValue_C_InitialiseMinMax) == 0x000001, "Wrong alignment on WBP_ScalarParameterValue_C_InitialiseMinMax");
static_assert(sizeof(WBP_ScalarParameterValue_C_InitialiseMinMax) == 0x000001, "Wrong size on WBP_ScalarParameterValue_C_InitialiseMinMax");
static_assert(offsetof(WBP_ScalarParameterValue_C_InitialiseMinMax, K2Node_SwitchName_CmpSuccess) == 0x000000, "Member 'WBP_ScalarParameterValue_C_InitialiseMinMax::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function WBP_ScalarParameterValue.WBP_ScalarParameterValue_C.ResetValues
// 0x0010 (0x0010 - 0x0000)
struct WBP_ScalarParameterValue_C_ResetValues final
{
public:
	bool                                          SpecialValue_;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SpecialValue;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScalarParameterValue_C_ResetValues) == 0x000008, "Wrong alignment on WBP_ScalarParameterValue_C_ResetValues");
static_assert(sizeof(WBP_ScalarParameterValue_C_ResetValues) == 0x000010, "Wrong size on WBP_ScalarParameterValue_C_ResetValues");
static_assert(offsetof(WBP_ScalarParameterValue_C_ResetValues, SpecialValue_) == 0x000000, "Member 'WBP_ScalarParameterValue_C_ResetValues::SpecialValue_' has a wrong offset!");
static_assert(offsetof(WBP_ScalarParameterValue_C_ResetValues, SpecialValue) == 0x000008, "Member 'WBP_ScalarParameterValue_C_ResetValues::SpecialValue' has a wrong offset!");

}

