#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Keybinding

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Keybinding.WBP_Keybinding_C.BndEvt__AltModifier_K2Node_ComponentBoundEvent_3_OnCheckStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Keybinding_C_BndEvt__AltModifier_K2Node_ComponentBoundEvent_3_OnCheckStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Keybinding_C_BndEvt__AltModifier_K2Node_ComponentBoundEvent_3_OnCheckStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Keybinding_C_BndEvt__AltModifier_K2Node_ComponentBoundEvent_3_OnCheckStateChanged__DelegateSignature");
static_assert(sizeof(WBP_Keybinding_C_BndEvt__AltModifier_K2Node_ComponentBoundEvent_3_OnCheckStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_Keybinding_C_BndEvt__AltModifier_K2Node_ComponentBoundEvent_3_OnCheckStateChanged__DelegateSignature");
static_assert(offsetof(WBP_Keybinding_C_BndEvt__AltModifier_K2Node_ComponentBoundEvent_3_OnCheckStateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'WBP_Keybinding_C_BndEvt__AltModifier_K2Node_ComponentBoundEvent_3_OnCheckStateChanged__DelegateSignature::IsChecked' has a wrong offset!");

// Function WBP_Keybinding.WBP_Keybinding_C.BndEvt__CmdModifier_K2Node_ComponentBoundEvent_4_OnCheckStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Keybinding_C_BndEvt__CmdModifier_K2Node_ComponentBoundEvent_4_OnCheckStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Keybinding_C_BndEvt__CmdModifier_K2Node_ComponentBoundEvent_4_OnCheckStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Keybinding_C_BndEvt__CmdModifier_K2Node_ComponentBoundEvent_4_OnCheckStateChanged__DelegateSignature");
static_assert(sizeof(WBP_Keybinding_C_BndEvt__CmdModifier_K2Node_ComponentBoundEvent_4_OnCheckStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_Keybinding_C_BndEvt__CmdModifier_K2Node_ComponentBoundEvent_4_OnCheckStateChanged__DelegateSignature");
static_assert(offsetof(WBP_Keybinding_C_BndEvt__CmdModifier_K2Node_ComponentBoundEvent_4_OnCheckStateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'WBP_Keybinding_C_BndEvt__CmdModifier_K2Node_ComponentBoundEvent_4_OnCheckStateChanged__DelegateSignature::IsChecked' has a wrong offset!");

// Function WBP_Keybinding.WBP_Keybinding_C.BndEvt__CtrlModifier_K2Node_ComponentBoundEvent_2_OnCheckStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Keybinding_C_BndEvt__CtrlModifier_K2Node_ComponentBoundEvent_2_OnCheckStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Keybinding_C_BndEvt__CtrlModifier_K2Node_ComponentBoundEvent_2_OnCheckStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Keybinding_C_BndEvt__CtrlModifier_K2Node_ComponentBoundEvent_2_OnCheckStateChanged__DelegateSignature");
static_assert(sizeof(WBP_Keybinding_C_BndEvt__CtrlModifier_K2Node_ComponentBoundEvent_2_OnCheckStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_Keybinding_C_BndEvt__CtrlModifier_K2Node_ComponentBoundEvent_2_OnCheckStateChanged__DelegateSignature");
static_assert(offsetof(WBP_Keybinding_C_BndEvt__CtrlModifier_K2Node_ComponentBoundEvent_2_OnCheckStateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'WBP_Keybinding_C_BndEvt__CtrlModifier_K2Node_ComponentBoundEvent_2_OnCheckStateChanged__DelegateSignature::IsChecked' has a wrong offset!");

// Function WBP_Keybinding.WBP_Keybinding_C.BndEvt__Inverted_K2Node_ComponentBoundEvent_5_OnCheckStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Keybinding_C_BndEvt__Inverted_K2Node_ComponentBoundEvent_5_OnCheckStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Keybinding_C_BndEvt__Inverted_K2Node_ComponentBoundEvent_5_OnCheckStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Keybinding_C_BndEvt__Inverted_K2Node_ComponentBoundEvent_5_OnCheckStateChanged__DelegateSignature");
static_assert(sizeof(WBP_Keybinding_C_BndEvt__Inverted_K2Node_ComponentBoundEvent_5_OnCheckStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_Keybinding_C_BndEvt__Inverted_K2Node_ComponentBoundEvent_5_OnCheckStateChanged__DelegateSignature");
static_assert(offsetof(WBP_Keybinding_C_BndEvt__Inverted_K2Node_ComponentBoundEvent_5_OnCheckStateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'WBP_Keybinding_C_BndEvt__Inverted_K2Node_ComponentBoundEvent_5_OnCheckStateChanged__DelegateSignature::IsChecked' has a wrong offset!");

// Function WBP_Keybinding.WBP_Keybinding_C.BndEvt__ShiftModifier_K2Node_ComponentBoundEvent_1_OnCheckStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_Keybinding_C_BndEvt__ShiftModifier_K2Node_ComponentBoundEvent_1_OnCheckStateChanged__DelegateSignature final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Keybinding_C_BndEvt__ShiftModifier_K2Node_ComponentBoundEvent_1_OnCheckStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_Keybinding_C_BndEvt__ShiftModifier_K2Node_ComponentBoundEvent_1_OnCheckStateChanged__DelegateSignature");
static_assert(sizeof(WBP_Keybinding_C_BndEvt__ShiftModifier_K2Node_ComponentBoundEvent_1_OnCheckStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_Keybinding_C_BndEvt__ShiftModifier_K2Node_ComponentBoundEvent_1_OnCheckStateChanged__DelegateSignature");
static_assert(offsetof(WBP_Keybinding_C_BndEvt__ShiftModifier_K2Node_ComponentBoundEvent_1_OnCheckStateChanged__DelegateSignature, IsChecked) == 0x000000, "Member 'WBP_Keybinding_C_BndEvt__ShiftModifier_K2Node_ComponentBoundEvent_1_OnCheckStateChanged__DelegateSignature::IsChecked' has a wrong offset!");

// Function WBP_Keybinding.WBP_Keybinding_C.ExecuteUbergraph_WBP_Keybinding
// 0x0180 (0x0180 - 0x0000)
struct WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetFriendlyKeyName_ReturnValue;           // 0x0008(0x0010)()
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0020(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_1;        // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_2;        // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue_3;        // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_1;            // 0x0048(0x0010)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetFriendlyKeyName_ReturnValue_1;         // 0x0060(0x0010)()
	class FText                                   CallFunc_Conv_NameToText_ReturnValue_2;            // 0x0070(0x0010)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsChecked_4;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsChecked_3;            // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsChecked_2;            // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsChecked_1;            // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_Select_Default;                             // 0x0090(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_SetupNewKeybinding_EventReply;            // 0x00A8(0x00B8)()
	bool                                          K2Node_ComponentBoundEvent_IsChecked;              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0163(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding) == 0x000008, "Wrong alignment on WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding");
static_assert(sizeof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding) == 0x000180, "Wrong size on WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, EntryPoint) == 0x000000, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, Temp_bool_Variable) == 0x000004, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, CallFunc_GetFriendlyKeyName_ReturnValue) == 0x000008, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::CallFunc_GetFriendlyKeyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, CallFunc_Conv_NameToText_ReturnValue) == 0x000020, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, CallFunc_Conv_TextToString_ReturnValue) == 0x000030, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000040, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, CallFunc_EqualEqual_StriStri_ReturnValue_1) == 0x000041, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::CallFunc_EqualEqual_StriStri_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, CallFunc_EqualEqual_StriStri_ReturnValue_2) == 0x000042, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::CallFunc_EqualEqual_StriStri_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, CallFunc_EqualEqual_StriStri_ReturnValue_3) == 0x000043, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::CallFunc_EqualEqual_StriStri_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, CallFunc_Conv_NameToText_ReturnValue_1) == 0x000048, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::CallFunc_Conv_NameToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, CallFunc_BooleanOR_ReturnValue) == 0x000058, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, CallFunc_GetFriendlyKeyName_ReturnValue_1) == 0x000060, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::CallFunc_GetFriendlyKeyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, CallFunc_Conv_NameToText_ReturnValue_2) == 0x000070, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::CallFunc_Conv_NameToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, CallFunc_GetOwningPlayer_ReturnValue) == 0x000080, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, K2Node_ComponentBoundEvent_IsChecked_4) == 0x000088, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::K2Node_ComponentBoundEvent_IsChecked_4' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, K2Node_ComponentBoundEvent_IsChecked_3) == 0x000089, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::K2Node_ComponentBoundEvent_IsChecked_3' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, K2Node_ComponentBoundEvent_IsChecked_2) == 0x00008A, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::K2Node_ComponentBoundEvent_IsChecked_2' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, K2Node_ComponentBoundEvent_IsChecked_1) == 0x00008B, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::K2Node_ComponentBoundEvent_IsChecked_1' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, K2Node_Select_Default) == 0x000090, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, CallFunc_SetupNewKeybinding_EventReply) == 0x0000A8, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::CallFunc_SetupNewKeybinding_EventReply' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, K2Node_ComponentBoundEvent_IsChecked) == 0x000160, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::K2Node_ComponentBoundEvent_IsChecked' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000161, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000162, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000163, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000164, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, CallFunc_Less_DoubleDouble_A_ImplicitCast) == 0x000168, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::CallFunc_Less_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000170, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding, CallFunc_Less_DoubleDouble_A_ImplicitCast_1) == 0x000178, "Member 'WBP_Keybinding_C_ExecuteUbergraph_WBP_Keybinding::CallFunc_Less_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");

// Function WBP_Keybinding.WBP_Keybinding_C.OnKeyUp
// 0x0200 (0x0200 - 0x0000)
struct WBP_Keybinding_C_OnKeyUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0130(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_SetupNewKeybinding_EventReply;            // 0x0148(0x00B8)()
};
static_assert(alignof(WBP_Keybinding_C_OnKeyUp) == 0x000008, "Wrong alignment on WBP_Keybinding_C_OnKeyUp");
static_assert(sizeof(WBP_Keybinding_C_OnKeyUp) == 0x000200, "Wrong size on WBP_Keybinding_C_OnKeyUp");
static_assert(offsetof(WBP_Keybinding_C_OnKeyUp, MyGeometry) == 0x000000, "Member 'WBP_Keybinding_C_OnKeyUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_OnKeyUp, InKeyEvent) == 0x000038, "Member 'WBP_Keybinding_C_OnKeyUp::InKeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_OnKeyUp, ReturnValue) == 0x000078, "Member 'WBP_Keybinding_C_OnKeyUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_OnKeyUp, CallFunc_GetKey_ReturnValue) == 0x000130, "Member 'WBP_Keybinding_C_OnKeyUp::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_OnKeyUp, CallFunc_SetupNewKeybinding_EventReply) == 0x000148, "Member 'WBP_Keybinding_C_OnKeyUp::CallFunc_SetupNewKeybinding_EventReply' has a wrong offset!");

// Function WBP_Keybinding.WBP_Keybinding_C.OnMouseButtonUp
// 0x0238 (0x0238 - 0x0000)
struct WBP_Keybinding_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0168(0x0018)(HasGetValueTypeHash)
	struct FEventReply                            CallFunc_SetupNewKeybinding_EventReply;            // 0x0180(0x00B8)()
};
static_assert(alignof(WBP_Keybinding_C_OnMouseButtonUp) == 0x000008, "Wrong alignment on WBP_Keybinding_C_OnMouseButtonUp");
static_assert(sizeof(WBP_Keybinding_C_OnMouseButtonUp) == 0x000238, "Wrong size on WBP_Keybinding_C_OnMouseButtonUp");
static_assert(offsetof(WBP_Keybinding_C_OnMouseButtonUp, MyGeometry) == 0x000000, "Member 'WBP_Keybinding_C_OnMouseButtonUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_OnMouseButtonUp, MouseEvent) == 0x000038, "Member 'WBP_Keybinding_C_OnMouseButtonUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_OnMouseButtonUp, ReturnValue) == 0x0000B0, "Member 'WBP_Keybinding_C_OnMouseButtonUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_OnMouseButtonUp, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000168, "Member 'WBP_Keybinding_C_OnMouseButtonUp::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_OnMouseButtonUp, CallFunc_SetupNewKeybinding_EventReply) == 0x000180, "Member 'WBP_Keybinding_C_OnMouseButtonUp::CallFunc_SetupNewKeybinding_EventReply' has a wrong offset!");

// Function WBP_Keybinding.WBP_Keybinding_C.SetupNewKeybinding
// 0x0338 (0x0338 - 0x0000)
struct WBP_Keybinding_C_SetupNewKeybinding final
{
public:
	struct FKey                                   Input;                                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	struct FEventReply                            EventReply;                                        // 0x0018(0x00B8)(Parm, OutParm)
	double                                        LocalScaleVal;                                     // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetFriendlyKeyName_ReturnValue;           // 0x00E0(0x0010)()
	bool                                          Temp_bool_Variable;                                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F3[0x5];                                       // 0x00F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_1;                              // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3;                              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue_1;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_1;           // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default;                             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputAxisKeyMapping                   CallFunc_Array_Get_Item;                           // 0x0158(0x0028)()
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item_1;                         // 0x0180(0x0028)()
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Key_IsGamepadKey_ReturnValue;             // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Select_Default_1;                           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Key_IsGamepadKey_ReturnValue_1;           // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputAxisKeyMapping                   K2Node_MakeStruct_InputAxisKeyMapping;             // 0x01C0(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue_2;                  // 0x01F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue_3;                  // 0x01F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue_4;                  // 0x01F7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue_5;                  // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping;           // 0x0200(0x0028)()
	double                                        K2Node_Select_Default_2;                           // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Default_3;                           // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x023D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x023E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23F[0x1];                                      // 0x023F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0245(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_246[0x2];                                      // 0x0246(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0248(0x00B8)()
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_MakeStruct_Scale_ImplicitCast;              // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_A_ImplicitCast;   // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Option_0_ImplicitCast;               // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Select_Option_0_ImplicitCast_1;             // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_LocalScaleVal_ImplicitCast;     // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_EqualEqual_DoubleDouble_B_ImplicitCast;   // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RemoveAxisMappingByName_Scale_ImplicitCast; // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Keybinding_C_SetupNewKeybinding) == 0x000008, "Wrong alignment on WBP_Keybinding_C_SetupNewKeybinding");
static_assert(sizeof(WBP_Keybinding_C_SetupNewKeybinding) == 0x000338, "Wrong size on WBP_Keybinding_C_SetupNewKeybinding");
static_assert(offsetof(WBP_Keybinding_C_SetupNewKeybinding, Input) == 0x000000, "Member 'WBP_Keybinding_C_SetupNewKeybinding::Input' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_SetupNewKeybinding, EventReply) == 0x000018, "Member 'WBP_Keybinding_C_SetupNewKeybinding::EventReply' has a wrong offset!");
static_assert(offsetof(WBP_Keybinding_C_SetupNewKeybinding, LocalScaleVal) == 0x0000D0, "Member 'WBP_Keybinding_C_SetupNewKeybinding::LocalScaleVal' has a wrong offset!");
