#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings.WBP_Settings_C
// 0x01C8 (0x0560 - 0x0398)
class UWBP_Settings_C final : public UTISettingsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       StaticBurst;                                       // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             Apply;                                             // 0x03A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 AudioSelect;                                       // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AudioText;                                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_1;                                      // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Blackground;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border;                                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_UMG_GameSettings_C*                 BP_UMG_GameSettings;                               // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Apply;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Audio;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Back;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Controls;                                   // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Gameplay;                                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Graphics;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ControlsSelect;                                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ControlText;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CursorBlink;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           DisclaimerCanvas;                                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dusty;                                             // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ForegroundIvy;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GameplaySelect;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GameplayText;                                      // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GraphicsSelect;                                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GraphicsText;                                      // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_29;                                          // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LowerFade;                                         // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Overlay;                                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Panel_MainSettings;                                // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Reset;                                             // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ResetText;                                         // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Static;                                            // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Back;                                         // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Settings;                                     // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ConfigPath;                              // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UpperFade;                                         // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UpperLightGreen;                                   // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UpperLightGreenGlow;                               // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AudioSettings_C*                   WBP_AudoSettings;                                  // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GraphicsSettings_C*                WBP_GraphicsSettings;                              // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Keybinds_C*                        WBP_Keybinds;                                      // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BlinkingLight_C*                   WBP_MorseBlinker;                                  // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BlinkingLight_C*                   WBP_RightBlinkerG;                                 // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           UIcolour;                                          // 0x0508(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NighttimeVibe;                                     // 0x0518(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MorningVibe;                                       // 0x0528(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEditedGraphics;                                   // 0x0538(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInputActionKeyMapping>         ActionKeyMappings;                                 // 0x0540(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FInputAxisKeyMapping>           AxisKeyMappings;                                   // 0x0550(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__Button_4_K2Node_ComponentBoundEvent_170_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_Apply_K2Node_ComponentBoundEvent_973_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_Audio_K2Node_ComponentBoundEvent_662_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_Game_K2Node_ComponentBoundEvent_675_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_Graphics_K2Node_ComponentBoundEvent_650_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Button_Misc_K2Node_ComponentBoundEvent_689_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__Reset_K2Node_ComponentBoundEvent_144_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_Settings(int32 EntryPoint);
	void Init();
	bool OnOpened(bool bInstant);
	void ResetKeybindings();
	void RestartAnimations();
	void SetBackgroundHidden();
	void TabUpdate();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateMenuTheme();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_C">();
	}
	static class UWBP_Settings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_C>();
	}
};
static_assert(alignof(UWBP_Settings_C) == 0x000008, "Wrong alignment on UWBP_Settings_C");
static_assert(sizeof(UWBP_Settings_C) == 0x000560, "Wrong size on UWBP_Settings_C");
static_assert(offsetof(UWBP_Settings_C, UberGraphFrame) == 0x000398, "Member 'UWBP_Settings_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, StaticBurst) == 0x0003A0, "Member 'UWBP_Settings_C::StaticBurst' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, Apply) == 0x0003A8, "Member 'UWBP_Settings_C::Apply' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, AudioSelect) == 0x0003B0, "Member 'UWBP_Settings_C::AudioSelect' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, AudioText) == 0x0003B8, "Member 'UWBP_Settings_C::AudioText' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, Background_1) == 0x0003C0, "Member 'UWBP_Settings_C::Background_1' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, Blackground) == 0x0003C8, "Member 'UWBP_Settings_C::Blackground' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, Border) == 0x0003D0, "Member 'UWBP_Settings_C::Border' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, BP_UMG_GameSettings) == 0x0003D8, "Member 'UWBP_Settings_C::BP_UMG_GameSettings' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, Button_Apply) == 0x0003E0, "Member 'UWBP_Settings_C::Button_Apply' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, Button_Audio) == 0x0003E8, "Member 'UWBP_Settings_C::Button_Audio' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, Button_Back) == 0x0003F0, "Member 'UWBP_Settings_C::Button_Back' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, Button_Controls) == 0x0003F8, "Member 'UWBP_Settings_C::Button_Controls' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, Button_Gameplay) == 0x000400, "Member 'UWBP_Settings_C::Button_Gameplay' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, Button_Graphics) == 0x000408, "Member 'UWBP_Settings_C::Button_Graphics' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, ControlsSelect) == 0x000410, "Member 'UWBP_Settings_C::ControlsSelect' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, ControlText) == 0x000418, "Member 'UWBP_Settings_C::ControlText' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, CursorBlink) == 0x000420, "Member 'UWBP_Settings_C::CursorBlink' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, DisclaimerCanvas) == 0x000428, "Member 'UWBP_Settings_C::DisclaimerCanvas' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, Dusty) == 0x000430, "Member 'UWBP_Settings_C::Dusty' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, ForegroundIvy) == 0x000438, "Member 'UWBP_Settings_C::ForegroundIvy' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, Frame) == 0x000440, "Member 'UWBP_Settings_C::Frame' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, GameplaySelect) == 0x000448, "Member 'UWBP_Settings_C::GameplaySelect' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, GameplayText) == 0x000450, "Member 'UWBP_Settings_C::GameplayText' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, Glow) == 0x000458, "Member 'UWBP_Settings_C::Glow' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, GraphicsSelect) == 0x000460, "Member 'UWBP_Settings_C::GraphicsSelect' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, GraphicsText) == 0x000468, "Member 'UWBP_Settings_C::GraphicsText' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, Image_29) == 0x000470, "Member 'UWBP_Settings_C::Image_29' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, LowerFade) == 0x000478, "Member 'UWBP_Settings_C::LowerFade' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, Overlay) == 0x000480, "Member 'UWBP_Settings_C::Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, Panel_MainSettings) == 0x000488, "Member 'UWBP_Settings_C::Panel_MainSettings' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, Reset) == 0x000490, "Member 'UWBP_Settings_C::Reset' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, ResetText) == 0x000498, "Member 'UWBP_Settings_C::ResetText' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, Static) == 0x0004A0, "Member 'UWBP_Settings_C::Static' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, Text_Back) == 0x0004A8, "Member 'UWBP_Settings_C::Text_Back' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, Text_Settings) == 0x0004B0, "Member 'UWBP_Settings_C::Text_Settings' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, TextBlock_ConfigPath) == 0x0004B8, "Member 'UWBP_Settings_C::TextBlock_ConfigPath' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, UpperFade) == 0x0004C0, "Member 'UWBP_Settings_C::UpperFade' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, UpperLightGreen) == 0x0004C8, "Member 'UWBP_Settings_C::UpperLightGreen' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, UpperLightGreenGlow) == 0x0004D0, "Member 'UWBP_Settings_C::UpperLightGreenGlow' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, WBP_AudoSettings) == 0x0004D8, "Member 'UWBP_Settings_C::WBP_AudoSettings' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, WBP_GraphicsSettings) == 0x0004E0, "Member 'UWBP_Settings_C::WBP_GraphicsSettings' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, WBP_Keybinds) == 0x0004E8, "Member 'UWBP_Settings_C::WBP_Keybinds' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, WBP_MorseBlinker) == 0x0004F0, "Member 'UWBP_Settings_C::WBP_MorseBlinker' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, WBP_RightBlinkerG) == 0x0004F8, "Member 'UWBP_Settings_C::WBP_RightBlinkerG' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, WidgetSwitcher) == 0x000500, "Member 'UWBP_Settings_C::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, UIcolour) == 0x000508, "Member 'UWBP_Settings_C::UIcolour' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, NighttimeVibe) == 0x000518, "Member 'UWBP_Settings_C::NighttimeVibe' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, MorningVibe) == 0x000528, "Member 'UWBP_Settings_C::MorningVibe' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, bEditedGraphics) == 0x000538, "Member 'UWBP_Settings_C::bEditedGraphics' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, ActionKeyMappings) == 0x000540, "Member 'UWBP_Settings_C::ActionKeyMappings' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_C, AxisKeyMappings) == 0x000550, "Member 'UWBP_Settings_C::AxisKeyMappings' has a wrong offset!");

}

