#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VHSoverlay

#include "Basic.hpp"

#include "E_WatermarkSetting_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_VHSoverlay.WBP_VHSoverlay_C.ExecuteUbergraph_WBP_VHSoverlay
// 0x0050 (0x0050 - 0x0000)
struct WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_5;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay) == 0x000008, "Wrong alignment on WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay");
static_assert(sizeof(WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay) == 0x000050, "Wrong size on WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay");
static_assert(offsetof(WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay, EntryPoint) == 0x000000, "Member 'WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay, CallFunc_Add_IntInt_ReturnValue_2) == 0x00001C, "Member 'WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay, Temp_int_Variable) == 0x000020, "Member 'WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000024, "Member 'WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay, CallFunc_Add_IntInt_ReturnValue_3) == 0x000028, "Member 'WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay, Temp_int_Variable_1) == 0x00002C, "Member 'WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay, Temp_int_Variable_2) == 0x000030, "Member 'WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay, CallFunc_Greater_IntInt_ReturnValue) == 0x000034, "Member 'WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay, Temp_int_Variable_3) == 0x000038, "Member 'WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00003C, "Member 'WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay, CallFunc_Add_IntInt_ReturnValue_4) == 0x000040, "Member 'WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay, Temp_int_Variable_4) == 0x000044, "Member 'WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay, CallFunc_Add_IntInt_ReturnValue_5) == 0x000048, "Member 'WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay, Temp_int_Variable_5) == 0x00004C, "Member 'WBP_VHSoverlay_C_ExecuteUbergraph_WBP_VHSoverlay::Temp_int_Variable_5' has a wrong offset!");

// Function WBP_VHSoverlay.WBP_VHSoverlay_C.Get_DateBox_Visibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_VHSoverlay_C_Get_DateBox_Visibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VHSoverlay_C_Get_DateBox_Visibility) == 0x000001, "Wrong alignment on WBP_VHSoverlay_C_Get_DateBox_Visibility");
static_assert(sizeof(WBP_VHSoverlay_C_Get_DateBox_Visibility) == 0x000001, "Wrong size on WBP_VHSoverlay_C_Get_DateBox_Visibility");
static_assert(offsetof(WBP_VHSoverlay_C_Get_DateBox_Visibility, ReturnValue) == 0x000000, "Member 'WBP_VHSoverlay_C_Get_DateBox_Visibility::ReturnValue' has a wrong offset!");

// Function WBP_VHSoverlay.WBP_VHSoverlay_C.Get_FullscreenWatermark_Visibility
// 0x0020 (0x0020 - 0x0000)
struct WBP_VHSoverlay_C_Get_FullscreenWatermark_Visibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetFullscreenWaterMarkSelectionFromEnum_0_WidgetSwitcher; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VHSoverlay_C_Get_FullscreenWatermark_Visibility) == 0x000008, "Wrong alignment on WBP_VHSoverlay_C_Get_FullscreenWatermark_Visibility");
static_assert(sizeof(WBP_VHSoverlay_C_Get_FullscreenWatermark_Visibility) == 0x000020, "Wrong size on WBP_VHSoverlay_C_Get_FullscreenWatermark_Visibility");
static_assert(offsetof(WBP_VHSoverlay_C_Get_FullscreenWatermark_Visibility, ReturnValue) == 0x000000, "Member 'WBP_VHSoverlay_C_Get_FullscreenWatermark_Visibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_Get_FullscreenWatermark_Visibility, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000001, "Member 'WBP_VHSoverlay_C_Get_FullscreenWatermark_Visibility::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_Get_FullscreenWatermark_Visibility, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x000002, "Member 'WBP_VHSoverlay_C_Get_FullscreenWatermark_Visibility::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_Get_FullscreenWatermark_Visibility, CallFunc_MapRangeClamped_ReturnValue) == 0x000008, "Member 'WBP_VHSoverlay_C_Get_FullscreenWatermark_Visibility::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_Get_FullscreenWatermark_Visibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'WBP_VHSoverlay_C_Get_FullscreenWatermark_Visibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_Get_FullscreenWatermark_Visibility, CallFunc_GetFullscreenWaterMarkSelectionFromEnum_0_WidgetSwitcher) == 0x000014, "Member 'WBP_VHSoverlay_C_Get_FullscreenWatermark_Visibility::CallFunc_GetFullscreenWaterMarkSelectionFromEnum_0_WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_Get_FullscreenWatermark_Visibility, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000018, "Member 'WBP_VHSoverlay_C_Get_FullscreenWatermark_Visibility::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_VHSoverlay.WBP_VHSoverlay_C.Get_MinuteText_Text
// 0x0058 (0x0058 - 0x0000)
struct WBP_VHSoverlay_C_Get_MinuteText_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0010)()
	int32                                         CallFunc_BreakDateTime_Year;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month;                      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0048(0x0010)()
};
static_assert(alignof(WBP_VHSoverlay_C_Get_MinuteText_Text) == 0x000008, "Wrong alignment on WBP_VHSoverlay_C_Get_MinuteText_Text");
static_assert(sizeof(WBP_VHSoverlay_C_Get_MinuteText_Text) == 0x000058, "Wrong size on WBP_VHSoverlay_C_Get_MinuteText_Text");
static_assert(offsetof(WBP_VHSoverlay_C_Get_MinuteText_Text, ReturnValue) == 0x000000, "Member 'WBP_VHSoverlay_C_Get_MinuteText_Text::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_Get_MinuteText_Text, CallFunc_Now_ReturnValue) == 0x000010, "Member 'WBP_VHSoverlay_C_Get_MinuteText_Text::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_Get_MinuteText_Text, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'WBP_VHSoverlay_C_Get_MinuteText_Text::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_Get_MinuteText_Text, CallFunc_BreakDateTime_Year) == 0x000028, "Member 'WBP_VHSoverlay_C_Get_MinuteText_Text::CallFunc_BreakDateTime_Year' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_Get_MinuteText_Text, CallFunc_BreakDateTime_Month) == 0x00002C, "Member 'WBP_VHSoverlay_C_Get_MinuteText_Text::CallFunc_BreakDateTime_Month' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_Get_MinuteText_Text, CallFunc_BreakDateTime_Day) == 0x000030, "Member 'WBP_VHSoverlay_C_Get_MinuteText_Text::CallFunc_BreakDateTime_Day' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_Get_MinuteText_Text, CallFunc_BreakDateTime_Hour) == 0x000034, "Member 'WBP_VHSoverlay_C_Get_MinuteText_Text::CallFunc_BreakDateTime_Hour' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_Get_MinuteText_Text, CallFunc_BreakDateTime_Minute) == 0x000038, "Member 'WBP_VHSoverlay_C_Get_MinuteText_Text::CallFunc_BreakDateTime_Minute' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_Get_MinuteText_Text, CallFunc_BreakDateTime_Second) == 0x00003C, "Member 'WBP_VHSoverlay_C_Get_MinuteText_Text::CallFunc_BreakDateTime_Second' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_Get_MinuteText_Text, CallFunc_BreakDateTime_Millisecond) == 0x000040, "Member 'WBP_VHSoverlay_C_Get_MinuteText_Text::CallFunc_BreakDateTime_Millisecond' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_Get_MinuteText_Text, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000048, "Member 'WBP_VHSoverlay_C_Get_MinuteText_Text::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");

// Function WBP_VHSoverlay.WBP_VHSoverlay_C.Get_PlayButton_Visibility
// 0x0020 (0x0020 - 0x0000)
struct WBP_VHSoverlay_C_Get_PlayButton_Visibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCornerWaterMarkSelectionFromEnum_WidgetSwitcher; // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VHSoverlay_C_Get_PlayButton_Visibility) == 0x000008, "Wrong alignment on WBP_VHSoverlay_C_Get_PlayButton_Visibility");
static_assert(sizeof(WBP_VHSoverlay_C_Get_PlayButton_Visibility) == 0x000020, "Wrong size on WBP_VHSoverlay_C_Get_PlayButton_Visibility");
static_assert(offsetof(WBP_VHSoverlay_C_Get_PlayButton_Visibility, ReturnValue) == 0x000000, "Member 'WBP_VHSoverlay_C_Get_PlayButton_Visibility::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_Get_PlayButton_Visibility, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000001, "Member 'WBP_VHSoverlay_C_Get_PlayButton_Visibility::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_Get_PlayButton_Visibility, CallFunc_IsAnimationPlaying_ReturnValue_1) == 0x000002, "Member 'WBP_VHSoverlay_C_Get_PlayButton_Visibility::CallFunc_IsAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_Get_PlayButton_Visibility, CallFunc_MapRangeClamped_ReturnValue) == 0x000008, "Member 'WBP_VHSoverlay_C_Get_PlayButton_Visibility::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_Get_PlayButton_Visibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'WBP_VHSoverlay_C_Get_PlayButton_Visibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_Get_PlayButton_Visibility, CallFunc_GetCornerWaterMarkSelectionFromEnum_WidgetSwitcher) == 0x000014, "Member 'WBP_VHSoverlay_C_Get_PlayButton_Visibility::CallFunc_GetCornerWaterMarkSelectionFromEnum_WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_Get_PlayButton_Visibility, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000018, "Member 'WBP_VHSoverlay_C_Get_PlayButton_Visibility::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_VHSoverlay.WBP_VHSoverlay_C.Get_TextTimerHours_Text
// 0x0020 (0x0020 - 0x0000)
struct WBP_VHSoverlay_C_Get_TextTimerHours_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0010)()
};
static_assert(alignof(WBP_VHSoverlay_C_Get_TextTimerHours_Text) == 0x000008, "Wrong alignment on WBP_VHSoverlay_C_Get_TextTimerHours_Text");
static_assert(sizeof(WBP_VHSoverlay_C_Get_TextTimerHours_Text) == 0x000020, "Wrong size on WBP_VHSoverlay_C_Get_TextTimerHours_Text");
static_assert(offsetof(WBP_VHSoverlay_C_Get_TextTimerHours_Text, ReturnValue) == 0x000000, "Member 'WBP_VHSoverlay_C_Get_TextTimerHours_Text::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_Get_TextTimerHours_Text, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'WBP_VHSoverlay_C_Get_TextTimerHours_Text::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_VHSoverlay.WBP_VHSoverlay_C.Get_TextTimerMinutes_Text
// 0x0020 (0x0020 - 0x0000)
struct WBP_VHSoverlay_C_Get_TextTimerMinutes_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0010)()
};
static_assert(alignof(WBP_VHSoverlay_C_Get_TextTimerMinutes_Text) == 0x000008, "Wrong alignment on WBP_VHSoverlay_C_Get_TextTimerMinutes_Text");
static_assert(sizeof(WBP_VHSoverlay_C_Get_TextTimerMinutes_Text) == 0x000020, "Wrong size on WBP_VHSoverlay_C_Get_TextTimerMinutes_Text");
static_assert(offsetof(WBP_VHSoverlay_C_Get_TextTimerMinutes_Text, ReturnValue) == 0x000000, "Member 'WBP_VHSoverlay_C_Get_TextTimerMinutes_Text::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_Get_TextTimerMinutes_Text, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'WBP_VHSoverlay_C_Get_TextTimerMinutes_Text::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_VHSoverlay.WBP_VHSoverlay_C.Get_Timer_Visibility
// 0x0001 (0x0001 - 0x0000)
struct WBP_VHSoverlay_C_Get_Timer_Visibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VHSoverlay_C_Get_Timer_Visibility) == 0x000001, "Wrong alignment on WBP_VHSoverlay_C_Get_Timer_Visibility");
static_assert(sizeof(WBP_VHSoverlay_C_Get_Timer_Visibility) == 0x000001, "Wrong size on WBP_VHSoverlay_C_Get_Timer_Visibility");
static_assert(offsetof(WBP_VHSoverlay_C_Get_Timer_Visibility, ReturnValue) == 0x000000, "Member 'WBP_VHSoverlay_C_Get_Timer_Visibility::ReturnValue' has a wrong offset!");

// Function WBP_VHSoverlay.WBP_VHSoverlay_C.Get_TimerSeconds_Text
// 0x0020 (0x0020 - 0x0000)
struct WBP_VHSoverlay_C_Get_TimerSeconds_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0010)()
};
static_assert(alignof(WBP_VHSoverlay_C_Get_TimerSeconds_Text) == 0x000008, "Wrong alignment on WBP_VHSoverlay_C_Get_TimerSeconds_Text");
static_assert(sizeof(WBP_VHSoverlay_C_Get_TimerSeconds_Text) == 0x000020, "Wrong size on WBP_VHSoverlay_C_Get_TimerSeconds_Text");
static_assert(offsetof(WBP_VHSoverlay_C_Get_TimerSeconds_Text, ReturnValue) == 0x000000, "Member 'WBP_VHSoverlay_C_Get_TimerSeconds_Text::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_Get_TimerSeconds_Text, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'WBP_VHSoverlay_C_Get_TimerSeconds_Text::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_VHSoverlay.WBP_VHSoverlay_C.GetCornerWaterMarkSelectionFromEnum
// 0x000C (0x000C - 0x0000)
struct WBP_VHSoverlay_C_GetCornerWaterMarkSelectionFromEnum final
{
public:
	E_WatermarkSetting                            WaterMarkSetting;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WidgetSwitcher;                                    // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VHSoverlay_C_GetCornerWaterMarkSelectionFromEnum) == 0x000004, "Wrong alignment on WBP_VHSoverlay_C_GetCornerWaterMarkSelectionFromEnum");
static_assert(sizeof(WBP_VHSoverlay_C_GetCornerWaterMarkSelectionFromEnum) == 0x00000C, "Wrong size on WBP_VHSoverlay_C_GetCornerWaterMarkSelectionFromEnum");
static_assert(offsetof(WBP_VHSoverlay_C_GetCornerWaterMarkSelectionFromEnum, WaterMarkSetting) == 0x000000, "Member 'WBP_VHSoverlay_C_GetCornerWaterMarkSelectionFromEnum::WaterMarkSetting' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetCornerWaterMarkSelectionFromEnum, WidgetSwitcher) == 0x000004, "Member 'WBP_VHSoverlay_C_GetCornerWaterMarkSelectionFromEnum::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetCornerWaterMarkSelectionFromEnum, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'WBP_VHSoverlay_C_GetCornerWaterMarkSelectionFromEnum::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_VHSoverlay.WBP_VHSoverlay_C.GetFullscreenWaterMarkSelectionFromEnum_0
// 0x000C (0x000C - 0x0000)
struct WBP_VHSoverlay_C_GetFullscreenWaterMarkSelectionFromEnum_0 final
{
public:
	E_WatermarkSetting                            WaterMarkSetting;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WidgetSwitcher;                                    // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VHSoverlay_C_GetFullscreenWaterMarkSelectionFromEnum_0) == 0x000004, "Wrong alignment on WBP_VHSoverlay_C_GetFullscreenWaterMarkSelectionFromEnum_0");
static_assert(sizeof(WBP_VHSoverlay_C_GetFullscreenWaterMarkSelectionFromEnum_0) == 0x00000C, "Wrong size on WBP_VHSoverlay_C_GetFullscreenWaterMarkSelectionFromEnum_0");
static_assert(offsetof(WBP_VHSoverlay_C_GetFullscreenWaterMarkSelectionFromEnum_0, WaterMarkSetting) == 0x000000, "Member 'WBP_VHSoverlay_C_GetFullscreenWaterMarkSelectionFromEnum_0::WaterMarkSetting' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetFullscreenWaterMarkSelectionFromEnum_0, WidgetSwitcher) == 0x000004, "Member 'WBP_VHSoverlay_C_GetFullscreenWaterMarkSelectionFromEnum_0::WidgetSwitcher' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetFullscreenWaterMarkSelectionFromEnum_0, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'WBP_VHSoverlay_C_GetFullscreenWaterMarkSelectionFromEnum_0::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_VHSoverlay.WBP_VHSoverlay_C.GetText
// 0x0040 (0x0040 - 0x0000)
struct WBP_VHSoverlay_C_GetText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetHour12_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0010)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0030(0x0010)()
};
static_assert(alignof(WBP_VHSoverlay_C_GetText) == 0x000008, "Wrong alignment on WBP_VHSoverlay_C_GetText");
static_assert(sizeof(WBP_VHSoverlay_C_GetText) == 0x000040, "Wrong size on WBP_VHSoverlay_C_GetText");
static_assert(offsetof(WBP_VHSoverlay_C_GetText, ReturnValue) == 0x000000, "Member 'WBP_VHSoverlay_C_GetText::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText, CallFunc_Now_ReturnValue) == 0x000010, "Member 'WBP_VHSoverlay_C_GetText::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText, CallFunc_GetHour12_ReturnValue) == 0x000018, "Member 'WBP_VHSoverlay_C_GetText::CallFunc_GetHour12_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'WBP_VHSoverlay_C_GetText::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000030, "Member 'WBP_VHSoverlay_C_GetText::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");

// Function WBP_VHSoverlay.WBP_VHSoverlay_C.GetText_0
// 0x0058 (0x0058 - 0x0000)
struct WBP_VHSoverlay_C_GetText_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0010)()
	int32                                         CallFunc_BreakDateTime_Year;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month;                      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0048(0x0010)()
};
static_assert(alignof(WBP_VHSoverlay_C_GetText_0) == 0x000008, "Wrong alignment on WBP_VHSoverlay_C_GetText_0");
static_assert(sizeof(WBP_VHSoverlay_C_GetText_0) == 0x000058, "Wrong size on WBP_VHSoverlay_C_GetText_0");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_0, ReturnValue) == 0x000000, "Member 'WBP_VHSoverlay_C_GetText_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_0, CallFunc_Now_ReturnValue) == 0x000010, "Member 'WBP_VHSoverlay_C_GetText_0::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_0, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'WBP_VHSoverlay_C_GetText_0::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_0, CallFunc_BreakDateTime_Year) == 0x000028, "Member 'WBP_VHSoverlay_C_GetText_0::CallFunc_BreakDateTime_Year' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_0, CallFunc_BreakDateTime_Month) == 0x00002C, "Member 'WBP_VHSoverlay_C_GetText_0::CallFunc_BreakDateTime_Month' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_0, CallFunc_BreakDateTime_Day) == 0x000030, "Member 'WBP_VHSoverlay_C_GetText_0::CallFunc_BreakDateTime_Day' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_0, CallFunc_BreakDateTime_Hour) == 0x000034, "Member 'WBP_VHSoverlay_C_GetText_0::CallFunc_BreakDateTime_Hour' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_0, CallFunc_BreakDateTime_Minute) == 0x000038, "Member 'WBP_VHSoverlay_C_GetText_0::CallFunc_BreakDateTime_Minute' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_0, CallFunc_BreakDateTime_Second) == 0x00003C, "Member 'WBP_VHSoverlay_C_GetText_0::CallFunc_BreakDateTime_Second' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_0, CallFunc_BreakDateTime_Millisecond) == 0x000040, "Member 'WBP_VHSoverlay_C_GetText_0::CallFunc_BreakDateTime_Millisecond' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_0, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000048, "Member 'WBP_VHSoverlay_C_GetText_0::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");

// Function WBP_VHSoverlay.WBP_VHSoverlay_C.GetText_1
// 0x0058 (0x0058 - 0x0000)
struct WBP_VHSoverlay_C_GetText_1 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0010)()
	int32                                         CallFunc_BreakDateTime_Year;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month;                      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0048(0x0010)()
};
static_assert(alignof(WBP_VHSoverlay_C_GetText_1) == 0x000008, "Wrong alignment on WBP_VHSoverlay_C_GetText_1");
static_assert(sizeof(WBP_VHSoverlay_C_GetText_1) == 0x000058, "Wrong size on WBP_VHSoverlay_C_GetText_1");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_1, ReturnValue) == 0x000000, "Member 'WBP_VHSoverlay_C_GetText_1::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_1, CallFunc_Now_ReturnValue) == 0x000010, "Member 'WBP_VHSoverlay_C_GetText_1::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_1, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'WBP_VHSoverlay_C_GetText_1::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_1, CallFunc_BreakDateTime_Year) == 0x000028, "Member 'WBP_VHSoverlay_C_GetText_1::CallFunc_BreakDateTime_Year' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_1, CallFunc_BreakDateTime_Month) == 0x00002C, "Member 'WBP_VHSoverlay_C_GetText_1::CallFunc_BreakDateTime_Month' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_1, CallFunc_BreakDateTime_Day) == 0x000030, "Member 'WBP_VHSoverlay_C_GetText_1::CallFunc_BreakDateTime_Day' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_1, CallFunc_BreakDateTime_Hour) == 0x000034, "Member 'WBP_VHSoverlay_C_GetText_1::CallFunc_BreakDateTime_Hour' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_1, CallFunc_BreakDateTime_Minute) == 0x000038, "Member 'WBP_VHSoverlay_C_GetText_1::CallFunc_BreakDateTime_Minute' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_1, CallFunc_BreakDateTime_Second) == 0x00003C, "Member 'WBP_VHSoverlay_C_GetText_1::CallFunc_BreakDateTime_Second' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_1, CallFunc_BreakDateTime_Millisecond) == 0x000040, "Member 'WBP_VHSoverlay_C_GetText_1::CallFunc_BreakDateTime_Millisecond' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_1, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000048, "Member 'WBP_VHSoverlay_C_GetText_1::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");

// Function WBP_VHSoverlay.WBP_VHSoverlay_C.GetText_2
// 0x0040 (0x0040 - 0x0000)
struct WBP_VHSoverlay_C_GetText_2 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	int32                                         MonthRef;                                          // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Year;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Month;                      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Day;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Hour;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Minute;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Second;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakDateTime_Millisecond;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VHSoverlay_C_GetText_2) == 0x000008, "Wrong alignment on WBP_VHSoverlay_C_GetText_2");
static_assert(sizeof(WBP_VHSoverlay_C_GetText_2) == 0x000040, "Wrong size on WBP_VHSoverlay_C_GetText_2");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_2, ReturnValue) == 0x000000, "Member 'WBP_VHSoverlay_C_GetText_2::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_2, MonthRef) == 0x000010, "Member 'WBP_VHSoverlay_C_GetText_2::MonthRef' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_2, K2Node_SwitchInteger_CmpSuccess) == 0x000014, "Member 'WBP_VHSoverlay_C_GetText_2::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_2, CallFunc_Now_ReturnValue) == 0x000018, "Member 'WBP_VHSoverlay_C_GetText_2::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_2, CallFunc_BreakDateTime_Year) == 0x000020, "Member 'WBP_VHSoverlay_C_GetText_2::CallFunc_BreakDateTime_Year' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_2, CallFunc_BreakDateTime_Month) == 0x000024, "Member 'WBP_VHSoverlay_C_GetText_2::CallFunc_BreakDateTime_Month' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_2, CallFunc_BreakDateTime_Day) == 0x000028, "Member 'WBP_VHSoverlay_C_GetText_2::CallFunc_BreakDateTime_Day' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_2, CallFunc_BreakDateTime_Hour) == 0x00002C, "Member 'WBP_VHSoverlay_C_GetText_2::CallFunc_BreakDateTime_Hour' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_2, CallFunc_BreakDateTime_Minute) == 0x000030, "Member 'WBP_VHSoverlay_C_GetText_2::CallFunc_BreakDateTime_Minute' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_2, CallFunc_BreakDateTime_Second) == 0x000034, "Member 'WBP_VHSoverlay_C_GetText_2::CallFunc_BreakDateTime_Second' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_2, CallFunc_BreakDateTime_Millisecond) == 0x000038, "Member 'WBP_VHSoverlay_C_GetText_2::CallFunc_BreakDateTime_Millisecond' has a wrong offset!");

// Function WBP_VHSoverlay.WBP_VHSoverlay_C.GetText_3
// 0x0060 (0x0060 - 0x0000)
struct WBP_VHSoverlay_C_GetText_3 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAfternoon_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0050(0x0010)()
};
static_assert(alignof(WBP_VHSoverlay_C_GetText_3) == 0x000008, "Wrong alignment on WBP_VHSoverlay_C_GetText_3");
static_assert(sizeof(WBP_VHSoverlay_C_GetText_3) == 0x000060, "Wrong size on WBP_VHSoverlay_C_GetText_3");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_3, ReturnValue) == 0x000000, "Member 'WBP_VHSoverlay_C_GetText_3::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_3, CallFunc_Now_ReturnValue) == 0x000010, "Member 'WBP_VHSoverlay_C_GetText_3::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_3, CallFunc_IsAfternoon_ReturnValue) == 0x000018, "Member 'WBP_VHSoverlay_C_GetText_3::CallFunc_IsAfternoon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_3, CallFunc_SelectString_ReturnValue) == 0x000020, "Member 'WBP_VHSoverlay_C_GetText_3::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_3, CallFunc_SelectString_ReturnValue_1) == 0x000030, "Member 'WBP_VHSoverlay_C_GetText_3::CallFunc_SelectString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_3, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'WBP_VHSoverlay_C_GetText_3::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetText_3, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000050, "Member 'WBP_VHSoverlay_C_GetText_3::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function WBP_VHSoverlay.WBP_VHSoverlay_C.GetVisibility_0
// 0x0008 (0x0008 - 0x0000)
struct WBP_VHSoverlay_C_GetVisibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VHSoverlay_C_GetVisibility_0) == 0x000004, "Wrong alignment on WBP_VHSoverlay_C_GetVisibility_0");
static_assert(sizeof(WBP_VHSoverlay_C_GetVisibility_0) == 0x000008, "Wrong size on WBP_VHSoverlay_C_GetVisibility_0");
static_assert(offsetof(WBP_VHSoverlay_C_GetVisibility_0, ReturnValue) == 0x000000, "Member 'WBP_VHSoverlay_C_GetVisibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetVisibility_0, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'WBP_VHSoverlay_C_GetVisibility_0::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetVisibility_0, CallFunc_SetRenderOpacity_InOpacity_ImplicitCast) == 0x000004, "Member 'WBP_VHSoverlay_C_GetVisibility_0::CallFunc_SetRenderOpacity_InOpacity_ImplicitCast' has a wrong offset!");

// Function WBP_VHSoverlay.WBP_VHSoverlay_C.GetVisibility_1
// 0x0005 (0x0005 - 0x0000)
struct WBP_VHSoverlay_C_GetVisibility_1 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VHSoverlay_C_GetVisibility_1) == 0x000001, "Wrong alignment on WBP_VHSoverlay_C_GetVisibility_1");
static_assert(sizeof(WBP_VHSoverlay_C_GetVisibility_1) == 0x000005, "Wrong size on WBP_VHSoverlay_C_GetVisibility_1");
static_assert(offsetof(WBP_VHSoverlay_C_GetVisibility_1, ReturnValue) == 0x000000, "Member 'WBP_VHSoverlay_C_GetVisibility_1::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetVisibility_1, Temp_bool_Variable) == 0x000001, "Member 'WBP_VHSoverlay_C_GetVisibility_1::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VHSoverlay_C_GetVisibility_1, Temp_byte_Variable) == 0x000002, "Member 'WBP_VHSoverlay_C_GetVisibility_1::Temp_byte_Variable' has a wrong offset!");
