#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings.WBP_Settings_C.ExecuteUbergraph_WBP_Settings
// 0x0108 (0x0108 - 0x0000)
struct WBP_Settings_C_ExecuteUbergraph_WBP_Settings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerController_C*                 K2Node_DynamicCast_AsBP_Player_Controller;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ATICharacterBase*                       K2Node_DynamicCast_AsThe_Isle_Character_Base;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsAlive_ReturnValue;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBPI_SettingWidget_C>  K2Node_DynamicCast_AsBPI_Setting_Widget;           // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0064(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_1;        // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue_1;       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATIPlayerController*                    CallFunc_GetTIPlayerController_ReturnValue;        // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_SettingWidget_C>  K2Node_DynamicCast_AsBPI_Setting_Widget_1;         // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerController_C*                 K2Node_DynamicCast_AsBP_Player_Controller_1;       // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Close_ReturnValue;                        // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings) == 0x000008, "Wrong alignment on WBP_Settings_C_ExecuteUbergraph_WBP_Settings");
static_assert(sizeof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings) == 0x000108, "Wrong size on WBP_Settings_C_ExecuteUbergraph_WBP_Settings");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, EntryPoint) == 0x000000, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, K2Node_DynamicCast_AsBP_Player_Controller) == 0x000010, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::K2Node_DynamicCast_AsBP_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, CallFunc_K2_GetPawn_ReturnValue) == 0x000020, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, K2Node_DynamicCast_AsThe_Isle_Character_Base) == 0x000028, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::K2Node_DynamicCast_AsThe_Isle_Character_Base' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, CallFunc_GetIsAlive_ReturnValue) == 0x000031, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::CallFunc_GetIsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, CallFunc_GetGameUserSettings_ReturnValue) == 0x000038, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000040, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, CallFunc_GetChildAt_ReturnValue) == 0x000048, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, K2Node_DynamicCast_AsBPI_Setting_Widget) == 0x000050, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::K2Node_DynamicCast_AsBPI_Setting_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, K2Node_Event_MyGeometry) == 0x000064, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, K2Node_Event_InDeltaTime) == 0x00009C, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, CallFunc_PlayAnimation_ReturnValue) == 0x0000A0, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000A8, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, CallFunc_GetGameUserSettings_ReturnValue_1) == 0x0000B0, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::CallFunc_GetGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, CallFunc_GetActiveWidgetIndex_ReturnValue_1) == 0x0000B8, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::CallFunc_GetActiveWidgetIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, CallFunc_GetTIPlayerController_ReturnValue) == 0x0000C0, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::CallFunc_GetTIPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, CallFunc_GetChildAt_ReturnValue_1) == 0x0000C8, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, K2Node_DynamicCast_AsBPI_Setting_Widget_1) == 0x0000D8, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::K2Node_DynamicCast_AsBPI_Setting_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, K2Node_DynamicCast_bSuccess_3) == 0x0000E8, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, K2Node_DynamicCast_AsBP_Player_Controller_1) == 0x0000F0, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::K2Node_DynamicCast_AsBP_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, K2Node_DynamicCast_bSuccess_4) == 0x0000F8, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, CallFunc_Close_ReturnValue) == 0x0000F9, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::CallFunc_Close_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_ExecuteUbergraph_WBP_Settings, CallFunc_GetOwningPlayer_ReturnValue) == 0x000100, "Member 'WBP_Settings_C_ExecuteUbergraph_WBP_Settings::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");

// Function WBP_Settings.WBP_Settings_C.Init
// 0x0078 (0x0078 - 0x0000)
struct WBP_Settings_C_Init final
{
public:
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0000(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0068(0x0010)()
};
static_assert(alignof(WBP_Settings_C_Init) == 0x000008, "Wrong alignment on WBP_Settings_C_Init");
static_assert(sizeof(WBP_Settings_C_Init) == 0x000078, "Wrong size on WBP_Settings_C_Init");
static_assert(offsetof(WBP_Settings_C_Init, CallFunc_Conv_StringToText_ReturnValue) == 0x000000, "Member 'WBP_Settings_C_Init::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_Init, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'WBP_Settings_C_Init::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_Init, K2Node_MakeArray_Array) == 0x000058, "Member 'WBP_Settings_C_Init::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_Init, CallFunc_Format_ReturnValue) == 0x000068, "Member 'WBP_Settings_C_Init::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_Settings.WBP_Settings_C.OnOpened
// 0x0003 (0x0003 - 0x0000)
struct WBP_Settings_C_OnOpened final
{
public:
	bool                                          bInstant;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseUIInput_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_C_OnOpened) == 0x000001, "Wrong alignment on WBP_Settings_C_OnOpened");
static_assert(sizeof(WBP_Settings_C_OnOpened) == 0x000003, "Wrong size on WBP_Settings_C_OnOpened");
static_assert(offsetof(WBP_Settings_C_OnOpened, bInstant) == 0x000000, "Member 'WBP_Settings_C_OnOpened::bInstant' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_OnOpened, ReturnValue) == 0x000001, "Member 'WBP_Settings_C_OnOpened::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_OnOpened, CallFunc_UseUIInput_ReturnValue) == 0x000002, "Member 'WBP_Settings_C_OnOpened::CallFunc_UseUIInput_ReturnValue' has a wrong offset!");

// Function WBP_Settings.WBP_Settings_C.TabUpdate
// 0x0030 (0x0030 - 0x0000)
struct WBP_Settings_C_TabUpdate final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0014)()
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x001C(0x0014)()
};
static_assert(alignof(WBP_Settings_C_TabUpdate) == 0x000004, "Wrong alignment on WBP_Settings_C_TabUpdate");
static_assert(sizeof(WBP_Settings_C_TabUpdate) == 0x000030, "Wrong size on WBP_Settings_C_TabUpdate");
static_assert(offsetof(WBP_Settings_C_TabUpdate, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'WBP_Settings_C_TabUpdate::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_TabUpdate, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000014, "Member 'WBP_Settings_C_TabUpdate::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_TabUpdate, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Settings_C_TabUpdate::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_TabUpdate, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000019, "Member 'WBP_Settings_C_TabUpdate::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_TabUpdate, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00001A, "Member 'WBP_Settings_C_TabUpdate::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_TabUpdate, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x00001B, "Member 'WBP_Settings_C_TabUpdate::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_TabUpdate, K2Node_MakeStruct_SlateColor_1) == 0x00001C, "Member 'WBP_Settings_C_TabUpdate::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function WBP_Settings.WBP_Settings_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Settings_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_C_Tick) == 0x000004, "Wrong alignment on WBP_Settings_C_Tick");
static_assert(sizeof(WBP_Settings_C_Tick) == 0x00003C, "Wrong size on WBP_Settings_C_Tick");
static_assert(offsetof(WBP_Settings_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Settings_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_Settings_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_Settings.WBP_Settings_C.UpdateMenuTheme
// 0x0010 (0x0010 - 0x0000)
struct WBP_Settings_C_UpdateMenuTheme final
{
public:
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetHour_ReturnValue;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue_1;             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue_2;             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_C_UpdateMenuTheme) == 0x000008, "Wrong alignment on WBP_Settings_C_UpdateMenuTheme");
static_assert(sizeof(WBP_Settings_C_UpdateMenuTheme) == 0x000010, "Wrong size on WBP_Settings_C_UpdateMenuTheme");
static_assert(offsetof(WBP_Settings_C_UpdateMenuTheme, CallFunc_Now_ReturnValue) == 0x000000, "Member 'WBP_Settings_C_UpdateMenuTheme::CallFunc_Now_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_UpdateMenuTheme, CallFunc_GetHour_ReturnValue) == 0x000008, "Member 'WBP_Settings_C_UpdateMenuTheme::CallFunc_GetHour_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_UpdateMenuTheme, CallFunc_InRange_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Settings_C_UpdateMenuTheme::CallFunc_InRange_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_UpdateMenuTheme, CallFunc_InRange_IntInt_ReturnValue_1) == 0x00000D, "Member 'WBP_Settings_C_UpdateMenuTheme::CallFunc_InRange_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_UpdateMenuTheme, CallFunc_InRange_IntInt_ReturnValue_2) == 0x00000E, "Member 'WBP_Settings_C_UpdateMenuTheme::CallFunc_InRange_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Settings_C_UpdateMenuTheme, CallFunc_BooleanOR_ReturnValue) == 0x00000F, "Member 'WBP_Settings_C_UpdateMenuTheme::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

