#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TextInputBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TextInputBox.WBP_TextInputBox_C
// 0x0080 (0x0360 - 0x02E0)
class UWBP_TextInputBox_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BackgroundImage;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ColorBorder;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          MainEditableText;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bHasFocus;                                         // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0308(0x0010)(Edit, BlueprintVisible)
	int32                                         InputLimit;                                        // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             TypingSound;                                       // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   HintText;                                          // 0x0328(0x0010)(Edit, BlueprintVisible)
	TMulticastInlineDelegate<void(class FText Text)> OnTextChanged;                                  // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         FontSize;                                          // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPassword;                                       // 0x034C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class FText NewParam, ETextCommit Method)> OnTextCommitted;        // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void BndEvt__MainEditableText_K2Node_ComponentBoundEvent_0_OnEditableTextChangedEvent__DelegateSignature(const class FText& Text_0);
	void BndEvt__WBP_TextInputBox_MainEditableText_K2Node_ComponentBoundEvent_0_OnEditableTextCommittedEvent__DelegateSignature(const class FText& Text_0, ETextCommit CommitMethod);
	void ExecuteUbergraph_WBP_TextInputBox(int32 EntryPoint);
	void HandleInputLimit(const class FText& Text_0);
	void PreConstruct(bool IsDesignTime);
	void SetFontColor(const struct FLinearColor& NewColor);
	void SetFontSize(int32 Size);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TextInputBox_C">();
	}
	static class UWBP_TextInputBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TextInputBox_C>();
	}
};
static_assert(alignof(UWBP_TextInputBox_C) == 0x000008, "Wrong alignment on UWBP_TextInputBox_C");
static_assert(sizeof(UWBP_TextInputBox_C) == 0x000360, "Wrong size on UWBP_TextInputBox_C");
static_assert(offsetof(UWBP_TextInputBox_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_TextInputBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TextInputBox_C, BackgroundImage) == 0x0002E8, "Member 'UWBP_TextInputBox_C::BackgroundImage' has a wrong offset!");
static_assert(offsetof(UWBP_TextInputBox_C, ColorBorder) == 0x0002F0, "Member 'UWBP_TextInputBox_C::ColorBorder' has a wrong offset!");
static_assert(offsetof(UWBP_TextInputBox_C, MainEditableText) == 0x0002F8, "Member 'UWBP_TextInputBox_C::MainEditableText' has a wrong offset!");
static_assert(offsetof(UWBP_TextInputBox_C, bHasFocus) == 0x000300, "Member 'UWBP_TextInputBox_C::bHasFocus' has a wrong offset!");
static_assert(offsetof(UWBP_TextInputBox_C, Text) == 0x000308, "Member 'UWBP_TextInputBox_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_TextInputBox_C, InputLimit) == 0x000318, "Member 'UWBP_TextInputBox_C::InputLimit' has a wrong offset!");
static_assert(offsetof(UWBP_TextInputBox_C, TypingSound) == 0x000320, "Member 'UWBP_TextInputBox_C::TypingSound' has a wrong offset!");
static_assert(offsetof(UWBP_TextInputBox_C, HintText) == 0x000328, "Member 'UWBP_TextInputBox_C::HintText' has a wrong offset!");
static_assert(offsetof(UWBP_TextInputBox_C, OnTextChanged) == 0x000338, "Member 'UWBP_TextInputBox_C::OnTextChanged' has a wrong offset!");
static_assert(offsetof(UWBP_TextInputBox_C, FontSize) == 0x000348, "Member 'UWBP_TextInputBox_C::FontSize' has a wrong offset!");
static_assert(offsetof(UWBP_TextInputBox_C, bIsPassword) == 0x00034C, "Member 'UWBP_TextInputBox_C::bIsPassword' has a wrong offset!");
static_assert(offsetof(UWBP_TextInputBox_C, OnTextCommitted) == 0x000350, "Member 'UWBP_TextInputBox_C::OnTextCommitted' has a wrong offset!");

}

