#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VHSoverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ST_WatermarkSetting_structs.hpp"
#include "E_WatermarkSetting_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_VHSoverlay.WBP_VHSoverlay_C
// 0x0110 (0x03F0 - 0x02E0)
class UWBP_VHSoverlay_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CornerWatermarkAnimation;                          // 0x02E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetSwitcher*                        CornerWaterMark;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           DateBox;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        FullscreenWatermark;                               // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HourText;                                          // 0x0308(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_84;                                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MinuteText;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PlayButton;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0348(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_1;                                       // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_2;                                       // 0x0358(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_6;                                       // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextTimerHours;                                    // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextTimerMinutes;                                  // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextTimerSeconds;                                  // 0x0378(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Timer;                                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Afternoon_;                                        // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Minute;                                            // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Hour;                                              // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Day;                                               // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Month;                                             // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Year;                                              // 0x039C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          RealTime_;                                         // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          HasTimer_;                                         // 0x03A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3A2[0x2];                                      // 0x03A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TimerSeconds;                                      // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TimerMinutes;                                      // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TimerHours;                                        // 0x03AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GeneralTimePassControl;                            // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasDateBox;                                       // 0x03B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bHasPlayButton;                                    // 0x03B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3B6[0x2];                                      // 0x03B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_WatermarkSetting                   CornerWatermarkStruct;                             // 0x03B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FST_WatermarkSetting                   FullscreenWatermarkStruct;                         // 0x03D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Two4Hr;                                            // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WBP_VHSoverlay(int32 EntryPoint);
	ESlateVisibility Get_DateBox_Visibility();
	ESlateVisibility Get_FullscreenWatermark_Visibility();
	class FText Get_MinuteText_Text();
	ESlateVisibility Get_PlayButton_Visibility();
	class FText Get_TextTimerHours_Text();
	class FText Get_TextTimerMinutes_Text();
	ESlateVisibility Get_Timer_Visibility();
	class FText Get_TimerSeconds_Text();
	void GetCornerWaterMarkSelectionFromEnum(E_WatermarkSetting WaterMarkSetting, int32* WidgetSwitcher);
	void GetFullscreenWaterMarkSelectionFromEnum_0(E_WatermarkSetting WaterMarkSetting, int32* WidgetSwitcher);
	class FText GetText();
	class FText GetText_0();
	class FText GetText_1();
	class FText GetText_2();
	class FText GetText_3();
	ESlateVisibility GetVisibility_0();
	ESlateVisibility GetVisibility_1();
	void ResetTimer();
	void StartAnimation();
	void StartTimer();
	void StopAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_VHSoverlay_C">();
	}
	static class UWBP_VHSoverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_VHSoverlay_C>();
	}
};
static_assert(alignof(UWBP_VHSoverlay_C) == 0x000008, "Wrong alignment on UWBP_VHSoverlay_C");
static_assert(sizeof(UWBP_VHSoverlay_C) == 0x0003F0, "Wrong size on UWBP_VHSoverlay_C");
static_assert(offsetof(UWBP_VHSoverlay_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_VHSoverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, CornerWatermarkAnimation) == 0x0002E8, "Member 'UWBP_VHSoverlay_C::CornerWatermarkAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, CornerWaterMark) == 0x0002F0, "Member 'UWBP_VHSoverlay_C::CornerWaterMark' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, DateBox) == 0x0002F8, "Member 'UWBP_VHSoverlay_C::DateBox' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, FullscreenWatermark) == 0x000300, "Member 'UWBP_VHSoverlay_C::FullscreenWatermark' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, HourText) == 0x000308, "Member 'UWBP_VHSoverlay_C::HourText' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, Image) == 0x000310, "Member 'UWBP_VHSoverlay_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, Image_1) == 0x000318, "Member 'UWBP_VHSoverlay_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, Image_3) == 0x000320, "Member 'UWBP_VHSoverlay_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, Image_4) == 0x000328, "Member 'UWBP_VHSoverlay_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, Image_84) == 0x000330, "Member 'UWBP_VHSoverlay_C::Image_84' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, MinuteText) == 0x000338, "Member 'UWBP_VHSoverlay_C::MinuteText' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, PlayButton) == 0x000340, "Member 'UWBP_VHSoverlay_C::PlayButton' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, TextBlock) == 0x000348, "Member 'UWBP_VHSoverlay_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, TextBlock_1) == 0x000350, "Member 'UWBP_VHSoverlay_C::TextBlock_1' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, TextBlock_2) == 0x000358, "Member 'UWBP_VHSoverlay_C::TextBlock_2' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, TextBlock_6) == 0x000360, "Member 'UWBP_VHSoverlay_C::TextBlock_6' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, TextTimerHours) == 0x000368, "Member 'UWBP_VHSoverlay_C::TextTimerHours' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, TextTimerMinutes) == 0x000370, "Member 'UWBP_VHSoverlay_C::TextTimerMinutes' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, TextTimerSeconds) == 0x000378, "Member 'UWBP_VHSoverlay_C::TextTimerSeconds' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, Timer) == 0x000380, "Member 'UWBP_VHSoverlay_C::Timer' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, Afternoon_) == 0x000388, "Member 'UWBP_VHSoverlay_C::Afternoon_' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, Minute) == 0x00038C, "Member 'UWBP_VHSoverlay_C::Minute' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, Hour) == 0x000390, "Member 'UWBP_VHSoverlay_C::Hour' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, Day) == 0x000394, "Member 'UWBP_VHSoverlay_C::Day' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, Month) == 0x000398, "Member 'UWBP_VHSoverlay_C::Month' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, Year) == 0x00039C, "Member 'UWBP_VHSoverlay_C::Year' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, RealTime_) == 0x0003A0, "Member 'UWBP_VHSoverlay_C::RealTime_' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, HasTimer_) == 0x0003A1, "Member 'UWBP_VHSoverlay_C::HasTimer_' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, TimerSeconds) == 0x0003A4, "Member 'UWBP_VHSoverlay_C::TimerSeconds' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, TimerMinutes) == 0x0003A8, "Member 'UWBP_VHSoverlay_C::TimerMinutes' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, TimerHours) == 0x0003AC, "Member 'UWBP_VHSoverlay_C::TimerHours' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, GeneralTimePassControl) == 0x0003B0, "Member 'UWBP_VHSoverlay_C::GeneralTimePassControl' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, bHasDateBox) == 0x0003B4, "Member 'UWBP_VHSoverlay_C::bHasDateBox' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, bHasPlayButton) == 0x0003B5, "Member 'UWBP_VHSoverlay_C::bHasPlayButton' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, CornerWatermarkStruct) == 0x0003B8, "Member 'UWBP_VHSoverlay_C::CornerWatermarkStruct' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, FullscreenWatermarkStruct) == 0x0003D0, "Member 'UWBP_VHSoverlay_C::FullscreenWatermarkStruct' has a wrong offset!");
static_assert(offsetof(UWBP_VHSoverlay_C, Two4Hr) == 0x0003E8, "Member 'UWBP_VHSoverlay_C::Two4Hr' has a wrong offset!");

}

