#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Egg

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Egg.WBP_Egg_C
// 0x0050 (0x0330 - 0x02E0)
class UWBP_Egg_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_0;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Egg;                                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Embryo;                                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 JoinRequestIndicator;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Rot;                                               // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Shell;                                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ATIDinosaurBase*                        Dinosaur;                                          // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         EggIndex;                                          // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_MyDinosaurProfile_C*               DinoProfile;                                       // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Egg_Button_0_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WBP_Egg(int32 EntryPoint);
	class FText GetText_0();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Egg_C">();
	}
	static class UWBP_Egg_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Egg_C>();
	}
};
static_assert(alignof(UWBP_Egg_C) == 0x000008, "Wrong alignment on UWBP_Egg_C");
static_assert(sizeof(UWBP_Egg_C) == 0x000330, "Wrong size on UWBP_Egg_C");
static_assert(offsetof(UWBP_Egg_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Egg_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Egg_C, Button_0) == 0x0002E8, "Member 'UWBP_Egg_C::Button_0' has a wrong offset!");
static_assert(offsetof(UWBP_Egg_C, Egg) == 0x0002F0, "Member 'UWBP_Egg_C::Egg' has a wrong offset!");
static_assert(offsetof(UWBP_Egg_C, Embryo) == 0x0002F8, "Member 'UWBP_Egg_C::Embryo' has a wrong offset!");
static_assert(offsetof(UWBP_Egg_C, JoinRequestIndicator) == 0x000300, "Member 'UWBP_Egg_C::JoinRequestIndicator' has a wrong offset!");
static_assert(offsetof(UWBP_Egg_C, Rot) == 0x000308, "Member 'UWBP_Egg_C::Rot' has a wrong offset!");
static_assert(offsetof(UWBP_Egg_C, Shell) == 0x000310, "Member 'UWBP_Egg_C::Shell' has a wrong offset!");
static_assert(offsetof(UWBP_Egg_C, Dinosaur) == 0x000318, "Member 'UWBP_Egg_C::Dinosaur' has a wrong offset!");
static_assert(offsetof(UWBP_Egg_C, EggIndex) == 0x000320, "Member 'UWBP_Egg_C::EggIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Egg_C, DinoProfile) == 0x000328, "Member 'UWBP_Egg_C::DinoProfile' has a wrong offset!");

}

