#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RectangleButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_RectangleButton.WBP_RectangleButton_C.ExecuteUbergraph_WBP_RectangleButton
// 0x0008 (0x0008 - 0x0000)
struct WBP_RectangleButton_C_ExecuteUbergraph_WBP_RectangleButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RectangleButton_C_ExecuteUbergraph_WBP_RectangleButton) == 0x000004, "Wrong alignment on WBP_RectangleButton_C_ExecuteUbergraph_WBP_RectangleButton");
static_assert(sizeof(WBP_RectangleButton_C_ExecuteUbergraph_WBP_RectangleButton) == 0x000008, "Wrong size on WBP_RectangleButton_C_ExecuteUbergraph_WBP_RectangleButton");
static_assert(offsetof(WBP_RectangleButton_C_ExecuteUbergraph_WBP_RectangleButton, EntryPoint) == 0x000000, "Member 'WBP_RectangleButton_C_ExecuteUbergraph_WBP_RectangleButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RectangleButton_C_ExecuteUbergraph_WBP_RectangleButton, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_RectangleButton_C_ExecuteUbergraph_WBP_RectangleButton::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_RectangleButton.WBP_RectangleButton_C.GetImages
// 0x1310 (0x1310 - 0x0000)
struct WBP_RectangleButton_C_GetImages final
{
public:
	struct FSlateBrush                            NormalOut;                                         // 0x0000(0x00D0)(Parm, OutParm)
	struct FSlateBrush                            HoveredOut;                                        // 0x00D0(0x00D0)(Parm, OutParm)
	struct FSlateBrush                            PressedOut;                                        // 0x01A0(0x00D0)(Parm, OutParm)
	struct FSlateBrush                            DisabledOut;                                       // 0x0270(0x00D0)(Parm, OutParm)
	struct FButtonStyle                           ButtonStyle;                                       // 0x0340(0x03F0)(Edit, BlueprintVisible)
	struct FButtonStyle                           BottomButtonStyle;                                 // 0x0730(0x03F0)(Edit, BlueprintVisible)
	struct FButtonStyle                           MiddleButtonStyle;                                 // 0x0B20(0x03F0)(Edit, BlueprintVisible)
	struct FButtonStyle                           TopButtonStyle;                                    // 0x0F10(0x03F0)(Edit, BlueprintVisible)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x1300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RectangleButton_C_GetImages) == 0x000010, "Wrong alignment on WBP_RectangleButton_C_GetImages");
static_assert(sizeof(WBP_RectangleButton_C_GetImages) == 0x001310, "Wrong size on WBP_RectangleButton_C_GetImages");
static_assert(offsetof(WBP_RectangleButton_C_GetImages, NormalOut) == 0x000000, "Member 'WBP_RectangleButton_C_GetImages::NormalOut' has a wrong offset!");
static_assert(offsetof(WBP_RectangleButton_C_GetImages, HoveredOut) == 0x0000D0, "Member 'WBP_RectangleButton_C_GetImages::HoveredOut' has a wrong offset!");
static_assert(offsetof(WBP_RectangleButton_C_GetImages, PressedOut) == 0x0001A0, "Member 'WBP_RectangleButton_C_GetImages::PressedOut' has a wrong offset!");
static_assert(offsetof(WBP_RectangleButton_C_GetImages, DisabledOut) == 0x000270, "Member 'WBP_RectangleButton_C_GetImages::DisabledOut' has a wrong offset!");
static_assert(offsetof(WBP_RectangleButton_C_GetImages, ButtonStyle) == 0x000340, "Member 'WBP_RectangleButton_C_GetImages::ButtonStyle' has a wrong offset!");
static_assert(offsetof(WBP_RectangleButton_C_GetImages, BottomButtonStyle) == 0x000730, "Member 'WBP_RectangleButton_C_GetImages::BottomButtonStyle' has a wrong offset!");
static_assert(offsetof(WBP_RectangleButton_C_GetImages, MiddleButtonStyle) == 0x000B20, "Member 'WBP_RectangleButton_C_GetImages::MiddleButtonStyle' has a wrong offset!");
static_assert(offsetof(WBP_RectangleButton_C_GetImages, TopButtonStyle) == 0x000F10, "Member 'WBP_RectangleButton_C_GetImages::TopButtonStyle' has a wrong offset!");
static_assert(offsetof(WBP_RectangleButton_C_GetImages, K2Node_SwitchEnum_CmpSuccess) == 0x001300, "Member 'WBP_RectangleButton_C_GetImages::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_RectangleButton.WBP_RectangleButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_RectangleButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RectangleButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_RectangleButton_C_PreConstruct");
static_assert(sizeof(WBP_RectangleButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_RectangleButton_C_PreConstruct");
static_assert(offsetof(WBP_RectangleButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_RectangleButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_RectangleButton.WBP_RectangleButton_C.Refresh
// 0x0730 (0x0730 - 0x0000)
struct WBP_RectangleButton_C_Refresh final
{
public:
	struct FSlateBrush                            CallFunc_GetImages_NormalOut;                      // 0x0000(0x00D0)()
	struct FSlateBrush                            CallFunc_GetImages_HoveredOut;                     // 0x00D0(0x00D0)()
	struct FSlateBrush                            CallFunc_GetImages_PressedOut;                     // 0x01A0(0x00D0)()
	struct FSlateBrush                            CallFunc_GetImages_DisabledOut;                    // 0x0270(0x00D0)()
	struct FButtonStyle                           K2Node_MakeStruct_ButtonStyle;                     // 0x0340(0x03F0)()
};
static_assert(alignof(WBP_RectangleButton_C_Refresh) == 0x000010, "Wrong alignment on WBP_RectangleButton_C_Refresh");
static_assert(sizeof(WBP_RectangleButton_C_Refresh) == 0x000730, "Wrong size on WBP_RectangleButton_C_Refresh");
static_assert(offsetof(WBP_RectangleButton_C_Refresh, CallFunc_GetImages_NormalOut) == 0x000000, "Member 'WBP_RectangleButton_C_Refresh::CallFunc_GetImages_NormalOut' has a wrong offset!");
static_assert(offsetof(WBP_RectangleButton_C_Refresh, CallFunc_GetImages_HoveredOut) == 0x0000D0, "Member 'WBP_RectangleButton_C_Refresh::CallFunc_GetImages_HoveredOut' has a wrong offset!");
static_assert(offsetof(WBP_RectangleButton_C_Refresh, CallFunc_GetImages_PressedOut) == 0x0001A0, "Member 'WBP_RectangleButton_C_Refresh::CallFunc_GetImages_PressedOut' has a wrong offset!");
static_assert(offsetof(WBP_RectangleButton_C_Refresh, CallFunc_GetImages_DisabledOut) == 0x000270, "Member 'WBP_RectangleButton_C_Refresh::CallFunc_GetImages_DisabledOut' has a wrong offset!");
static_assert(offsetof(WBP_RectangleButton_C_Refresh, K2Node_MakeStruct_ButtonStyle) == 0x000340, "Member 'WBP_RectangleButton_C_Refresh::K2Node_MakeStruct_ButtonStyle' has a wrong offset!");

}

