#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SpawnZoneSelect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "TheIsle_structs.hpp"
#include "TheIsle_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SpawnZoneSelect.WBP_SpawnZoneSelect_C
// 0x02B8 (0x0650 - 0x0398)
class UWBP_SpawnZoneSelect_C final : public UTISpawnZoneSelectWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CodeFades;                                         // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Black;                                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Cancel;                                     // 0x03B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Confirm;                                    // 0x03C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Nest;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DNAscroll;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HighlightedSpawnLoc;                               // 0x03D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LowerFade;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MapImage;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Overlay;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RedGlowL;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                RenderImageBorder;                                 // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScreenBorder;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_SpawnLocations;                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollBoxBG;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScrollDarken;                                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SlidersBG;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UpperFade;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_UMG_Dossier_C*                      DossierUMG;                                        // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              EventCancel;                                       // 0x0440(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UBP_GameInstance_C*                     GameInstanceRef;                                   // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, struct FVector2D>           SpawnLocHighlightMap;                              // 0x0458(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bCanAddSpawnLoc;                                   // 0x04A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerController_C*                 PC;                                                // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     As_BP_Game_Instance;                               // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TMap<class FString, class UTexture2D*>        MapsImage;                                         // 0x04C0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 MapName;                                           // 0x0510(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TMap<class FName, struct FVector2D>           SpawnLocHighlightMapGateway;                       // 0x0520(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector2D                              HighlightTranslation;                              // 0x0570(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   HumanClass;                                        // 0x0580(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FPlayerSpawnCooldowns                  PlayerSpawnCooldown;                               // 0x05A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         NewVar;                                            // 0x05F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FC[0x4];                                      // 0x05FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, double>                   Cooldowns;                                         // 0x0600(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__Button_Cancel_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__Button_Confirm_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_SpawnZoneSelect(int32 EntryPoint);
	class FText Get_Text_Gender_Text_0();
	void Highlight(const class FText& HighlightedZone);
	void Reset_Highlight();
	void ResetStyles();
	void SelectedSpawnZone(const class FText& SelectedZoneName);
	void SpawnCooldownsCallback(const TArray<struct FSpawnCooldowns>& Cooldowns_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SpawnZoneSelect_C">();
	}
	static class UWBP_SpawnZoneSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SpawnZoneSelect_C>();
	}
};
static_assert(alignof(UWBP_SpawnZoneSelect_C) == 0x000008, "Wrong alignment on UWBP_SpawnZoneSelect_C");
static_assert(sizeof(UWBP_SpawnZoneSelect_C) == 0x000650, "Wrong size on UWBP_SpawnZoneSelect_C");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, UberGraphFrame) == 0x000398, "Member 'UWBP_SpawnZoneSelect_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, CodeFades) == 0x0003A0, "Member 'UWBP_SpawnZoneSelect_C::CodeFades' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, FadeIn) == 0x0003A8, "Member 'UWBP_SpawnZoneSelect_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, Black) == 0x0003B0, "Member 'UWBP_SpawnZoneSelect_C::Black' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, Button_Cancel) == 0x0003B8, "Member 'UWBP_SpawnZoneSelect_C::Button_Cancel' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, Button_Confirm) == 0x0003C0, "Member 'UWBP_SpawnZoneSelect_C::Button_Confirm' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, Button_Nest) == 0x0003C8, "Member 'UWBP_SpawnZoneSelect_C::Button_Nest' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, DNAscroll) == 0x0003D0, "Member 'UWBP_SpawnZoneSelect_C::DNAscroll' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, HighlightedSpawnLoc) == 0x0003D8, "Member 'UWBP_SpawnZoneSelect_C::HighlightedSpawnLoc' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, LowerFade) == 0x0003E0, "Member 'UWBP_SpawnZoneSelect_C::LowerFade' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, MapImage) == 0x0003E8, "Member 'UWBP_SpawnZoneSelect_C::MapImage' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, Overlay) == 0x0003F0, "Member 'UWBP_SpawnZoneSelect_C::Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, RedGlowL) == 0x0003F8, "Member 'UWBP_SpawnZoneSelect_C::RedGlowL' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, RenderImageBorder) == 0x000400, "Member 'UWBP_SpawnZoneSelect_C::RenderImageBorder' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, ScreenBorder) == 0x000408, "Member 'UWBP_SpawnZoneSelect_C::ScreenBorder' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, ScrollBox_SpawnLocations) == 0x000410, "Member 'UWBP_SpawnZoneSelect_C::ScrollBox_SpawnLocations' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, ScrollBoxBG) == 0x000418, "Member 'UWBP_SpawnZoneSelect_C::ScrollBoxBG' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, ScrollDarken) == 0x000420, "Member 'UWBP_SpawnZoneSelect_C::ScrollDarken' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, SlidersBG) == 0x000428, "Member 'UWBP_SpawnZoneSelect_C::SlidersBG' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, UpperFade) == 0x000430, "Member 'UWBP_SpawnZoneSelect_C::UpperFade' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, DossierUMG) == 0x000438, "Member 'UWBP_SpawnZoneSelect_C::DossierUMG' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, EventCancel) == 0x000440, "Member 'UWBP_SpawnZoneSelect_C::EventCancel' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, GameInstanceRef) == 0x000450, "Member 'UWBP_SpawnZoneSelect_C::GameInstanceRef' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, SpawnLocHighlightMap) == 0x000458, "Member 'UWBP_SpawnZoneSelect_C::SpawnLocHighlightMap' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, bCanAddSpawnLoc) == 0x0004A8, "Member 'UWBP_SpawnZoneSelect_C::bCanAddSpawnLoc' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, PC) == 0x0004B0, "Member 'UWBP_SpawnZoneSelect_C::PC' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, As_BP_Game_Instance) == 0x0004B8, "Member 'UWBP_SpawnZoneSelect_C::As_BP_Game_Instance' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, MapsImage) == 0x0004C0, "Member 'UWBP_SpawnZoneSelect_C::MapsImage' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, MapName) == 0x000510, "Member 'UWBP_SpawnZoneSelect_C::MapName' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, SpawnLocHighlightMapGateway) == 0x000520, "Member 'UWBP_SpawnZoneSelect_C::SpawnLocHighlightMapGateway' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, HighlightTranslation) == 0x000570, "Member 'UWBP_SpawnZoneSelect_C::HighlightTranslation' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, HumanClass) == 0x000580, "Member 'UWBP_SpawnZoneSelect_C::HumanClass' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, PlayerSpawnCooldown) == 0x0005A8, "Member 'UWBP_SpawnZoneSelect_C::PlayerSpawnCooldown' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, NewVar) == 0x0005F8, "Member 'UWBP_SpawnZoneSelect_C::NewVar' has a wrong offset!");
static_assert(offsetof(UWBP_SpawnZoneSelect_C, Cooldowns) == 0x000600, "Member 'UWBP_SpawnZoneSelect_C::Cooldowns' has a wrong offset!");

}

