#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SimpleText

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_SimpleText.WBP_SimpleText_C.ExecuteUbergraph_WBP_SimpleText
// 0x001C (0x001C - 0x0000)
struct WBP_SimpleText_C_ExecuteUbergraph_WBP_SimpleText final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0008(0x0014)()
};
static_assert(alignof(WBP_SimpleText_C_ExecuteUbergraph_WBP_SimpleText) == 0x000004, "Wrong alignment on WBP_SimpleText_C_ExecuteUbergraph_WBP_SimpleText");
static_assert(sizeof(WBP_SimpleText_C_ExecuteUbergraph_WBP_SimpleText) == 0x00001C, "Wrong size on WBP_SimpleText_C_ExecuteUbergraph_WBP_SimpleText");
static_assert(offsetof(WBP_SimpleText_C_ExecuteUbergraph_WBP_SimpleText, EntryPoint) == 0x000000, "Member 'WBP_SimpleText_C_ExecuteUbergraph_WBP_SimpleText::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SimpleText_C_ExecuteUbergraph_WBP_SimpleText, Temp_bool_Variable) == 0x000004, "Member 'WBP_SimpleText_C_ExecuteUbergraph_WBP_SimpleText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SimpleText_C_ExecuteUbergraph_WBP_SimpleText, K2Node_Select_Default) == 0x000008, "Member 'WBP_SimpleText_C_ExecuteUbergraph_WBP_SimpleText::K2Node_Select_Default' has a wrong offset!");

}

