#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NestSelectItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NestSelectItem.WBP_NestSelectItem_C
// 0x0040 (0x0320 - 0x02E0)
class UWBP_NestSelectItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG;                                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Main;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Name;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NestSelect_C*                      Parent;                                            // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                 MyClass;                                           // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   ClassName;                                         // 0x0310(0x0010)(Edit, BlueprintVisible)

public:
	void BndEvt__Button_Main_K2Node_ComponentBoundEvent_70_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_NestSelectItem(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NestSelectItem_C">();
	}
	static class UWBP_NestSelectItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NestSelectItem_C>();
	}
};
static_assert(alignof(UWBP_NestSelectItem_C) == 0x000008, "Wrong alignment on UWBP_NestSelectItem_C");
static_assert(sizeof(UWBP_NestSelectItem_C) == 0x000320, "Wrong size on UWBP_NestSelectItem_C");
static_assert(offsetof(UWBP_NestSelectItem_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_NestSelectItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelectItem_C, BG) == 0x0002E8, "Member 'UWBP_NestSelectItem_C::BG' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelectItem_C, Button_Main) == 0x0002F0, "Member 'UWBP_NestSelectItem_C::Button_Main' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelectItem_C, Text_Name) == 0x0002F8, "Member 'UWBP_NestSelectItem_C::Text_Name' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelectItem_C, Parent) == 0x000300, "Member 'UWBP_NestSelectItem_C::Parent' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelectItem_C, MyClass) == 0x000308, "Member 'UWBP_NestSelectItem_C::MyClass' has a wrong offset!");
static_assert(offsetof(UWBP_NestSelectItem_C, ClassName) == 0x000310, "Member 'UWBP_NestSelectItem_C::ClassName' has a wrong offset!");

}

