#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HUD_Annoucement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HUD_Annoucement.WBP_HUD_Annoucement_C
// 0x0038 (0x0318 - 0x02E0)
class UWBP_HUD_Annoucement_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             MessageText;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MessageText_1;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MessageText_2;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   AnnouncerName;                                     // 0x0300(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	double                                        TimeToLast;                                        // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void CustomEvent_0();
	void ExecuteUbergraph_WBP_HUD_Annoucement(int32 EntryPoint);
	void SetMessage(const class FString& Message);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HUD_Annoucement_C">();
	}
	static class UWBP_HUD_Annoucement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HUD_Annoucement_C>();
	}
};
static_assert(alignof(UWBP_HUD_Annoucement_C) == 0x000008, "Wrong alignment on UWBP_HUD_Annoucement_C");
static_assert(sizeof(UWBP_HUD_Annoucement_C) == 0x000318, "Wrong size on UWBP_HUD_Annoucement_C");
static_assert(offsetof(UWBP_HUD_Annoucement_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_HUD_Annoucement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Annoucement_C, MessageText) == 0x0002E8, "Member 'UWBP_HUD_Annoucement_C::MessageText' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Annoucement_C, MessageText_1) == 0x0002F0, "Member 'UWBP_HUD_Annoucement_C::MessageText_1' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Annoucement_C, MessageText_2) == 0x0002F8, "Member 'UWBP_HUD_Annoucement_C::MessageText_2' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Annoucement_C, AnnouncerName) == 0x000300, "Member 'UWBP_HUD_Annoucement_C::AnnouncerName' has a wrong offset!");
static_assert(offsetof(UWBP_HUD_Annoucement_C, TimeToLast) == 0x000310, "Member 'UWBP_HUD_Annoucement_C::TimeToLast' has a wrong offset!");

}

