#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_QueTest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_QueTest.WBP_QueTest_C
// 0x0038 (0x0318 - 0x02E0)
class UWBP_QueTest_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCircularThrobber*                      CircularThrobber_0;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x02F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_72;                                      // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bQueing;                                           // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   IP;                                                // 0x0308(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_WBP_QueTest(int32 EntryPoint);
	class FText GetText_0();
	ESlateVisibility GetVisibility_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_QueTest_C">();
	}
	static class UWBP_QueTest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_QueTest_C>();
	}
};
static_assert(alignof(UWBP_QueTest_C) == 0x000008, "Wrong alignment on UWBP_QueTest_C");
static_assert(sizeof(UWBP_QueTest_C) == 0x000318, "Wrong size on UWBP_QueTest_C");
static_assert(offsetof(UWBP_QueTest_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_QueTest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_QueTest_C, CircularThrobber_0) == 0x0002E8, "Member 'UWBP_QueTest_C::CircularThrobber_0' has a wrong offset!");
static_assert(offsetof(UWBP_QueTest_C, HorizontalBox_0) == 0x0002F0, "Member 'UWBP_QueTest_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UWBP_QueTest_C, TextBlock_72) == 0x0002F8, "Member 'UWBP_QueTest_C::TextBlock_72' has a wrong offset!");
static_assert(offsetof(UWBP_QueTest_C, bQueing) == 0x000300, "Member 'UWBP_QueTest_C::bQueing' has a wrong offset!");
static_assert(offsetof(UWBP_QueTest_C, IP) == 0x000308, "Member 'UWBP_QueTest_C::IP' has a wrong offset!");

}

