#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Keybinding

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Keybinding.WBP_Keybinding_C
// 0x00E8 (0x03C8 - 0x02E0)
class UWBP_Keybinding_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_CheckBox_C*                        AltModifier;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_373;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CheckBox_C*                        CmdModifier;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CheckBox_C*                        CtrlModifier;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CheckBox_C*                        Inverted;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             InvertedKeybindDescription;                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             KeybindDescriptionText;                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             KeybindDescriptionText_1;                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             KeybindDescriptionText_2;                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             KeybindDescriptionText_3;                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             KeybindDescriptionText_4;                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             KeybindKeyText;                                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Modifiers;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CheckBox_C*                        ShiftModifier;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FInputAxisKeyMapping                   AxisKeyMap;                                        // 0x0358(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bIsAxis;                                           // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionKeyMapping                 ActionKeyMap;                                      // 0x0388(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bIsGamepad;                                        // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Keybinds_C*                        OwningWidget;                                      // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bCanBeInverted;                                    // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__AltModifier_K2Node_ComponentBoundEvent_3_OnCheckStateChanged__DelegateSignature(bool IsChecked);
	void BndEvt__Button_373_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__CmdModifier_K2Node_ComponentBoundEvent_4_OnCheckStateChanged__DelegateSignature(bool IsChecked);
	void BndEvt__CtrlModifier_K2Node_ComponentBoundEvent_2_OnCheckStateChanged__DelegateSignature(bool IsChecked);
	void BndEvt__Inverted_K2Node_ComponentBoundEvent_5_OnCheckStateChanged__DelegateSignature(bool IsChecked);
	void BndEvt__ShiftModifier_K2Node_ComponentBoundEvent_1_OnCheckStateChanged__DelegateSignature(bool IsChecked);
	void Construct();
	void ExecuteUbergraph_WBP_Keybinding(int32 EntryPoint);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void SetupNewKeybinding(const struct FKey& Input, struct FEventReply* EventReply);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Keybinding_C">();
	}
	static class UWBP_Keybinding_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Keybinding_C>();
	}
};
static_assert(alignof(UWBP_Keybinding_C) == 0x000008, "Wrong alignment on UWBP_Keybinding_C");
static_assert(sizeof(UWBP_Keybinding_C) == 0x0003C8, "Wrong size on UWBP_Keybinding_C");
static_assert(offsetof(UWBP_Keybinding_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_Keybinding_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Keybinding_C, AltModifier) == 0x0002E8, "Member 'UWBP_Keybinding_C::AltModifier' has a wrong offset!");
static_assert(offsetof(UWBP_Keybinding_C, Button_373) == 0x0002F0, "Member 'UWBP_Keybinding_C::Button_373' has a wrong offset!");
static_assert(offsetof(UWBP_Keybinding_C, CmdModifier) == 0x0002F8, "Member 'UWBP_Keybinding_C::CmdModifier' has a wrong offset!");
static_assert(offsetof(UWBP_Keybinding_C, CtrlModifier) == 0x000300, "Member 'UWBP_Keybinding_C::CtrlModifier' has a wrong offset!");
static_assert(offsetof(UWBP_Keybinding_C, Inverted) == 0x000308, "Member 'UWBP_Keybinding_C::Inverted' has a wrong offset!");
static_assert(offsetof(UWBP_Keybinding_C, InvertedKeybindDescription) == 0x000310, "Member 'UWBP_Keybinding_C::InvertedKeybindDescription' has a wrong offset!");
static_assert(offsetof(UWBP_Keybinding_C, KeybindDescriptionText) == 0x000318, "Member 'UWBP_Keybinding_C::KeybindDescriptionText' has a wrong offset!");
static_assert(offsetof(UWBP_Keybinding_C, KeybindDescriptionText_1) == 0x000320, "Member 'UWBP_Keybinding_C::KeybindDescriptionText_1' has a wrong offset!");
static_assert(offsetof(UWBP_Keybinding_C, KeybindDescriptionText_2) == 0x000328, "Member 'UWBP_Keybinding_C::KeybindDescriptionText_2' has a wrong offset!");
static_assert(offsetof(UWBP_Keybinding_C, KeybindDescriptionText_3) == 0x000330, "Member 'UWBP_Keybinding_C::KeybindDescriptionText_3' has a wrong offset!");
static_assert(offsetof(UWBP_Keybinding_C, KeybindDescriptionText_4) == 0x000338, "Member 'UWBP_Keybinding_C::KeybindDescriptionText_4' has a wrong offset!");
static_assert(offsetof(UWBP_Keybinding_C, KeybindKeyText) == 0x000340, "Member 'UWBP_Keybinding_C::KeybindKeyText' has a wrong offset!");
static_assert(offsetof(UWBP_Keybinding_C, Modifiers) == 0x000348, "Member 'UWBP_Keybinding_C::Modifiers' has a wrong offset!");
static_assert(offsetof(UWBP_Keybinding_C, ShiftModifier) == 0x000350, "Member 'UWBP_Keybinding_C::ShiftModifier' has a wrong offset!");
static_assert(offsetof(UWBP_Keybinding_C, AxisKeyMap) == 0x000358, "Member 'UWBP_Keybinding_C::AxisKeyMap' has a wrong offset!");
static_assert(offsetof(UWBP_Keybinding_C, bIsAxis) == 0x000380, "Member 'UWBP_Keybinding_C::bIsAxis' has a wrong offset!");
static_assert(offsetof(UWBP_Keybinding_C, ActionKeyMap) == 0x000388, "Member 'UWBP_Keybinding_C::ActionKeyMap' has a wrong offset!");
static_assert(offsetof(UWBP_Keybinding_C, bIsGamepad) == 0x0003B0, "Member 'UWBP_Keybinding_C::bIsGamepad' has a wrong offset!");
static_assert(offsetof(UWBP_Keybinding_C, OwningWidget) == 0x0003B8, "Member 'UWBP_Keybinding_C::OwningWidget' has a wrong offset!");
static_assert(offsetof(UWBP_Keybinding_C, bCanBeInverted) == 0x0003C0, "Member 'UWBP_Keybinding_C::bCanBeInverted' has a wrong offset!");

}

