#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterSelect

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CharacterSelect.WBP_CharacterSelect_C.ExecuteUbergraph_WBP_CharacterSelect
// 0x0068 (0x0068 - 0x0000)
struct WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerController_C*                 K2Node_DynamicCast_AsBP_Player_Controller;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerController_C*                 K2Node_DynamicCast_AsBP_Player_Controller_1;       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue_1;            // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_GameInstance_C*                     K2Node_DynamicCast_AsBP_Game_Instance_1;           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_SoftClassReference_ReturnValue; // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect) == 0x000008, "Wrong alignment on WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect");
static_assert(sizeof(WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect) == 0x000068, "Wrong size on WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect");
static_assert(offsetof(WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect, EntryPoint) == 0x000000, "Member 'WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect, K2Node_DynamicCast_AsBP_Player_Controller) == 0x000010, "Member 'WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect::K2Node_DynamicCast_AsBP_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect, CallFunc_GetGameInstance_ReturnValue) == 0x000020, "Member 'WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect, K2Node_DynamicCast_AsBP_Game_Instance) == 0x000028, "Member 'WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect::K2Node_DynamicCast_AsBP_Game_Instance' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000038, "Member 'WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect, K2Node_DynamicCast_AsBP_Player_Controller_1) == 0x000040, "Member 'WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect::K2Node_DynamicCast_AsBP_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect, CallFunc_GetGameInstance_ReturnValue_1) == 0x000050, "Member 'WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect::CallFunc_GetGameInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect, K2Node_DynamicCast_AsBP_Game_Instance_1) == 0x000058, "Member 'WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect::K2Node_DynamicCast_AsBP_Game_Instance_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect, K2Node_DynamicCast_bSuccess_3) == 0x000060, "Member 'WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect, CallFunc_EqualEqual_SoftClassReference_ReturnValue) == 0x000061, "Member 'WBP_CharacterSelect_C_ExecuteUbergraph_WBP_CharacterSelect::CallFunc_EqualEqual_SoftClassReference_ReturnValue' has a wrong offset!");

// Function WBP_CharacterSelect.WBP_CharacterSelect_C.Get_Text_Gender_Text_0
// 0x0050 (0x0050 - 0x0000)
struct WBP_CharacterSelect_C_Get_Text_Gender_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0040(0x0010)()
};
static_assert(alignof(WBP_CharacterSelect_C_Get_Text_Gender_Text_0) == 0x000008, "Wrong alignment on WBP_CharacterSelect_C_Get_Text_Gender_Text_0");
static_assert(sizeof(WBP_CharacterSelect_C_Get_Text_Gender_Text_0) == 0x000050, "Wrong size on WBP_CharacterSelect_C_Get_Text_Gender_Text_0");
static_assert(offsetof(WBP_CharacterSelect_C_Get_Text_Gender_Text_0, ReturnValue) == 0x000000, "Member 'WBP_CharacterSelect_C_Get_Text_Gender_Text_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelect_C_Get_Text_Gender_Text_0, Temp_bool_Variable) == 0x000010, "Member 'WBP_CharacterSelect_C_Get_Text_Gender_Text_0::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelect_C_Get_Text_Gender_Text_0, Temp_text_Variable) == 0x000018, "Member 'WBP_CharacterSelect_C_Get_Text_Gender_Text_0::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelect_C_Get_Text_Gender_Text_0, Temp_text_Variable_1) == 0x000028, "Member 'WBP_CharacterSelect_C_Get_Text_Gender_Text_0::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelect_C_Get_Text_Gender_Text_0, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_CharacterSelect_C_Get_Text_Gender_Text_0::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterSelect_C_Get_Text_Gender_Text_0, K2Node_Select_Default) == 0x000040, "Member 'WBP_CharacterSelect_C_Get_Text_Gender_Text_0::K2Node_Select_Default' has a wrong offset!");

}

