#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerListSlot

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_PlayerListSlot.WBP_PlayerListSlot_C.ExecuteUbergraph_WBP_PlayerListSlot
// 0x0004 (0x0004 - 0x0000)
struct WBP_PlayerListSlot_C_ExecuteUbergraph_WBP_PlayerListSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerListSlot_C_ExecuteUbergraph_WBP_PlayerListSlot) == 0x000004, "Wrong alignment on WBP_PlayerListSlot_C_ExecuteUbergraph_WBP_PlayerListSlot");
static_assert(sizeof(WBP_PlayerListSlot_C_ExecuteUbergraph_WBP_PlayerListSlot) == 0x000004, "Wrong size on WBP_PlayerListSlot_C_ExecuteUbergraph_WBP_PlayerListSlot");
static_assert(offsetof(WBP_PlayerListSlot_C_ExecuteUbergraph_WBP_PlayerListSlot, EntryPoint) == 0x000000, "Member 'WBP_PlayerListSlot_C_ExecuteUbergraph_WBP_PlayerListSlot::EntryPoint' has a wrong offset!");

// Function WBP_PlayerListSlot.WBP_PlayerListSlot_C.GetPlayerPing
// 0x0020 (0x0020 - 0x0000)
struct WBP_PlayerListSlot_C_GetPlayerPing final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_ByteToText_ReturnValue;              // 0x0010(0x0010)()
};
static_assert(alignof(WBP_PlayerListSlot_C_GetPlayerPing) == 0x000008, "Wrong alignment on WBP_PlayerListSlot_C_GetPlayerPing");
static_assert(sizeof(WBP_PlayerListSlot_C_GetPlayerPing) == 0x000020, "Wrong size on WBP_PlayerListSlot_C_GetPlayerPing");
static_assert(offsetof(WBP_PlayerListSlot_C_GetPlayerPing, ReturnValue) == 0x000000, "Member 'WBP_PlayerListSlot_C_GetPlayerPing::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerListSlot_C_GetPlayerPing, CallFunc_Conv_ByteToText_ReturnValue) == 0x000010, "Member 'WBP_PlayerListSlot_C_GetPlayerPing::CallFunc_Conv_ByteToText_ReturnValue' has a wrong offset!");

}

