#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DinoSelectSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DinoSelectSlot.WBP_DinoSelectSlot_C
// 0x0038 (0x0318 - 0x02E0)
class UWBP_DinoSelectSlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 DinoImage;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Slotbutton;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_134;                                     // 0x02F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DinoClass;                                         // 0x0300(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UClass*                                 MyDinoClass;                                       // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__Slotbutton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_DinoSelectSlot(int32 EntryPoint);
	void ResetButtonAppearance();
	void UpdateDinoSlot(const class FText& ClassName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DinoSelectSlot_C">();
	}
	static class UWBP_DinoSelectSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DinoSelectSlot_C>();
	}
};
static_assert(alignof(UWBP_DinoSelectSlot_C) == 0x000008, "Wrong alignment on UWBP_DinoSelectSlot_C");
static_assert(sizeof(UWBP_DinoSelectSlot_C) == 0x000318, "Wrong size on UWBP_DinoSelectSlot_C");
static_assert(offsetof(UWBP_DinoSelectSlot_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_DinoSelectSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DinoSelectSlot_C, DinoImage) == 0x0002E8, "Member 'UWBP_DinoSelectSlot_C::DinoImage' has a wrong offset!");
static_assert(offsetof(UWBP_DinoSelectSlot_C, Slotbutton) == 0x0002F0, "Member 'UWBP_DinoSelectSlot_C::Slotbutton' has a wrong offset!");
static_assert(offsetof(UWBP_DinoSelectSlot_C, TextBlock_134) == 0x0002F8, "Member 'UWBP_DinoSelectSlot_C::TextBlock_134' has a wrong offset!");
static_assert(offsetof(UWBP_DinoSelectSlot_C, DinoClass) == 0x000300, "Member 'UWBP_DinoSelectSlot_C::DinoClass' has a wrong offset!");
static_assert(offsetof(UWBP_DinoSelectSlot_C, MyDinoClass) == 0x000310, "Member 'UWBP_DinoSelectSlot_C::MyDinoClass' has a wrong offset!");

}

