#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ScalarParameterValue

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ScalarParameterValue.WBP_ScalarParameterValue_C
// 0x0060 (0x0340 - 0x02E0)
class UWBP_ScalarParameterValue_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEditableTextBox*                       Editable_ValueTextBox;                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_107;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ParameterNameText;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                ParameterValueSlider;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ResetButton;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_12;                                      // 0x0310(0x0008)(ExportObject, ZeroConstructor, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PostProcessReference;                              // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   ParameterName;                                     // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        DefaultValue;                                      // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        CurrentValue;                                      // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          VHSeffects_;                                       // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          DisableParameter_;                                 // 0x0339(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bIsFromLoad;                                       // 0x033A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__WBP_ScalarParameterValue_Button_55_K2Node_ComponentBoundEvent_1_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_ScalarParameterValue_EditableTextBox_154_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__WBP_ScalarParameterValue_ParameterValueSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void Construct();
	void ExecuteUbergraph_WBP_ScalarParameterValue(int32 EntryPoint);
	void Get_ParameterValueSlider_Value();
	class FText GetText();
	void InitDefaults();
	void InitialiseMinMax();
	void ResetValues(bool SpecialValue_, double SpecialValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ScalarParameterValue_C">();
	}
	static class UWBP_ScalarParameterValue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ScalarParameterValue_C>();
	}
};
static_assert(alignof(UWBP_ScalarParameterValue_C) == 0x000008, "Wrong alignment on UWBP_ScalarParameterValue_C");
static_assert(sizeof(UWBP_ScalarParameterValue_C) == 0x000340, "Wrong size on UWBP_ScalarParameterValue_C");
static_assert(offsetof(UWBP_ScalarParameterValue_C, UberGraphFrame) == 0x0002E0, "Member 'UWBP_ScalarParameterValue_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ScalarParameterValue_C, Editable_ValueTextBox) == 0x0002E8, "Member 'UWBP_ScalarParameterValue_C::Editable_ValueTextBox' has a wrong offset!");
static_assert(offsetof(UWBP_ScalarParameterValue_C, Image_107) == 0x0002F0, "Member 'UWBP_ScalarParameterValue_C::Image_107' has a wrong offset!");
static_assert(offsetof(UWBP_ScalarParameterValue_C, ParameterNameText) == 0x0002F8, "Member 'UWBP_ScalarParameterValue_C::ParameterNameText' has a wrong offset!");
static_assert(offsetof(UWBP_ScalarParameterValue_C, ParameterValueSlider) == 0x000300, "Member 'UWBP_ScalarParameterValue_C::ParameterValueSlider' has a wrong offset!");
static_assert(offsetof(UWBP_ScalarParameterValue_C, ResetButton) == 0x000308, "Member 'UWBP_ScalarParameterValue_C::ResetButton' has a wrong offset!");
static_assert(offsetof(UWBP_ScalarParameterValue_C, TextBlock_12) == 0x000310, "Member 'UWBP_ScalarParameterValue_C::TextBlock_12' has a wrong offset!");
static_assert(offsetof(UWBP_ScalarParameterValue_C, PostProcessReference) == 0x000318, "Member 'UWBP_ScalarParameterValue_C::PostProcessReference' has a wrong offset!");
static_assert(offsetof(UWBP_ScalarParameterValue_C, ParameterName) == 0x000320, "Member 'UWBP_ScalarParameterValue_C::ParameterName' has a wrong offset!");
static_assert(offsetof(UWBP_ScalarParameterValue_C, DefaultValue) == 0x000328, "Member 'UWBP_ScalarParameterValue_C::DefaultValue' has a wrong offset!");
static_assert(offsetof(UWBP_ScalarParameterValue_C, CurrentValue) == 0x000330, "Member 'UWBP_ScalarParameterValue_C::CurrentValue' has a wrong offset!");
static_assert(offsetof(UWBP_ScalarParameterValue_C, VHSeffects_) == 0x000338, "Member 'UWBP_ScalarParameterValue_C::VHSeffects_' has a wrong offset!");
static_assert(offsetof(UWBP_ScalarParameterValue_C, DisableParameter_) == 0x000339, "Member 'UWBP_ScalarParameterValue_C::DisableParameter_' has a wrong offset!");
static_assert(offsetof(UWBP_ScalarParameterValue_C, bIsFromLoad) == 0x00033A, "Member 'UWBP_ScalarParameterValue_C::bIsFromLoad' has a wrong offset!");

}

