#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SpecPlayersNames

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_SpecPlayersNames.WBP_SpecPlayersNames_C.ExecuteUbergraph_WBP_SpecPlayersNames
// 0x0090 (0x0090 - 0x0000)
struct WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x001C(0x0014)()
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0040(0x0014)()
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_2;                // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0064(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0078(0x0014)()
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames) == 0x000004, "Wrong alignment on WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames");
static_assert(sizeof(WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames) == 0x000090, "Wrong size on WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames");
static_assert(offsetof(WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames, EntryPoint) == 0x000000, "Member 'WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames, Temp_bool_Variable) == 0x000004, "Member 'WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames, Temp_byte_Variable) == 0x000005, "Member 'WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames, Temp_bool_Variable_1) == 0x000007, "Member 'WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames, Temp_byte_Variable_2) == 0x000008, "Member 'WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames, Temp_byte_Variable_3) == 0x000009, "Member 'WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames, K2Node_Select_Default) == 0x00000A, "Member 'WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames, CallFunc_SelectColor_ReturnValue) == 0x00000C, "Member 'WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames, K2Node_MakeStruct_SlateColor) == 0x00001C, "Member 'WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames, CallFunc_SelectColor_ReturnValue_1) == 0x000030, "Member 'WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames, K2Node_MakeStruct_SlateColor_1) == 0x000040, "Member 'WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames, CallFunc_SelectColor_ReturnValue_2) == 0x000054, "Member 'WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames::CallFunc_SelectColor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames, K2Node_MakeStruct_SlateColor_2) == 0x000064, "Member 'WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames, K2Node_MakeStruct_SlateColor_3) == 0x000078, "Member 'WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames, K2Node_Select_Default_1) == 0x00008C, "Member 'WBP_SpecPlayersNames_C_ExecuteUbergraph_WBP_SpecPlayersNames::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_SpecPlayersNames.WBP_SpecPlayersNames_C.Get_Distancebox_Visibility_0
// 0x0005 (0x0005 - 0x0000)
struct WBP_SpecPlayersNames_C_Get_Distancebox_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SpecPlayersNames_C_Get_Distancebox_Visibility_0) == 0x000001, "Wrong alignment on WBP_SpecPlayersNames_C_Get_Distancebox_Visibility_0");
static_assert(sizeof(WBP_SpecPlayersNames_C_Get_Distancebox_Visibility_0) == 0x000005, "Wrong size on WBP_SpecPlayersNames_C_Get_Distancebox_Visibility_0");
static_assert(offsetof(WBP_SpecPlayersNames_C_Get_Distancebox_Visibility_0, ReturnValue) == 0x000000, "Member 'WBP_SpecPlayersNames_C_Get_Distancebox_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_Get_Distancebox_Visibility_0, Temp_bool_Variable) == 0x000001, "Member 'WBP_SpecPlayersNames_C_Get_Distancebox_Visibility_0::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_Get_Distancebox_Visibility_0, Temp_byte_Variable) == 0x000002, "Member 'WBP_SpecPlayersNames_C_Get_Distancebox_Visibility_0::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_Get_Distancebox_Visibility_0, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_SpecPlayersNames_C_Get_Distancebox_Visibility_0::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_Get_Distancebox_Visibility_0, K2Node_Select_Default) == 0x000004, "Member 'WBP_SpecPlayersNames_C_Get_Distancebox_Visibility_0::K2Node_Select_Default' has a wrong offset!");

// Function WBP_SpecPlayersNames.WBP_SpecPlayersNames_C.Get_NameTag_Text_0
// 0x0090 (0x0090 - 0x0000)
struct WBP_SpecPlayersNames_C_Get_NameTag_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0080(0x0010)()
};
static_assert(alignof(WBP_SpecPlayersNames_C_Get_NameTag_Text_0) == 0x000008, "Wrong alignment on WBP_SpecPlayersNames_C_Get_NameTag_Text_0");
static_assert(sizeof(WBP_SpecPlayersNames_C_Get_NameTag_Text_0) == 0x000090, "Wrong size on WBP_SpecPlayersNames_C_Get_NameTag_Text_0");
static_assert(offsetof(WBP_SpecPlayersNames_C_Get_NameTag_Text_0, ReturnValue) == 0x000000, "Member 'WBP_SpecPlayersNames_C_Get_NameTag_Text_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_Get_NameTag_Text_0, Temp_bool_Variable) == 0x000010, "Member 'WBP_SpecPlayersNames_C_Get_NameTag_Text_0::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_Get_NameTag_Text_0, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'WBP_SpecPlayersNames_C_Get_NameTag_Text_0::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_Get_NameTag_Text_0, K2Node_MakeArray_Array) == 0x000060, "Member 'WBP_SpecPlayersNames_C_Get_NameTag_Text_0::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_Get_NameTag_Text_0, CallFunc_Format_ReturnValue) == 0x000070, "Member 'WBP_SpecPlayersNames_C_Get_NameTag_Text_0::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_Get_NameTag_Text_0, K2Node_Select_Default) == 0x000080, "Member 'WBP_SpecPlayersNames_C_Get_NameTag_Text_0::K2Node_Select_Default' has a wrong offset!");

// Function WBP_SpecPlayersNames.WBP_SpecPlayersNames_C.Get_SteamID_Text
// 0x0028 (0x0028 - 0x0000)
struct WBP_SpecPlayersNames_C_Get_SteamID_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0018(0x0010)()
};
static_assert(alignof(WBP_SpecPlayersNames_C_Get_SteamID_Text) == 0x000008, "Wrong alignment on WBP_SpecPlayersNames_C_Get_SteamID_Text");
static_assert(sizeof(WBP_SpecPlayersNames_C_Get_SteamID_Text) == 0x000028, "Wrong size on WBP_SpecPlayersNames_C_Get_SteamID_Text");
static_assert(offsetof(WBP_SpecPlayersNames_C_Get_SteamID_Text, ReturnValue) == 0x000000, "Member 'WBP_SpecPlayersNames_C_Get_SteamID_Text::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_Get_SteamID_Text, Temp_bool_Variable) == 0x000010, "Member 'WBP_SpecPlayersNames_C_Get_SteamID_Text::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SpecPlayersNames_C_Get_SteamID_Text, K2Node_Select_Default) == 0x000018, "Member 'WBP_SpecPlayersNames_C_Get_SteamID_Text::K2Node_Select_Default' has a wrong offset!");

}

