#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DietSource

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "TheIsle_structs.hpp"


namespace SDK::Params
{

// Function WBP_DietSource.WBP_DietSource_C.ExecuteUbergraph_WBP_DietSource
// 0x0220 (0x0220 - 0x0000)
struct WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	ETINutrientType                               Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_3;                            // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0040(0x0014)()
	uint8                                         Pad_54[0xC];                                       // 0x0054(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0060(0x00D0)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0130(0x0010)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Select_Default;                             // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0150(0x00D0)()
};
static_assert(alignof(WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource) == 0x000010, "Wrong alignment on WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource");
static_assert(sizeof(WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource) == 0x000220, "Wrong size on WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource");
static_assert(offsetof(WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource, EntryPoint) == 0x000000, "Member 'WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource, K2Node_MakeStruct_SlateColor) == 0x000004, "Member 'WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource, Temp_byte_Variable) == 0x000018, "Member 'WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource, Temp_object_Variable) == 0x000020, "Member 'WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource, Temp_object_Variable_1) == 0x000028, "Member 'WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource, Temp_object_Variable_2) == 0x000030, "Member 'WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource, Temp_object_Variable_3) == 0x000038, "Member 'WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource, K2Node_MakeStruct_SlateColor_1) == 0x000040, "Member 'WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource, K2Node_MakeStruct_SlateBrush) == 0x000060, "Member 'WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource, CallFunc_Conv_StringToText_ReturnValue) == 0x000130, "Member 'WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000140, "Member 'WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource, K2Node_Select_Default) == 0x000148, "Member 'WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource, K2Node_MakeStruct_SlateBrush_1) == 0x000150, "Member 'WBP_DietSource_C_ExecuteUbergraph_WBP_DietSource::K2Node_MakeStruct_SlateBrush_1' has a wrong offset!");

}

